[
  {
    "chunk_full": "\n\n\n![Image 1](index-1_1.jpg)\n\n**Manifesting Love and Abundance from the** **Dark Night**\n\n_By Rachel McNassor_\n\n__\n\nThe dark night of the soul is a profound spiritual experience. If you are\ngoing through this right now, know that there is nothing wrong with you. You\nare undergoing a deep alchemical shift that has been encoded in the soul since\nthe beginning of human consciousness. This article aims to offer context, 1\n\nsupport, and tips. I will also include my personal story.\n\nMost importantly, I will offer practical guidance about capitalizing on the\ndark night in support of manifesting love and abundance.\n\nMost, if not all, of the people you know are going through a kind of dark\nnight of the soul- but typically, invisibly- under the surface of\ndistractions, performance, and attachments. The dark night is the great\nequalizer.\n\nThere is no amount of money or status that can prevent it, as it is an\nautonomous energy. The dark night may be suppressed for years, or even an\nentire lifetime, and can be in a state of dormancy. This is often the case for\npeople who more or less ‘fit in’ to conventional society.\n\nWhen the darkness calls to us, we may\n\n(understandably!) employ countless deferral and avoidance techniques. But at\nsome point, something mysteriously catalyzes the soul to begin to shed the\nskin of persona. The dark night of the soul is an intensive period of burning\nthrough karma and releasing conditioning. It is a profound spiritual\ninitiation and deserves respect as a holy rite of passage. It is extremely\nuncomfortable.\n\n2\n\nIf you are in the dark night of the soul, it is common to feel that you may\nnot make it through. This is not a normal depression. It is a wrenching\ndissolution of meaning accompanied by deep grief, as if everything you once\nthought was stable is stripped away and you are left bobbing in a violent\nocean of pain and terror. It may sound extreme to speak of it in this way, but\nit is important for you to know that this is a normal experience, so I wish to\ndescribe it with accuracy. You may feel that you are dying, or even wish for\nit.\n\nSomething is dying, but this is a healthy, organic process.\n\nThe part of you that is dying is the part that is no longer needed after your\nregeneration.\n\nThe dark night of the soul can be initiated by a breakup, a health crisis, a\njob loss, or can come out of nowhere.\n\nMany people experience a series of dark night experiences, but it is common to\nhave a ‘big one’ at some point- many times, but not always, at the midlife\npoint. There may be a sense of sliding into the darkness in a way that is out\nof control. It’s true, you don’t have control over the dark night. There are\ntools to cope and move through it. But it has an impetus and momentum of its\nown. The soul has asserted primacy over the ego at 3\n\nthis point. It would probably be more accurate to call it a\n\n‘dark night of the ego.’ Your soul knows what it is doing.\n\nThis is good to keep in mind if you experience feelings of torment and\ndespair. Surrendering to the authority and intelligence of the soul can\nmediate feelings of victimization. However, feeling victimized is okay too.\n\nThe severity of the dark night of the soul is proportionate to your trauma.\nYou are entitled to feel frustration and outrage about the level of difficulty\ninvolved. If the idea of karma comforts you, go with that.\n\nBut do not worry if you feel you are beyond comfort.\n\nYou’re not doing spirituality wrong if you cannot manage to lift yourself to a\nhigher perspective very well. The only misstep you can make during the dark\nnight is to pathologize or judge yourself for your experience.\n\nThe dark night may arrive after years of spiritual practice, therapy, and\npersonal development. It will confront any false sense of security you may\nhave received from adherence to various forms of dogma, protocols, or systems\nof thought. There is a ruthless wildness to it. The sacred cows will tumble,\none-by-one.\n\nDependencies on relationships will be similarly dismantled. There may be a\ncrumbling of relationships 4\n\naround you, or even severe betrayal. People will not understand what you are\ngoing through unless they have been through it themselves. You may experience\nfeelings of harsh disappointment as you advance beyond the capacity of most\npeople to be present for your pain, with the ensuing loneliness. You may feel\nlike a walking early childhood attachment wound, as you experience emotional\nflashbacks to the raw horror of incarnating in a dangerously vulnerable body\namongst people whose unconsciousness is a constant threat to manage. These are\nnormal sensations.\n\nHowever, the dark night will also have a surprising protective effect when it\ncomes to relationships.\n\nGuardians will be activated on your path, like sleeper cells- a reversal of\nAgent Smith’s possession of people in _The Matrix_. People can recognize at\nsome level- perhaps unconsciously- what you are doing when you are walking\nthis sacred path. You may notice that they ‘make way’\n\nfor you. You will receive small kindnesses when you need it. Everyone has\nknowledge, deeply buried in our shared human DNA, that your successful journey\nthrough the dark night has importance and impact beyond just your life. You\nare traversing the way of the shaman, and you 5\n\n![Image 2](index-6_1.jpg)\n\nwill bring medicine back to the collective from your quest. People will\nsometimes be mysteriously compelled to nurture your travels. This support may\ncome from unexpected quarters. You will learn to detach from preferences about\nwho is there for you and who is not.\n\nThis is a superpower because it builds trust between you and the universe.\n\n6\n\nYou might like to know how long the dark night of the soul will last. This is\na legitimate concern, as there may be some urgency because of fatigue. This\nperiod will tax your nervous system. You are being physically upgraded, but\nyou will likely experience it as an exhausting gauntlet. Real rest and\nrestoration may be elusive, as you are under constant pressure, like a\ndiamond. In my opinion, this is the part where you do have some agency.\n\nThere is a task to the dark night. It is highly individual, but specific work\nis needed. Proactive cooperation with the process can expedite your healing.\nTo accept the assignment of the dark night is to humble yourself to spiritual\nconcerns. You may not have wanted this for yourself. You may have wanted a\n‘normal’ life- the life you were promised by mass consciousness- of\nattainment, pleasure, and material gain. But the dark night of the soul is\nhere to shatter that model. It is like Jesus’s analogy about how you cannot\nput new wine in old skins. For you to integrate a higher consciousness, you\nwill need to sacrifice your vessel- all the old ideas and beliefs, and submit\nto a cellular reorganization.\n\nReleasing resistance will ease you out of suffering and usher you into the\ngifts of the dark night, which are 7\n\nsubstantial. Freedom from limitation is at stake. It is worth it.\n\n\n## **My story**\n\nReading stories of people who have successfully navigated an extreme dark\nnight of the soul experience will help you feel less alone. I will tell my\ndark night story here. I entered into a devastating dark night of the soul at\nthe beginning of 2022 when a relationship that was important to me ended\nabruptly and painfully. It was as if someone had shoved me off the edge of a\ncliff. I was in an emotional free-fall for many months. The total timespan of\nmy dark night, which could be called the midlife crisis variety, was around\ntwo years, though I was still stabilizing in year three, and I experienced a\nfew dark night ‘after shocks’- mini dark nights that were more manageable, but\nstill with the same intense, uncomfortable pressure and fear.\n\nThe first three months were agonizing. I had been active with trauma recovery\nfor over a decade, and had not realized how much this one relationship had\ncome to symbolize my last hope for redemption for what things 8\n\nhad been like for me as a child. He was a mirage of false hope- a buffer. With\nhim out of the picture, I was engulfed in unbearable panic. Every moment was\nan emotional emergency. It was similar to the mental health crises I had\nexperienced before, but now completely unmediated by any comforting illusions.\nIt was like waking up in a nightmare. I was in a state of disbelief. I could\nnot accept this reality. I had not thought it possible to be so cruelly\ndiscarded by someone I thought loved me. I questioned my sanity. Obsessive\nthoughts plagued me every second of every day.\n\nBeing an action-oriented person, I tried to ‘fix’ the dark night of the soul\nwith every tool at my disposal. I was particularly preoccupied with clearing\nmy body. This was not totally misguided, but I underestimated how much of the\nrelief and transformation would hinge on a personality- rather than physical,\nchange. I was convinced that I just needed to get off psychiatric medication,\nonce and for all, and to eliminate all processed foods and caffeine. In my\ncase, for my particular physiology, these were aligned pursuits, but I went\ntoo fast, titrating rapidly off a high dose of Gabapentin, which I was taking\nfor anxiety, over the 9\n\ncourse of only a few weeks. The result was an onslaught of anguish and self-\nhatred that had me on my knees, begging god for mercy. Repetitive loving\naffirmations helped during that time, but it took months for my brain\nchemistry to right itself. (*Always consult with medical professionals when\nmaking choices about medications.) I began to experience frightening\nflashbacks, especially during meditation or while partaking in plant medicine.\nI ultimately ceased use of psychedelics altogether, as I was worried that I\nmight not be able to return from the void during one of these journeys, which\ntypically entailed hours of torment. There were typically no visuals\nassociated. With or without drug use, flashbacks during this time involved\ndirect confrontation with what felt like a powerful and toxic parasite that\nhad grafted onto my consciousness via mine and my family’s generational\ntrauma, and perhaps even past lifetimes or the collective unconscious. It was\na voice, or more like a feeling, of toxic unworthiness and shame, like being\ndipped into a suffocating black sludge. I asserted my desire to live over and\nover again, but the only way to get real relief from the strangulation was to\nsubmit repeatedly to change through acknowledging my shadow, feeling and\nreleasing 10\n\nfeelings, and humbling myself to repair my relationships with myself and\nothers. Just when I thought I had done\n\n‘enough,’ by traveling far outside my comfort zone- such as conceding ground\nin a power struggle at work when my ego was activated, or setting boundaries\nwhen I was scared or disempowered, the internal pressure would build again.\nThe spiritual work during this time was relentless. Passivity was not an\noption. It was quite serious and sober.\n\nAfter about one year of the dark night, I was able to shift my focus slightly\ntowards the future. But I had a series of false starts and felt that the\nuniverse was keeping me in place. I was still in a highly disagreeable job\nsituation and experienced a lot of helplessness around money. I was still\nstruggling with a cannabis addiction. I was resentful towards the person who\nhad broken my heart and could not let go of an expectation that he would\ncircle back to me in some fashion. I wanted an apology, or some gesture of\nreconciliation. As the months dragged on, it landed on me with a thud that the\nunconsciousness of this world cannot be wrangled into submission, which forced\nme repeatedly back to focus on myself. I had begun making content on TikTok\nregarding spiritual 11\n\ntopics. I felt a growing sense of compassion for myself and others who were in\nthe thick of heavy emotional processing.\n\nAt the end of 2022 I got Covid, which left me with a neurological condition\nthat caused my eyes to shut involuntarily, leading to a fair amount of\nfunctional blindness, as well as spasms around my nose and contractions in my\nnasal cavities that inhibited my breathing. I was not positioned financially\nto leave my job, and so another lesson began- the lesson of receiving. I had\nto rehouse my dog. Often in public I was forced to place my faith in strangers\nbecause of my inability to see. There was no choice but to ask for help,\nparticularly at work. My team often had to accommodate my disability. I\nthought the condition would ultimately resolve, but as of this writing,\nseveral years later, it has not. I was pushed to reevaluate my future, which\nled me to begin my spiritual counseling practice- my true purpose, which I can\ndo while limiting reliance on my vision. In this final segment of the dark\nnight, my body’s vulnerability led me, finally, into a new chapter. The work\nwas not complete, but the intensive period of turmoil and suffering had\nreceded.\n\n12\n\nThree years after the beginning of this experience, I entered into the dark\nnight once more. When this happened to me it was painful and discouraging, but\nit was nowhere near as severe as the first experience, and I had significant\ntools, which helped me move as quickly as possible through the initiation. It\nagain began with the ending of a relationship. I was humbled by the\ncircumstances, because the patterns that had played out with this relationship\nmirrored the first dark night catalyst almost exactly. I was more conscious\nthis time, and I quickly exited the dynamic when I could see that it was\ndamaging for me, but that still did not prevent me from descending into a\nfrightening and sad spiritual exile. The total timeline was three to four\nmonths. The process of decay, integration, and rebuilding was accelerated by\nthe application of perspectives and tools which I will now discuss!\n\n****\n\n****\n\n13\n\n**Mindset**\n\nMuch has been written about how to navigate the dark night of the soul.\nUltimately each individual must follow their own unique path, which somewhat\nlimits the effectiveness of broad-strokes advice. The key is to come into\nalignment with your individual soul’s blueprint. This requires you to accept\nyour specific incarnation, which is not always so easy! But the work to be\ndone is the work directly in front of you, meaning that the circumstances of\nyour own life provide the curriculum. You must practice patience, and trust\nthat this is not about punishment. It’s actually about manifestation. Your\ncourage in overcoming fear prepares you to receive the goodness of life.\nSeekers are on the fast track, and therefore face heightened existential\ndread. That’s normal. You are a front-runner and it is a placement of\nprivilege and empowerment when channeled in a positive way.\n\nYour greatest enemy during the dark night is resistance.\n\nResistance is common and you should never judge yourself for it. But it will\nfuel and prolong suffering. It may be comforting to think of the resistance as\nan aspect of ego, rather than soul. It isn’t coming from the 14\n\nreal you. You may experience resistance as heavy existential dread. You may\nfeel desperate for escape. You may feel you have been backed into a corner and\nthat you are under extreme spiritual pressure. The gripping fear can become\nparalyzing. Resistance can look like passivity and avoidance of life’s\nproblems.\n\nThere is a lot of good news about existential dread.\n\nThere is no greater high than overcoming fear. And just like another other\nhigh, it is addictive. When existential dread is haunting you, it’s helpful to\nthink of yourself as slightly detached from your avatar, or conditioned self.\n\nWhen you are aligned with your soul, and making choices from that place, you\nwill always be coaxing the\n\n‘small self,’ or persona along, like a child. Think of yourself as the\npuppeteer, wisely propelling the self through the tough conversations, the\nhumbling concessions, the embodiment of uncomfortable sensations, and the\ndissolution of fantasy. When you are not fused with the ego identity,\neverything matters less.\n\nLife is an experiment. The stakes are not so high. You may even come to have a\nsense of humor about the difficulty of all of this. It is _absurd_. When you\ncan sit, like 15\n\nan innocent child, with willingness to play the game, and an open heart, the\ngifts will start to flow.\n\n\n## **Support**\n\nThe only guidance that will make sense to you is from people who have gone\nthrough the dark night and have emerged intact. Your radar for falsehood will\ngrow very acute during the dark night of the soul, so don’t become too\ndiscouraged if you feel that the field of viable teachers narrows\nconsiderably. You are not alone.\n\nMystics since the beginning of time have walked this path. Seekers light the\nway for each other through the darkness, even across millennia. However, one\nof the features of the dark night for many people can be extreme spiritual\nisolation. This is meant to help you center yourself within your own heart.\nThe loneliness is coming up because it’s coming out. In other words, the\nlifetime accrual of feeling separate is being squeezed out of your system, and\nyou will feel it acutely during the transit.\n\nI want to speak candidly here in providing a side note on extreme despair: I\ncalled suicide hotlines twice during 16\n\nmy dark night, and I have zero embarrassment about that. I did not have a plan\nto harm myself, but I felt despair at such an extreme level that I was quite\nfrightened. The people who answer those calls are well-trained to gently guide\nyou out of scary thought loops, so if you ever get in a real pinch, _please\ndon’t go through_ _it alone_. There are compassionate people ready to help\n(You can text 988 in the US- they’re available twenty-four hours a day, seven\ndays a week). If nothing else, it can help you get to the next moment, and\nthat’s the game you are in, moving through each moment, step by careful step.\n\nYou haven’t been left behind. The truth is that you have entered a foreign\nterritory that many do not dare to enter. That’s why you feel alone. It’s not\nrejection or abandonment. You’re embarking on the lone, solitary path of the\nindividual. The failings of codependency and transactional relationships,\nhallmarks of this illusory reality, will be stark to you at this time. You may\nhave a sense of betrayal even by mentors, therapists, or healers whom you had\non a pedestal. This is not because no one can be trusted. This is because you\nare being pointed 17\n\ntowards refinement of your internal resources. The loneliness of the dark\nnight is a worthy price to pay for the discovery of your inner authority. To\nbe sovereign is to lose insecurity and to have faith in yourself. That is pure\ngold.\n\n\n## **The Body**\n\nYour body is your vessel and your lab. In order to transmute the dense\nenergies of the dark night, you must have clarity in the body. This means\nsupport of the natural systems of the body, and addressing any ways in which\nyou are being physically harnessed to negative beliefs through your body. For\nmany that may mean becoming disciplined about foods that contribute to\nsystemic imbalances and cement harmful programming into your cells and\ntissues. This is highly individual and the support of professionals can\ncertainly play a part.\n\nSeek medical guidance for input about choices that could affect your mental\nand emotional equilibrium, as this is a delicate time, and stability is\ncrucial.\n\nClearing of the body will entail emotional purges and these can be quite\ndifficult. It helps to know that this is a 18\n\nnatural and organic process. The key is to keep that energy moving so that it\ndoesn’t stagnate and create self-destructive thought loops. There are many\nways to do somatic work. A slow-moving practice like yoga or tai chi can\nsurface the stuck energy and move it out of your system. You may not feel like\nexercise at all. Or conversely, you may be the type that self-punishes through\nover-exertion. Consistency, rather than force, may make the biggest difference\nof all. Embodiment is where spirituality matures. It is no longer about the\ncorrect beliefs, guru worship, or wishful thinking, Embodiment is what is\nreal, right here and now. It is rigorous honesty about what is presenting in\nyour container, and devotion to metabolizing it. It is not true that time\nalone heals all wounds. You will feel better as you confront the discomfort\nand fear proactively. I wish I could tell you about a shortcut! I would have\ndiscovered it by now if it existed because I was extremely traumatized,\naddicted, and avoidant entering into this experience.\n\n****\n\n****\n\n19\n\n**Manifestation**\n\nYou’re having this experience so that you can clear a pathway for your\nmanifestation to come forth. Teachings about manifestation commonly\nunderemphasize the role of shadow work. The extremity of the dark night shows\nyou how much creative potential you have. All that dense energy is your fuel\nfor a life of abundance, joy, and love. The shadow holds the keys. The shadow\nis not negative; it’s simply the parts of ourselves that we push into our\nblind spot because we were shamed about them. Ritual is a form of embodiment\npractice that involves symbolic gesture, which puts you in the driver’s seat.\nYou become the magician from the tarot, wielding spiritual power into this\nphysical reality. When you practice ritual, you convert shadow material into\nyour good. But that material needs full expression, which is what your ritual\naccomplishes. When you embody shadow elements, you act out a ceremonial play,\nso that the shadow has an audience, and is witnessed. You can think of it as\nbeing temporarily possessed- but not in a scary, science fiction way. The\nenergy only wants your attention, and then it will be satisfied and release\nits hold on you.\n\n20\n\nI will give a personal example from my dark night of the soul about how shadow\nwork makes an actual difference. At the time one of my bosses was very\naggressive with me. She mimicked one of my childhood abusers. They even looked\nthe same! I felt I was in a nightmare. Every time we had a meeting, she would\npredictably lie to me, pressure me, and criticize me. I tried to avoid her,\nfight back, appease her, and overperform in my job. None of these tactics\nworked. I felt the same victimization and helplessness that I did as a child.\nThe dark night of the soul was doing its job, because what was needed was\naddressing the underlying energy. I had resistance about this, because the\ntruth is that I had a lot of rage about the childhood abuse. I thought I had\nalready done the work, and was frustrated that it had not solved this lifelong\npattern of being targeted and scapegoated. A useful thing to understand is\nthat when you are climaxing a pattern, right before the breakthrough point,\nyou may endure a reenactment that is cartoonishly terrible. This is meant to\nhelp you break down denial, the natural defense of the abused or neglected\nchild. In other words, what feels like a regression is actually moving you\nforward, by surfacing what was once minimized. A severe 21\n\nreenactment after you have already been doing the work can be a positive sign\nthat you are at the breakthrough moment, scraping the bottom of the barrel, so\nthat you never have to repeat it.\n\nThe tension was unbearable, and there didn’t seem to be any escape. I applied\nfor other jobs, and was turned down even when I was over-qualified. The\nuniverse was intent that I do this _now._ So, I got busy with anger work. I\nbegan to practice it every day. (instructions on practicing anger rituals to\nfollow, pages 28-33). I began to develop subtle ways to manage the\nrelationship with my boss.\n\nOne day I was deep in the pit of the dark night when I suddenly received\ncreative, inspired thought about how I needed to invite her to an event. I\nrealized that if I was not holding onto the fight with her, that was\n_actually_ the way to win. I humbled myself and extended myself to her, and\nher reaction was so positive that it felt like an incredible superpower. I\nliterally jumped out of my bed, full of new energy. This happened because I\nwas directing my anger towards the origin point. Once I removed the projection\nfrom my boss, it changed the dynamic and we were able to have a more peaceful\nrelationship. She likely felt less pressure to exert control 22\n\nover me, because she was no longer having to carry the invisible projection of\nmy unclaimed anger about a past that had nothing to do with her. The\ncompetition for power was over. I began to have more room to maneuver at work,\nand create. That’s the conversion of anger into manifestation.\n\n23\n\n![Image 3](index-24_1.jpg)\n\n\n## **Anger**\n\nAnger is a powerful manifestation tool, and it is a step that cannot be\nskipped. Anger is largely overlooked in conventional forms of therapy, as well\nas in most expressions of spirituality. Anger is evidence of your love for\nyourself. When you were a child, you experienced outrage about mistreatment\nbecause you knew that it was wrong. However, if your anger was suppressed,\nshamed, or punished by your family, it would have 24\n\nbecome locked away in the shadow. When anger is unconscious it determines your\nreality. It does not matter how ‘nice’ you are, suppressed anger will attract\nvictimization in one form another.\n\nAnger work is how you get yourself out of the scapegoat role so that you can\ncreate your reality. The reason anger feels uncomfortable or taboo is that it\nis a powerful resource, and is therefore hoarded. If one person in your family\nwas allowed to feel anger, that is the person who was allowed to exert\ncontrol. This dynamic is replicated in institutions and jobs. Toxic leaders\nknow how to wield anger over subordinates who are essentially still slaves to\ntheir unprocessed childhood trauma. It is easy to manipulate someone who has\nunconscious anger, because anger that is unconscious is unclaimed, and gets\nprojected outward and animates abusers, who will gladly take on that\nprofitable power for their own benefit. If you have suppressed anger, abusers\ncan hook into your hidden rage, like a battery. They will drain you. But they\nare useful to you. They are performing the _original_ trauma for you. This\npantomime chips away at your denial (and potential trauma amnesia), so that\nyou can excavate and purge feelings from the past.\n\n25\n\nWhen you learn how to metabolize anger, you reverse the pattern of your energy\nbeing extracted by others.\n\nYou increase your magnetism. The world will begin to come towards you. People\ndo not know quite what has changed, and would not be able to describe it, but\nthere is just something about you- they want to protect you and give to you.\nDoing anger work creates a strong energetic boundary around you. You will no\nlonger need to have exhausting conversations convincing others about your\nboundaries. Your energy will be out in front of you, doing the work on your\nbehalf. You gain a layer of spiritual protection through practicing anger\nwork. You become powerful.\n\nAnger work is the most potent form of inner child work.\n\nIt sends a message to the inner child that you love them so much, you are\nwilling to be furious on their behalf about what things were like for them.\nYour inner child finally feels their suffering is taken seriously. Because we\nlive in a quantum soup, when you do anger work, your inner child experiences\nit on their timeline as an adult finally showing up and saying, “Something is\nwrong. This treatment is not ok. Things must change.” You become your own\nknight in shining armor. Therefore, the inner 26\n\nchild relaxes and you will experience a deactivation in your nervous system.\nIn this way, an effective way to reduce anxiety and increase a sense of safety\nin the body is through doing anger work.\n\nThe way anger typically works in our society is that it bubbles under the\nsurface, unacknowledged, until it is triggered, then erupts reactively. Doing\nanger work proactively creates a container for it. I suggest doing anger work\nin ritual format. This enlists spiritual support, because the universe likes\nto see intention and effort, which is what ceremony accomplishes. Think of\nanger ritual as a kind of portal into your childhood frustration, which will\nbe pulled into the present (through the body), and cooked in your lab into\nyour beautiful manifestations. Effective shadow work is not an intellectual\nexercise. It involves feeling the emotion in your body. This is not\ncomfortable, but it is wise to be proactive, rather than suppress it.\nDirecting anger towards the childhood influences, such as through anger\nletters (that you will burn or tear up, not send) peels the reenactment off\nany present-day antagonists. You can do this in the privacy of your home. It’s\na shortcut that influences people more directly (and subtlety) than 27\n\ntrying to wrangle them through direct communication into changing their\nbehavior.\n\n\n## **Ritual**\n\nI will now describe an anger ritual that you can perform frequently to start\nworking trauma energy out of your body during the dark night of the soul. You\nmight even like to do it daily! The total duration will be between 15\n\nand 30 minutes. Repetition will yield the best results. For the purpose of the\nritual, we will assume that you are being triggered by someone. This could be\nan ex who abandoned you, or an authority figure who is pushing you around, or\nanyone who is reenacting your childhood trauma in any way. However, the bulk\nof the exercise will be anger work targeting the point in the past when your\nrelational template was installed (usually by caregivers in childhood).\n\nThe foundational step is to create a container for your ritual. This can be as\nsimple as burning sage before and after the ritual. You can get as intricate\nas you want, such as taking a ritual bath before and after to clear your\nenergy, or wearing special clothing. Our ancestors 28\n\nperformed ceremony to commune with the spirit world.\n\nIt is literally tragic that this has become a peripheral art, but that just\nmeans you have an edge when you partake.\n\nWhen you make effort and put thought into meaningful symbols, spirit world\nsupports you in your quest.\n\nHowever, don’t make your ritual so detailed that you are disincentivized to do\nit, because repetition is primary.\n\n1\\. Intention: The first step in the sequence is to voice an intention. When\nyou say it, be sincere and use your emotion. Your emotions are the ingredients\nin this cake you are baking. A basic intention you can modify is “I am now\nwilling to feel and release anger from my childhood trauma, so that it is no\nlonger being reenacted unconsciously in my life.”\n\n2\\. Embodiment: The second step is a physical expression of anger. This could\nbe dancing or shaking. You can listen to loud music if that helps. You want to\nfeel the anger in your body. Feeling it transports it out of your energy, and\nraises your vibration so that you are no longer magnetizing victimization and\ndisempowerment. You can make faces, do lion’s breathe, or scream into a\npillow. I went through a period of time in which the only satisfying anger\nwork was destructive. I was concerned 29\n\nabout safety because I kept throwing furniture around.\n\nAfter much trial and error, I developed a satisfying method. I took Amazon\ncardboard boxes and packed them inside each other, like nesting dolls. I\nwrapped this up with tape, then hit it with a baseball bat. For your ritual,\nthe physical part doesn’t have to go on for too long- maybe just a few\nminutes. Don’t be a perfectionist about it. This can feel taboo. If at first\nyou can only shuffle around in a circle a bit, that still counts. The channel\nwill open with practice.\n\n3\\. Anger letters: The third step is to write anger letters to the “original\noffenders.” For most people, this is their parents. No one will ever see these\nletters, so you can go crazy with it. You want to go fully into blame. This is\nnot the time for forgiveness or empathy. This is your inner child’s day in\ncourt. This is when you get to be squarely on your side. Be detailed and let\nthem know how wrong it was. Use phrases like, “How dare you,” and “I’m furious\nabout it,” and “It was immoral.” Notice we are not aiming this at the current-\nday antagonist- the ex who abandoned you, or the authority figure who is\npushing you around. Those figures are simply the Civil war reenactors. They\nlook convincing, but there are no 30\n\nbullets in their guns. Your anger letters put you into integrity about the\nactual harm that created your relational template long ago. You are correctly\nidentifying the perpetrator from the witness box, so to speak. When you finish\nthe anger letters you can burn them or tear them up. That releases them into\nthe ether.\n\nThis piece of the ritual helps externalize the anger and get it out of your\nbody, and deposits it on the page.\n\nA note on forgiveness- forgiveness does have relevance but it is best to think\nof it as a neutralization of energy, rather than as something that you are\ngiving, or that you owe people. Doing anger work produces forgiveness\nautomatically, because it heals the harm, and that makes it easier to let go\nof grudges. When you practice your anger work regularly, your family members\nare none the wiser. This is not hexing. It’s taking responsibility for how the\ntrauma lodged in your system. There is deep integrity in that.\n\nA note on guilt- guilt is often something new coming into consciousness. When\nyou think about this, it makes sense. When you are growing outside of your\ncomfort zone, you must be disloyal to your conditioning, so you may experience\na sensation of culpability. It comes with 31\n\nthe territory. Guilt doesn’t necessarily mean you have done something wrong.\nIt may just mean that you are expanding. When you come from a toxic family,\nyou could say that you can’t grow without some amount of guilt.\n\n4\\. Firing the reenactor: The last piece of the ritual is where we address the\ncurrent-day antagonist. This is where we finally manifest and influence the\npresent. It will work now, because you have cleared the energy from the past\nand now you have a blank canvas. This part is a letter as well- that you will\nalso burn or tear up.\n\nWrite a letter to the antagonist (the ex, authority figure, etc.), and fire\nthem from reenacting your childhood trauma. You can write this in formal HR\nlanguage: “Dear X, effective immediately, you are hereby terminated from\nreenacting the childhood\n\nabuse/neglect/abandonment (feel free to be specific about what they are\nportraying). You did a great job. A-plus performance! You put the trauma in my\nface, and I needed that so I could alchemize it. However, I’m going to do that\nwork directly with the original offenders now, so there’s no need for you to\ndo that any more. You’re fired.” Keep your energy neutral, or even playful.\n\n32\n\nYou will be surprised about how well this works. The current-day antagonist\nwill perceive, at some level, that the projection of your unhealed trauma\nwounds is no longer on their shoulders (energetically). They may soften\ntowards you or act differently. But even if they do not, you won’t be as\nbothered anymore because the trigger has been removed. This gives you power so\nthat trauma bonds and reenactments are not directing your life.\n\nIf you can read, absorb, and put into regular practice this sequence, you are\nmiles ahead of where most people get in their lifetimes. If I had to point to\none thing that keeps people stuck in harmful patterns more than anything else,\nit is reluctance to take responsibility for anger by embodying it, as\ndescribed here. It is understandable because anger is deeply taboo for many of\nus. But what starts as an annoying piece of spiritual homework becomes the\ndelicious secret to creating in your life. Practicing anger work can also help\nto reconcile you to having experienced trauma, because it finally gains a\nutility for you. Give it a try so that you can see the results!\n\n33\n\n![Image 4](index-34_1.jpg)\n\n\n## **Heartbreak**\n\nThe loss of a romantic relationship, or lack of fulfillment within an existing\nromantic relationship, can be excruciating, and it can be a common aspect or\ncatalyst of the dark night of the soul. Abandonment wounds, deeply buried, can\nsurface at this time with brutal force.\n\nIt’s normal to feel despair and disillusionment when this happens. You may\nalso experience frantic obsessive thoughts, as the psyche scrambles for some\nkind of internal paradigm of safety or reconciliation of cognitive 34\n\ndissonance. What has happened is that your soul has orchestrated, through\nheartbreak, a dismantling of attachment-oriented love, and it feels like a\ndeath.\n\nAttachment-oriented love is a relationship structure that rests on a rigid\ntemplate, installed by your family, based on rules, conditions, and\npsychologically-contractual obligations to uphold narratives. I will give some\nexamples of this.\n\nYou may have learned that love must be earned. This is common in dysfunctional\nfamilies. If someone rejects you romantically, it feels as if you have failed\na test of worthiness. But the person has not rejected you**\\- the** **timeline\nin which you believe that you must prove your** **worth has rejected you** ,\nbecause you are no longer a vibrational match for it. Typically, this happens\nbecause you have moved further into heart coherence and authentic\nvulnerability, which puts strain on a connection built on unconscious\nprograms. Your loved one ejects you from the silent agreement that the two of\nyou had at one time, whereby your efforts to be good enough bolstered their\nfragility, while also validating the sense of accomplishment you got from\nwinning approval that was withheld. This process of expulsion has 35\n\noriginated from within your spiritual blueprint. If your partner is working\nwith more fear than you, they will be the one to initiate withdrawal from the\nconnection, but it is your expansion that has set it in motion energetically.\nThe ensuing heartbreak is the death throes of the belief system that may have\nprovided a false sense of security in relationships going back to the very\nbeginning of your life. That’s why there is so much torment and fear with\nheartbreak. It brings you into contact with the threat of annihilation. As an\ninfant, if you were not able to secure the love of a parent, it was so\ndangerous for you, in your dependent state.\n\nHowever, the idea that you could create safety for yourself by being good\nenough was a false delusion. It was never true. It was a comforting fantasy\nthat cushioned you against the actual reality of your vulnerability. You\nneeded it at the time, because small children cannot bear to face the actual\ntruth of the unconsciousness of their parents. When someone breaks your heart,\nthe accumulated grief and betrayal from a lifetime of saturation in\nunconsciousness bursts forth like a dam breaking. They have actually done you\na big favor, because this is a detox from contamination 36\n\nthat will leave you clearer. Then you have a shot at real love, the kind that\nis reciprocal and not based on battles for control. Because much as it is easy\nto blame the one whose courage collapses first, you have also been in a\nstruggle for power through relationships- commonly to settle the score for a\npast harm wherein you were victimized. Your belief is that if you can get this\nperson to love you, it rewrites the ending of wounding located in the past.\nBut you must have compassion for yourself. You are only seeking healing. It’s\njust that you have gone to the dry cleaners instead of the pharmacy to pick up\nthe medicine. It’s understandable, because the _real_ medicine will feel like\npoison at first, and you may want to avoid it.\n\nYou must feel the buried feelings from early life. Many people seek\nrelationships to avoid exactly that.\n\nI want to note a few things about the twin flame content prevalent in the\nspiritual community. Much of that content does have useful information about\nhealing, depending on the teacher- such as an emphasis on shadow work. But it\ncan also feed obsessiveness, such as through the untrue claim that you share a\nsoul with another person. You are a full soul. You are complete as you are and\nyou are not in mandatory spiritual bondage 37\n\nwith anyone. In my opinion, it’s fine to consume twin flame content if it\nfeels comforting for a period when you are coping with the shock of the dark\nnight of the soul and are in extreme pain. This process is about coming into\nthe truth as revealed organically within you, so allow yourself the space to\nsort out what is real to you, using your own experience. In the classic\nCinderella story- not the Disney version, but the ancient fairytale told in\nmany different iterations, across hundreds of years, several versions depict\nCinderella at one point delicately sifting lentils from ash. This is a good\nmetaphor for the process of discernment. Your experience matters, and you get\nto carefully assign meaning. Just be aware that orthodoxy is as alive within\nthe New Age spiritual community as it is in fundamentalist religion. In the\nscramble for answers, you could adopt a replacement belief system that is just\nas much of a program. But if that is the case, it’s ok. It’s part of the\nprocess. I went down the twin flame rabbit hole for a time and I’m not\nembarrassed about that.\n\nWhat is most exciting to consider is the _ultimate_ prize on offer when you\nexperience heartbreak, which is a crack at inner union. This is the Beloved of\nwhom Rumi spoke-38\n\nyour internal lover. Now it can be challenging to be motivated by this when it\nfeels like a vague apparition-whereas your ex feels like a tangible, physical,\nportal into love that is now being cruelly withheld from you. It’s okay if\ninner union sounds like a second-rate door prize that does nothing to stem the\nbleeding. It is not a path chosen by the majority, because it requires\ndevotion and faith of the highest order. But it’s worth it. And it is a\nprerequisite for reciprocal love with another. It is through grieving the loss\nof your person that you will discover this hidden pearl within the oyster. It\nwill come in glimpses at first, perhaps as a softening into sweetness and\nself-compassion after you have cried wretched tears for hours. In other words,\nfeeling your feelings is key. However, there is a little more to it, and I\nwould like to speak of the ‘work’ of coming into inner union, because\nproactive empowerment provides much relief from heartbreak.\n\nCarl Jung spoke of the anima and animus. For a woman, or primarily feminine-\nidentifying person, she will have an animus, which is an internal masculine\ncounterpart. For a man, or primarily masculine-identifying person, he will\nhave an anima, which is an internal feminine 39\n\ncounterpart. The process of individuation is to develop that contra-sexual\npart. Carl Jung framed this in contemporary psychological language, but this\ngoes back for millennia, especially in the East. You can think of the yin/yang\nsymbol, or statues of the Buddha looking very feminine, for instance. It’s\nalmost as if the process of spiritual growth brings you into a type of\nenergetic androgyny, with both energies being fully expressed in your\nconsciousness. But because we live in a binary reality with conscripted gender\nidentification norms, our\n\n‘opposite’ tends to be relegated to the shadow. This is how you get, for\ninstance, women who are disempowered around financial independence, or men who\nare not in touch with their feelings.\n\nA broken relationship is an invitation to become more balanced in your divine\nfeminine and masculine energy. I want to describe methods to do this. The\nfirst method is through working with your dreams. Your counterpart will show\nup in your dreams, as either masculine characters (animus), or feminine\ncharacters (anima). Watch what these characters do for clues about your\nrelationship with that energy. The animus or anima is the “Other” in the\npsyche. They hold the key to your manifestation, 40\n\nbecause masculine and feminine energies are the building blocks of creation.\nBecause dreams are so concerned with illuminating your shadow, they will\ndeliver key insights. For instance, if you are a man, (or if you are strongest\nor most dominant in your masculine energy), and you had a mother who was\nengulfing or controlling, you might have dreams about feminine figures who are\npunishing or harsh, letting you know that anger work is needed about your\nmother. As you do your anger work, feminine figures in dreams may become\nsofter, and more aligned with you. They may begin to show you attributes you\nhave that are gifts, but have been “held” by the feminine in the shadow, such\nas intuition. This is how your shadow work and dream work start to work hand-\nin-hand.\n\nDream recall is essential for spiritual development.\n\nDreams don’t come from the ego, they are soul transmissions that offer you the\ncodes to your personalized instruction manual for life. If you have trouble\nremembering dreams, there is a clever technique. Before you go to bed each\nnight, write down in a notebook that you keep by your bed, “Please send me a\npsychic dream that I remember in the morning.”\n\n41\n\nWrite it down several times. When you wake up in the morning, write down\nwhatever you remember, even if it is a fragment or a feeling. If you don’t\nremember anything, write down, “No dream recalled.” This sends the message to\nyour inner dream maker that you would like to be in communication. It may take\na few nights, but you will get some dreams. You can also request that your\nanima or animus come to you in a dream in your writing exercise before sleep.\n\nThe second method to cultivate inner union is to write letters to your\nanimus/anima, and respond ‘from’ them as well. This is a way to feel that your\ncounterpart is real, similar to inner child work. In essence, you are a\nwalking Trinity, with your feminine, masculine, and inner child, navigating\nlife. When you write to your inner Beloved, express gratitude for what they\nare to you, and acknowledge all the ways they have been expressed in your\nlife, going back to childhood. When you write back to yourself from them, say\nall the things you wish to hear from a lover: “All that matters to me is your\nbliss. I’m committed to doing whatever it takes for you to experience love and\nabundance …” This is a way to withdraw the projection of your anima/animus on\nyour 42\n\nex. That is what you yearn for. You long for the integration of that energy\nthat you asked the romantic partner to carry for you. You needed the\nprojection for a time, because you needed your internal Beloved to be\nprojected outwards, to be visible to you. For instance, maybe you were with\nsomeone who is artistic, but this is an aspect of yourself in which you feel\ninsecure. Your partner’s embodiment of this quality is showing you a hidden\naspect of your own anima/animus. By writing letters to your anima/animus, you\ninvite that aspect to integrate back into yourself. The letter writing doesn’t\nalways feel like immediate relief, but it is a way to draw the internal lover\nout of the shadow and into conscious awareness. And it can be deeply healing\nand soothing for loneliness.\n\n43\n\n![Image 5](index-44_1.jpg)\n\nThe third method regarding inner union, is to develop in the areas associated\nwith that corresponding energy.\n\nThis is sometimes challenging and takes commitment over a lifetime, because it\ninvolves undoing a lot of programming, but I promise it will get you out of\nthe dark night heartbreak. For many feminines, this means pursuing\nprofessional and creative pursuits, as well as money manifestation. There can\nbe resistance to this for feminines who are highly-attuned to relationships\nover 44\n\nthese areas. We have often been sold a deception that offers partnership as a\nsalve to trauma. So, it often naturally follows that suffering is conceived as\nameliorated only via partnership. But that’s not true.\n\nAnd divine feminines on a spiritual path are sometimes kept out of partnership\nby the universe so that they can come into inner union first. She must come\ninto authentic relationship with her purpose. For masculines, the work of\nembodying the anima often centers on emotions, intuition, and even psychic\nabilities. The divine masculine must connect with his inner oracle. If he does\nnot, he suffers a painful sense of emptiness and lack of fulfillment, and may\nblindly seek his anima in empty sexual encounters, addictions, or over-\nworking. Each needs to funnel their energy into the ‘inferior function,’\n\nmeaning the aspect in which they feel less competency.\n\nThis entails confronting fear, taking risks, and surrendering the ego.\n\nI would say that this method- the development of the qualities of the “Other”\nrequires the most self-discipline, because it goes against the grain of\nhabits. Self-discipline is built moment-by-moment. For the divine feminine,\nthat could mean consistently pivoting away from 45\n\nromantic preoccupation and pouring energy into creative pursuits, money\nmanagement, and manifestation. For the divine masculine, self-discipline may\nmean courageously meeting himself in his heart center and accepting and\ntransmuting the raw emotion there, over and over again.\n\nThis process, of intimacy with the internal “Beloved” is a profound and sacred\nexperience of divine love, from the inside out. The Beloved is the home for\nwhich you were always nostalgic, though it is a place you cannot quite\nremember having lived. Application of these tools helps you row across the\nabyss and prepares your heart to hold the frequency of love. As love shows up\nin human form, you will receive it so easily you will wonder why you ever\nthought love had to be earned.\n\n\n## **The Future**\n\nWhat happens over time with this kind of work is an inner solidarity and calm\nconfidence about navigating _all_ aspects of life, not just the parts that are\ncomfortable.\n\nThere is an overflowing of creative ideas and intuition, and an ability to\nseed these thoughts into the future 46\n\nwith precision. Unclaimed energy and gifts from the unconscious are no longer\nsiphoning precious resources.\n\nInstead, inner alignment clicks into place, creating a powerful inner magnet\nfor receiving. Manifestation becomes less about effort, and more about\nattunement.\n\nThe previous romantic attachment carries less charge, and the dynamic may even\nbecome a bit boring to you.\n\nThe part of you that invested it with meaning, purpose, and a feeling of\nworthiness, has grown into spiritual sovereignty. The inner child is still\nthere, but is no longer driving you towards toxic connections and trauma\nreenactments.\n\nWith inner union, you get to experience a rebirth, as your balanced feminine\nand masculine nourish your inner world. You will enjoy the pleasures of this\nworld anew, uninhibited by unprocessed trauma. This clarity begins in your\nbody. Your energy becomes so loving and attractive, that the good can’t help\nbut move towards you. And because your tears have created a fertile soil\nwithin the depths of your beautiful heart, the good will flourish in you and\nthe lives you touch. This will be an experience of resplendent grace the\ncaliber of which vastly exceeds any addictive bump you ever garnered 47\n\nfrom substances, relationships, or daydreaming. You can’t imagine it when you\nare in the dark night of the soul, which is what makes your forward motion an\nact of defiant faith. Your trust in taking steps forward without perceiving\nthe path before you, is how you raise your hand for joy. Approach this with\nthe wonder and curiosity of a child.\n\nYou have the profound privilege of deciding that pain, fear, and confusion are\nacceptable mysteries here at Earth school. That is power. From that place of\nequanimity, you will create from your authentic soul. It will probably not\nlook like what the ego would have wanted before the dark night of the soul.\nBut you will understand so deeply that unconsciousness, delusion, fantasy, and\naddictions to the programming are suffering, and those past desires elicit\nonly your soft compassion now. You will be excited about where Spirit wants to\ntake you next, without dread of what you will need to sacrifice in the\nprocess, because with each cycle of shedding you glow brighter and brighter.\n\n48\n\n![Image 6](index-49_1.jpg)\n\nYou will feel protected without the need for guarantees.\n\nYou will feel peace without needing to be witnessed.\n\nYou will feel sober without restlessness.\n\nYou will feel compassion without dismay.\n\nYou will feel passion without yearning.\n\nYou will feel curious without possessiveness.\n\nYou will feel sensitivity without outrage.\n\nYou will feel pure, unadulterated devotion.\n\n49\n\n**Survival tips during the Dark Night of the Soul** 1\\. Long walks: Don’t\nunderestimate how much a shift can come just from being outside. This can be\none of the fastest ways to get out of mental loops.\n\n2\\. Directing love to your heart: Place your hand on your heart and say to\nyourself (or to your inner child), “I’m so sorry that you are going through\nthis. It’s not your fault. I believe you. I am with you.”\n\n3\\. Prayer: Talk to god, Spirit, the Universe, your higher self, or your\nfuture self, and ask for help. Be sincere, and listen carefully for the\nanswer. Some prayers that could be helpful:\n\na. “Grant me the willingness and humility to change in alignment with my\nsoul’s blueprint.”\n\nb. “Help me to see the truth, even when it is difficult to accept. Protect me\nfrom harmful false beliefs about myself.”\n\nc. “Grant me discernment about the best next steps. Help me understand how I\ncan be empowered in this moment.\n\nWhat do I need to release?”\n\n4\\. Watch YouTube videos about the dark night of the soul.\n\nListen to videos of Rumi’s poetry, like this one:\n\n[https://youtu.be/rTSPb6AbPU0?si=iY51D6wz9twSmvtZ\n](https://youtu.be/rTSPb6AbPU0?si=iY51D6wz9twSmvtZ)\n\n50\n\n5\\. Practice your anger work (see pages 28-33) 6. Practice exposure therapy on\nanything you’re avoiding, prioritizing it at the beginning of the day until\nresistance is lowered. (yoga/exercise, managing finances, honest\nconversations, emotional alchemy/anger work, etc.) 7. Guided meditations that\nare loving and positive. If you can’t meditate very well on your own during\nthis time, that’s ok. Avoid getting into spirals during meditation.\n\nRecorded meditations can help with this.\n\n8\\. Be patient with yourself, especially if you are using this time to\nwithdraw from any kind of dependency (substances, addictive relationships,\netc.). Trust the rhythm of your body. You’re going to need rest.\n\n9\\. Hold on to hope! ❦\n\nMuch love,\n\nRachel\n\n51\n\n",
    "book_id": "manifesting_love_and_abundance_from_the_dark_night",
    "book_title": "tCgVvMpr4D6Q84fa6VHci6i6hZb5sg2KPFkejEoA",
    "book_author": "Rachel McNassor",
    "topic_id": "magick_manifestation",
    "topic_label": "manifestation",
    "chunk_index": 0
  }
]