[
  {
    "chunk_full": "",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 0
  },
  {
    "chunk_full": "Italian Style Long Roll  \nFeatured in Season 1 Episode 1: Dear @Sorted Food, This is a REAL Philly Cheesesteak \n \nIngredients \n❑\n1 packet of yeast\n❑\n2 tablespoons of sugar\n❑\n1 cup of warm water\n❑\n½ cup of warm milk\n❑\n5 grams of amylase enzyme\n❑\n4-5 cups of flour\n❑\n2 tablespoons of salt\nInstructions: \n1.\nIn a bowl, combine the yeast, sugar, water, milk, and the amylase enzyme. Let \nthis bloom for about 20 - 30 minutes. \n2.\nIn a mixer, add in the flour and salt and let that combine. Add in the bloomed \nyeast mixture and mix on low for 2 minutes \n3.\nLet the dough rest for 15 minutes. \n4.\nTurn your mixer back on low and knead for another 15 minutes. \n5.\nTake the dough out of the mixer and gives it the final knead and shape it into a bowl. \n6.\nPlace your dough into an oiled bowl, rise and ferment overnight in the fridge. \n7.\nThe next morning, take your dough out of the fridge and divide into 4 pieces and \nshape your long rolls. \n8.\nLet your long rolls proof for 1 -2 hours. \n9.\nPreheat your oven to 400 degrees Fahrenheit and place an oven safe pan into the \noven. \n10. Add in some ice cubes to help to create steam and a nice color on the bread. Bake \nyour long rolls for 20 minutes or until golden brown. \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 1
  },
  {
    "chunk_full": "White Bread \nFeatured in Season 1 Episode 2: I Tried Recreating The Popular Indian Street Sandwich at \nHome \nIngredients: \n❑\n3 ½ cups Flour\n❑\n⅛ cup of Maple Syrup\n❑\n1 tablespoon of Dried Active Yeast\n❑\n⅛ cup of Grapeseed Oil\n❑\n1 ½ cup of Warm Water\n❑\nPinch of Salt\nInstructions: \n1. Get a big mixing bowl and add in 1 ½ cup of flour, maple syrup, dried \nyeast, oil, and warm water into the bowl and mix that together. \n2. After mixing, let the mixture activate for 10-15 minutes. \n3. Add in the rest of the flour (2 cups) and a little salt to the mixture. \n4. Let it rest for 10 minute for the gluten to relax. \n5. Floured your kneading surface and knead it for 5 minutes. You should \nhave a nice supple dough once you are  done. \n6. Grab a big bowl with a little oil and let the dough sit at room \ntemperature for 1 -1.5 hours until it doubles in size. \n7. Give your rested dough a little pat down after it doubles in size. \n8. Take a loaf pan and make it non-stick with some oil. \n9. Take your dough out and just rolled it up, put it in the loaf pan to let that \nproof for 1 hour. \n10.You want your proofed dough overflowing over the sides of the loaf pan. \n11.Melt a little butter and brush it on top of your proofed dough so you \nget a nice deep rich flavorful crust. \n12.Preheat your oven at 350°F and bake it for 30-35 mins. \n13.Take out your bread and let it cool off and enjoy! \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 2
  },
  {
    "chunk_full": "Milk Bread \nFeatured in Season 1 Episode 3: The Most Expensive Sandwich I Have Ever Made \n \nIngredients: \n❑\n⅓ cup of Bread flour \n❑\n1/2 cup of milk \n❑\n2 ½ cups of Bread flour\n❑\n½ cup Milk\n❑\n1 packet or 2 teaspoons of \nDried yeast\n❑\n¼ cup of Sugar\n❑\n1 Egg\n❑\n1 teaspoon of Salt\n❑\n4 tablespoons Unsalted Butter\nInstructions: \n1.\nFor the tangzhong, add 1/3 cup of bread flour & 1/2 cup of milk into the pot and stir \nthat around on low heat for 5 minutes until it thickens up, almost like a roux. Let it \ncome down in temp. \n2.\nActivate your yeast; Take a medium-size bowl and add in a little bit of warm milk \n(90-100°F), yeast and sugar, then let that activate for 10 minutes until it’s nice and \nbubbly. \n3.\nTake a big mixing bowl, add activated yeast, beaten eggs, flour, tangzhong, a little \nsalt and mix that up until it starts to come together. \n4.\nTake your dough out from the mixing bowl, and put it on the floured surface and \nstart kneading until it starts to form together. \n5.\nLet the dough sit, let those glutens relax a little bit. \n6.\nAfter the dough is relaxed, add in some butter. It’s going to be hard to knead \nwith the butter in at first, but eventually, this will come together. Knead for about \n5 minutes. \n7.\nAfter kneading it, let it rise for about an hour to an hour and a half until it doubles its \nsize. \n8.\nStart working on your dough; put your dough on floured board and chop that into \nmultiple pieces. You need about 3 decent-sized pieces for one loaf. \n9.\nTake a loaf pan and spray that down so it doesn’t stick. Put 3 pieces into the pan, \nand make sure they have enough space to rise. \n10. Let that sit for an hour until it just rises above the edge of the loaf pan while your \noven preheats at 350°F. \n11. Beat up an egg with a bit of milk to brush on the dough, so it gets a nice golden crust. \n12. BAKE! For 20-30 minutes until bread thermometer reads around 200 to 210°F \n \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 3
  },
  {
    "chunk_full": "Sourdough French Baguette  \nFeatured in Season 1 Episode 4: I Flew a French Guy to Help Perfect This Sandwich... \nIngredients: \n❑\n500 grams of white flour\n❑\n500 grams whole wheat flour\n❑\n650 grams of water\n❑\n150 grams of Sourdough Starter \n❑\n10 grams of salt\n❑\nIce Cubes for baking \nSteps: \n1. In a bowl, mix together with white flour, whole wheat flour, and enough \nwater to get about 65% hydration. Let that sit (autolyse process) for at least \n45 minutes. \n2. After the autolyse process, pour in the sourdough starter and add in some salt. \nMix that all together until it’s nice and incorporated. \n3. Start stretch and fold for every 45 minutes for 2 hours to develop the gluten \nstructure. \n4. You can perform a stretch test, you can see how at here. \n5. After stretch and fold, let the dough rise in the fridge overnight until it \ngains about 40-50% mass. \n6. Flour the kneading surface. Put the dough on the surface & start dividing into 4 \npieces. \n7. Start pre-shaping the divided dough and let it sit for about 30 minutes before \nthe final shaping. \n8. Give the baguettes a final shaping. You can see how that is done here.  \n9. Proofing hack for baguettes at 10:36 \n10.Let it proof for about 2 hours until they pass the poke test. \n11.Preheat the oven at 500°F, and bake the baguettes. Baking hack, adding some \nice cube on a tray and put it in the bottom because the ice will slowly melt \nand release steam which will help with the oven spring and the color on the \nbaguettes. \n12.After 20 minutes, turn the oven down to 450°F and cook for another 20-25 \nminutes until they are golden brown. Enjoy! \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 4
  },
  {
    "chunk_full": "Pita Bread \nFeatured in Season 1 Episode 5: The Art of Crafting the Perfect Sandwich \n \nIngredients: \n❑\n2 teaspoons of dry active yeast\n❑\n1 cup of warm water\n❑\nDrizzle of maple syrup\n❑\n3 cups of flour\n❑\nDrizzle of olive oil\n❑\nSprinkle of salt\nInstructions: \n1.\nIn a large bowl, combine the active dry yeast, warm water, and a drizzle of maple \nsyrup. Let this proof for about 15 - 20 minutes or until nice and puffy. \n2.\nThen add in your flour, olive oil, and salt. Combine until it start to come to a dough. \n3.\nTake it out of the dough and start kneading it until it comes into a soft and supple \ndough. \n4.\nGive it a rest to relax the gluten a bit. (about 30 minutes) \n5.\nThen once it has rested, knead it for 5 more minutes. \n6.\nLet this proof for about 1 hour. \n7.\nOnce fully proofed, deflate it and cut into small balls. You should get around 12 balls. \n8.\nRoll out each ball to a round flat disk. \n9.\nMeanwhile, oil up a cast iron and place in the oven at the highest temperature that \nyour oven goes to. \n10. Place one of your pita dough onto your pan and bake for 3 minutes. \n11. They will puff up (not all pitas puff up perfectly) and you are ready to fill you pita with \ntons of delicious toppings! \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 5
  },
  {
    "chunk_full": "Sourdough Rye Bread \nFeatured in Season 1 Episode 7: Montreal Smoked Meat vs. New York Pastrami Sandwich \n \nIngredients: \n❑\n100 grams of rye flour\n❑\n900 grams of bread flour\n❑\n750 grams of water\n❑\n150 grams of sourdough starter\n❑\nPinch of salt\n❑\n1 tablespoon of caraway seeds\nInstruction: \n1. In a large bowl combine the rye flour, bread flour, and water. Mix until the \nwater has been absorbed by the flour. \n2. Then add in the 150 grams of sourdough starter and pull, shake, and fold. \n3. Give it a rest for 30 minutes and then add in your salt and caraway \nseeds. Give it another pull and fold and rest for 30 minutes. \n4. Continue giving your dough 2 more pull and folds giving the dough 30 \nminute intervals after each fold. \n5. After the last pull and fold let the dough sit for 30 minutes to relax the gluten. \n6. Shape the dough into two dough and let them proof in a banneton until it has \ndoubled in size. This could take anywhere to 4 hours or overnight. \n7. Once the rye dough has doubled in size, preheat your oven to 475 degrees \nfahrenheit along with a cast iron pot and lid. \n8. While everything is preheating go ahead and score your bread. \n9. Bake for 30 minutes or until golden brown! \n \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 6
  },
  {
    "chunk_full": "Cemita Roll \nFeatured in Season 1 Episode 8: How Is This Mexican Street Sandwich Not More Popular? \n \nIngredients: \n❑\n1 packet of Active Dry Yeast\n❑\n2 tablespoons of Sugar\n❑\n1 cup of Warm Water\n❑\n2 Egg + some egg wash\n❑\n2 tablespoons of Butter\n❑\nPinch of Salt\n❑\nFlour\n❑\nSesame Seeds\nIngredients: \n1. Activate the yeast -- add dry \nyeast, sugar, and warm water into a mixing bowl. Mix them together and let it \nactivates for 10 minutes. \n2. Pour the yeast mixture into a food processor, add in 2 eggs, 2 tablespoons of \nbutter, salt (about 2 tablespoons), 3 cups of flour, and blend that for about 5 \nminutes. You will get a nice supple and smooth dough. \n3. Flour the kneading surface, knead the dough for a little bit until it’s extra smooth \nand just \nlet that rise in an oiled bowl for 1 hour, doubles it size at room temperature. \n4. After it doubles it size, pat that down and let it rise again for another hour. \n5. Once that’s done, take out your dough and put it on the floured surface. Roll \nthat out and cut it into a few pieces, and roll those up into balls. Let rest for \nabout 10 minutes. \n6. Rolling out the dough -- position your hand in the chopping position and \nROLL them right in the middle to form 2 sides. Make sure one side is a little \nbit smaller than the other, and it looks like 2 balls (but it’s still attached). Pat \nthem down with your hands, and flip the smaller size on top of the bigger \nsize. Pat it down flat again. Watch the rolling technique in the video here. \n7. Put the dough on the baking sheet with parchment paper, brush them with \negg wash and sprinkle some sesame seeds on the top. Let them sit and rise \nfor 1 hour. \n8. Put them in the oven at 450°F for 15 minutes and you get this nice Cemita roll. \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 7
  },
  {
    "chunk_full": "Classic Everything Bagel  \nFeatured in Season 1 Episode 9: The Bagel Sandwich that New York Created \nIngredients: \n❑\n½ cup of warm water\n❑\n1 packet of yeast\n❑\n1 tablespoon of sugar\n❑\n8 cups of bread flour \n❑\n4 1/4 cups of water\n❑\n20 grams of salt\n❑\n3 tablespoons of malt syrup\n❑\n1 tablespoon of White Sesame seeds\n❑\n1 tablespoon of Black Sesame seeds\n❑\n1 tablespoon of Poppy seeds\n❑\n1 tablespoon of Flaky sea salt\n❑\n1 tablespoon of baking soda\n❑\n2 tablespoon of malt syrup\nInstruction: \n1. In a bowl combine warm water, yeast and sugar. Let this bloom for \nabout 15 - 20 minutes. \n2. Then in a mixer combine flour, salt, malt syrup, water, and activated yeast \nmixture. \n3. Let the mixer knead the dough for about 20 minutes. Let the dough sit for \n20 minute to relax. \n4. Once the dough has relaxed you are ready to make bagels. \n5. Start by cutting long snake like strands of the dough and then roll the dough \naround your hand and form them into a nice bagel circle! \n6. Place your bagel onto a tray sprinkled with corn flour and let them proof \novernight. \n7. Since, we are making everything bagels we need to work on the \neverything bagel topping. In a bowl, combine the white sesame seeds, \nblack sesame seeds, poppy seeds, and flaky sea salt. Set aside and \nget started on cooking your bagel! \n8. The next morning, get a pot of water and add in your baking soda and malt \nsyrup. Then bring it to a boil. \n9. Drop in your bagel and let them boil for about 1 minute per side. \n10.Take them out of the water and douse them with your everything mix. \n11. Preheat your oven to 500 degrees and bake your bagel for 10 minutes. Flip \nthem onto the other side and then bake them for another 5 - 10 minutes so \nthat it has a good bagel crust. \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 8
  },
  {
    "chunk_full": "Sesame Pancake  \nFeatured in Season 1 Episode 11: 2000 Year Old Chinese Sandwich \n \nIngredients: \n❑1 cup of water water\n❑2 ½ cup of flour\n❑1 tablespoon of instant yeast\n❑1 tablespoon of sugar\n❑1 tablespoon of neutral oil\n❑1 tablespoon of salt\nInstructions: \n1. In a mixer, add in the warm water, flour, instant yeast, sugar, neutral oil, \nand salt and mix for about 1 minute until everything is combined. \n2. Take the dough out and knead it by hand until it is nice and smooth. \n3. Place it into an oil proof bowl and let it proof for about 1 hour or until it \ndoubles in size. \n4. Once it has doubled in size, roll out the dough slightly smaller than the \npan that you are cooking it. \n5. Spread a little bit of oil onto the dough and sprinkle both sides of the \ndough with sesame seeds. \n6. Also add oil and sesame oil to the pan that you will be cooking the dough \nin and be sure \nto get up the sides of the pan. Place the dough into the pan and \nproof the dough for about 1 hour so that it can be extra fluffy. \n7. In the meantime, preheat your oven to 350 degrees fahrenheit. \n8. Once the dough has risen a bit, place it onto your stove top and turn \nthe flame to a medium heat. Make sure that you keep and eye out so \nthat you don't burn the dough/ sesame seeds. Keep turning the \ndough so that you have an even golden brown color. \n9. Flip the dough over and cook the other side in the same manner. \n10.Once both sides are golden brown place the bread in the oven for \nabout 5 minutes so that you can cook the dough all the way through! \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 9
  },
  {
    "chunk_full": "Choripan Roll \nFeatured in Season 1 Episode 12: These Three Simple Parts Make Up Argentina’s Most \nPopular Sandwich \nIngredients: \n❑\n1 packet of Active Dry Yeast\n❑\n1 ½ cups of Warm Water\n❑\n1 tablespoon of Honey\n❑\n3 cups of Flour plus some extra for \nflouring surface/dough\n❑\n8 grams of \nSalt Ingredients:\n1. Start off with activating the yeast in a mixing bowl. Then add in dry yeast, 1 ½ cups \nof warm water, 1 tablespoon of honey, and let that activate for 15 minutes until it’s \nnice and bubbly. \n2. Then add in 1 ½ cups of flour, and let it sit for an hour, the mixture will continue to \nactivate and rise. After letting it sit for an hour, add in another 1 ½ cup of flour and \nsalt (8g). Mix that together until it’s well incorporated. \n3. Let the dough sit for 15 minutes so the gluten can relax before kneading. \n4. Flour your kneading surface, and knead it for 5 minute to really develop the gluten \nstructure. \n5. Once it’s nice and supple, you can place it in a bowl with a little bit of oil. \n6. Let it rise and double in size for 1-1.5 hours. \n7. Take the dough out and put it on the floured surface and split it up into a few \npieces and form those into nice little balls. Let them rest for 10 minutes. \n8. You can start forming your bread roll with the dough ball, check out the forming \ntechniques \nin the video \nhere.  \n9. Let your formed dough proof for 30 minutes to an hour until they’ve gained a little bit \nof air. \n10. Take a razor blade or a sharp knife, and give your proof dough a little slash on the top. \n11. Spray them with a little water on the top and bake them at 450 °F for 15-20 \nminutes. If you want your bread roll to develop a nice crispy and dark crust just \ncontinue to spray the bread with water every 5 minutes \n12. Enjoy your fresh roll! \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 10
  },
  {
    "chunk_full": "Turkish Flatbread for Doner Kebab  \nFeatured in Season 2 Episode 1: I can’t believe Im just fining out about this bread??? \nIngredients: \n1 cup water \n¾ cup milk \n1 tablespoon of sugar \n2 Tablespoons of salt \n1 packet of rapid rise instant yeast \n3 tablespoons of butter \n⅓ cup of sourdough starter (mostly for flavor) \nStart with 1 cup of flour but you will need more \n1 egg + milk for an egg wash \nInstructions: \n1. In a pot melt the butter just so that it is liquid. You don't want it to boil or brown. \n2. Then in a large bowl combine the milk, water, sugar, instant yeast, butter, \nsourdough starter, and 1 cup of flour. Give it a good stir. \n3. Keep adding more flour until it becomes more of dough mass. It will still be \nsuper sticky and tacky but that’s it exactly how you want it. \n4. Let it rest for 20 minutes and then give it a stretch and fold. \n5. Let it rest for another 30 minutes and then give it one last stretch and fold. \n6. Now you can let it rise for about 1 hour. \n7. Once the dough has rested and is visibly puffy, take it out of the bowl and split \nthe dough into one large dough ball and then one small dough ball. \n8. Give them both a rough shape and place them onto a parchment lined baking \ntray. \n9. Similar to a focaccia, gently push down the dough with the tips of your finger \nto create a round dimpled dough. \n10.Egg wash the dough and sprinkle on black sesame seeds and white sesame \nseeds. \n11. Preheat your oven to 385 degrees while the dough proofs a bit. \n12.Bake the Turkish bread for 25 - 30 minutes or until golden brown or \nthe internal temperature reaches 210 - 214 degrees fahrenheit. \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 11
  },
  {
    "chunk_full": "Z-man Sandwich Recipe \nFeatured in Season 2 Episode 2: I recreated Paul Rudd’s Favorite KC Sandwich from \nScratch! \nIngredients: \n1 Tablespoon sugar \n1 packet of instant yeast \n2 cups of warm water \nAbout 3 cups of flour \n1/8 cup of olive oil or any oil you have on hand \nInstructions: \n1. In a large bowl combine the sugar, yeast, and water. Let bloom for 30 \nminutes or until it becomes noticeably puffy. \n2. Add in the oil and then slowly start to mix in 3 cups of flour. \n3. Once the dough comes together let dough rest for 20 minutes. \n4. Take the dough out of the bowl and give it a good knead. \n5. Shape it into a round ball and let it sit for 1 hour or until double in size. \n6. Knock the air out of the dough and cut it into 8 equal size pieces. \n7. With four of the pieces, roll them into tight balls, stamp them with the kaiser roll \nstamper. \n8. With the other four, roll them out into logs and braid them. Check out how I \nbraided them here! \n9. Let them proof until double in size and bake them at 390 degrees \nfahrenheit for 10 minutes with the lid on and then continue baking them \nwith the \n \nChallah Bread  \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 12
  },
  {
    "chunk_full": "Challah Bread  \nFeatured in Season 2 Episode 3: Reinventing the PB and J sandwich  \nIngredients:  \n1 package of yeast  \n¼ cup sugar  \n1 cup of water \n2 Eggs  \n4 cups of all purpose flour  \n2 teaspoons of salt  \n4 tablespoons of butter  \nInstructions: \n1.\nIn a small bowl, combine the yeast with 2 tablespoons of water and let this bloom \nfor about 10 - 15 minutes or until the yeast starts floating to the top. If your yeast \ndoesn’t activate then throw it away and use some fresh yeast.  \n2.\nOnce your yeast has been activated your can move onto the next step which is \nadding all the wet ingredients to a standing mixer. Combine the activated yeast, \nsugar, the rest of the water, and the eggs until every kind of comes together.  \n3.\nThen in another bowl, combine the flour and salt. Gradually mix the flour mixture into \nwet ingredients. Once the dough comes together let dough rest for 20 minutes. \n4.\nOnce your wet ingredients has absorbed your flour, slowly throw in your butter pieces by \npiece until all the butter is incorporated into the dough.  \n5.\nKnead the dough in the mixer for about 10 minutes more or until you get a smooth, \nelastic, and supple dough.  \n6.\nTake the dough out and knead for another 2 - 3 minutes just to shape it a bit more and \nto form it into a ball. Then set it in a grease proofed bowl. Let it rise for about 1 ½ hours \nor until it doubles in size. The timing on this varies from room to room. Say your kitchen \nis very cold, it will take longer so it would be best to leave it in the oven with the light \non. With four of the pieces, roll them into tight balls, stamp them with the kaiser roll \nstamper. \n7.\nOnce the dough has proofed, knock out the air and pat it into a rectangle. From the \nside furthest away from you pinch it and roll in towards you to create a log shape. \nRoll outwards from the center.  \n8.\nCut out 6 pieces lengthwise (about 177 grams each) and braid into a 6 braided \nchallah. You can check out my video to see how I did that here.  \n9.\nPlace the braided challah onto a parchment lined baking tray and let the dough rise \nfor another 1 - 1 ½ hours or until the dough has doubled in size.  \n10. Preheat your oven to 375 degrees fahrenheit and egg wash your challah bread.  \n11. Lastly sprinkle on some poppy seeds and bake for 35 minutes! \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 13
  },
  {
    "chunk_full": "Overnight Fermented Pizza Dough  \nFeatured the Air Fryer Series: I took my Air Fryer into a new DIMENSION… \nIngredients:  \n2 teaspoons instant rapid rise yeast  \n1 tablespoon of sugar  \n2 teaspoons of salt  \n1 ½ cup of warm water (105 degrees fahrenheit)  \n⅛ cup of olive oil  \n4 cups of flour  \nInstructions: \n1. Add all the ingredients to a large bowl and mix together until you get a \ncohesive dough ball.  \n2. Hand knead 5 - 10 or until smooth and elastic.  \n3. Drizzle in some olive oil in a bowl and let the pizza dough ferment overnight.  \n4. Your dough should be doubled in size (if not, let it rise a little longer at room \ntemp)  \n5. Your dough is now ready to make some tasty pizza!  \n \n \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 14
  },
  {
    "chunk_full": "Rye Wheat Sour Bread: \nFeatured in Sandwich Series S2 EP4: I can’t pronounce this Nordic. \nsandwich... but can I make it? \nIngredients: \n•\n¼ cup of wheat berries  \n•\n2 tablespoons of sunflower seeds  \n•\n2 tablespoons of flax seeds  \n•\n2 tablespoons of pumpkin seeds  \n•\n500 grams of water \n•\n350 grams rye flour  \n•\n350 grams whole wheat  \n•\n130 grams of starter  \n•\n1 tablespoon of molasses \n•\n15 grams of fine salt \nInstructions: \n1.\nThe night before place ¼ cup of wheat berries, 2 tbsp of sunflower seeds, 2 tbsp \nof flax seeds, and 2 tbsp of pumpkin seeds in a mason jar and add enough water \nto cover. Let them hydrate overnight. \n2.\nIn a large bowl add 350 grams rye flour, 350 grams whole wheat, and 500 grams \nof water and mix with a danish whisk to combine. Let it autolyse for about 30 \nminutes. In the meantime drain your hydrated seeds and set aside. \n3.\nOnce your bread has rested add in 130 grams of starter, 1 tablespoon of \nmolasses, 15 grams of fine salt, and the hydrated seeds. Fold everything into your \ndough until it is incorporated and let it rest for 1 hour.  \n4.\nAfter the hour is up give it a stretch and fold. It will be a bit hard to do since there \nisn’t much gluten in the dough. Do the best you can and then give it a rest for 30 \nminutes. Repeat this step three more times for a total of four stretch and folds. \n5.\nAfter all the stretch and folds are done, place the dough into the fridge overnight \nfor its bulk ferment.  \n6.\nIn the morning, shape it into a tight log and place it into your greased pullman loaf \npan. Let it rise for about 3 hours on your counter. Once you notice that it has \nrisen, give it a couple of scores and close up your pullman loaf pan.   \n7.\nPreheat your oven to 450 degrees Fahrenheit and bake for 20 minutes. Once the \n20 minutes are up, take off the pullman loaf lid and bake for an additional 20 \nminutes. Let your rye wheat bread cool off until you are able to handle it.  \n",
    "book_id": "bread_handbook_pdf",
    "book_title": "Bread Handbook PDF",
    "book_author": "Unknown",
    "topic_id": "cooking",
    "topic_label": "cooking",
    "chunk_index": 15
  }
]