[
  {
    "chunk_full": "![](Images/cover.jpg)\n\n\n# Build Websites with Hugo\n\n### Fast Web Development with Markdown\n\n### by Brian P. Hogan\n\nVersion: P1.0 (May 2020)\n\n\nCopyright © 2020 The Pragmatic Programmers, LLC. This book is licensed to the\nindividual who purchased it. We don't copy-protect it because that would limit\nyour ability to use it for your own purposes. Please don't break this\ntrust—you can use this across all of your devices but please do not share this\ncopy with other members of your team, with friends, or via file sharing\nservices. Thanks.\n\nMany of the designations used by manufacturers and sellers to distinguish\ntheir products are claimed as trademarks. Where those designations appear in\nthis book, and The Pragmatic Programmers, LLC was aware of a trademark claim,\nthe designations have been printed in initial capital letters or in all\ncapitals. The Pragmatic Starter Kit, The Pragmatic Programmer, Pragmatic\nProgramming, Pragmatic Bookshelf and the linking _g_ device are trademarks of\nThe Pragmatic Programmers, LLC.\n\nEvery precaution was taken in the preparation of this book. However, the\npublisher assumes no responsibility for errors or omissions, or for damages\nthat may result from the use of information (including program listings)\ncontained herein.\n\n## About the Pragmatic Bookshelf\n\nThe Pragmatic Bookshelf is an agile publishing company. We’re here because we\nwant to improve the lives of developers. We do this by creating timely,\npractical titles, written by programmers for programmers.\n\nOur Pragmatic courses, workshops, and other products can help you and your\nteam create better software and have more fun. For more information, as well\nas the latest Pragmatic titles, please visit us at <http://pragprog.com>.\n\nOur ebooks do not contain any Digital Restrictions Management, and have always\nbeen DRM-free. We pioneered the beta book concept, where you can purchase and\nread a book while it’s still being written, and provide feedback to the author\nto help make a better book for everyone. Free resources for all purchasers\ninclude source code downloads (if applicable), errata and discussion forums,\nall available on the book's home page at pragprog.com. We’re here to make your\nlife easier.\n\n### New Book Announcements\n\nWant to keep up on our latest titles and announcements, and occasional special\noffers? Just create an account on [pragprog.com](https://pragprog.com) (an\nemail address and a password is all it takes) and select the checkbox to\nreceive newsletters. You can also follow us on twitter as @pragprog.\n\n### About Ebook Formats\n\nIf you buy directly from [pragprog.com](https://pragprog.com), you get ebooks\nin all available formats for one price. You can synch your ebooks amongst all\nyour devices (including iPhone/iPad, Android, laptops, etc.) via Dropbox. You\nget free updates for the life of the edition. And, of course, you can always\ncome back and re-download your books when needed. Ebooks bought from the\nAmazon Kindle store are subject to Amazon's polices. Limitations in Amazon's\nfile format may cause ebooks to display differently on different devices. For\nmore information, please see our FAQ at [pragprog.com/frequently-asked-\nquestions/ebooks](https://pragprog.com/frequently-asked-questions/ebooks). To\nlearn more about this book and access the free resources, go to\n<https://pragprog.com/book/bhhugo>, the book's homepage.\n\nThanks for your continued support,\n\nAndy Hunt  \nThe Pragmatic Programmers\n\nThe team that produced this book includes: Andy Hunt (Publisher)Janet Furlow\n(VP of Operations)Dave Rankin (Executive Editor)Tammy Coron (Development\nEditor)Jasmine Kwityn (Copy Editor)Potomac Indexing, LLC (Indexing)Gilson\nGraphics (Layout)\n\nFor customer support, please contact\n[support@pragprog.com](mailto:support@pragprog.com).\n\nFor international rights, please contact\n[rights@pragprog.com](mailto:rights@pragprog.com).\n\n\n# Table of Contents\n\n  1. [ Acknowledgments](f_0004.xhtml#ch.acknowledgements)\n  2. [ Preface](f_0005.xhtml#d24e111)\n     1. [What’s in This Book](f_0006.xhtml#d24e146)\n     2. [What You Need](f_0007.xhtml#d24e195)\n     3. [Conventions](f_0008.xhtml#d24e225)\n     4. [Online Resources](f_0009.xhtml#d24e304)\n  3. [1\\. Kicking the Tires](f_0010.xhtml#chp.kicking.tires)\n     1. [Installing Hugo](f_0011.xhtml#d24e326)\n     2. [Creating Your Site](f_0012.xhtml#d24e464)\n     3. [Building the Home Page](f_0013.xhtml#d24e648)\n     4. [Creating Content Using Archetypes](f_0014.xhtml#sec.create.with.archetype)\n     5. [Building and Exploring Hugo’s Output](f_0015.xhtml#d24e1363)\n     6. [Your Turn](f_0016.xhtml#d24e1592)\n     7. [Wrapping Up](f_0017.xhtml#d24e1653)\n  4. [2\\. Building a Basic Theme](f_0018.xhtml#chp.basictheme)\n     1. [Generating the Theme](f_0019.xhtml#d24e1705)\n     2. [Using Content Blocks and Partials](f_0020.xhtml#sec.content.blocks.partials)\n     3. [Styling the Theme with CSS](f_0021.xhtml#d24e2262)\n     4. [Your Turn](f_0022.xhtml#d24e2592)\n     5. [Wrapping Up](f_0023.xhtml#d24e2629)\n  5. [3\\. Adding Content Sections](f_0024.xhtml#chp.content.sections)\n     1. [Creating a Project Archetype](f_0025.xhtml#d24e2648)\n     2. [Creating the List Layout](f_0026.xhtml#d24e2858)\n     3. [Creating More Specific Layouts](f_0027.xhtml#d24e3054)\n     4. [Adding Content to List Pages](f_0028.xhtml#d24e3296)\n     5. [Customizing the Project List](f_0029.xhtml#d24e3391)\n     6. [Your Turn](f_0030.xhtml#d24e3478)\n     7. [Wrapping Up](f_0031.xhtml#d24e3489)\n  6. [4\\. Working with Data](f_0032.xhtml#chp.data)\n     1. [Using Site Configuration Data in Your Theme](f_0033.xhtml#d24e3507)\n     2. [Populating Page Content Using Data in Front Matter](f_0034.xhtml#sec.data.frontmatter)\n     3. [Conditionally Displaying Data](f_0035.xhtml#d24e4260)\n     4. [Using Local Data Files](f_0036.xhtml#d24e4434)\n     5. [Pulling Data from Remote Sources](f_0037.xhtml#sec.data.remote.sources)\n     6. [Syndicating Content with RSS](f_0038.xhtml#d24e5070)\n     7. [Rendering Content as JSON](f_0039.xhtml#d24e5448)\n     8. [Your Turn](f_0040.xhtml#d24e5700)\n     9. [Wrapping Up](f_0041.xhtml#d24e5747)\n  7. [5\\. Adding a Blog](f_0042.xhtml#chp.blog)\n     1. [Creating the Post’s Layout](f_0043.xhtml#d24e5879)\n     2. [Organizing Content with Taxonomies](f_0044.xhtml#sec.taxonomies)\n     3. [Customizing the URL for Posts](f_0045.xhtml#sec.customizing.url.posts)\n     4. [Customizing Blog List Pages](f_0046.xhtml#d24e6813)\n     5. [Adding Pagination](f_0047.xhtml#d24e7094)\n     6. [Adding Comments to Posts Using Disqus](f_0048.xhtml#d24e7665)\n     7. [Displaying Related Content](f_0049.xhtml#d24e7922)\n     8. [Your Turn](f_0050.xhtml#d24e8131)\n     9. [Wrapping Up](f_0051.xhtml#d24e8161)\n  8. [6\\. Adding Search to Your Site](f_0052.xhtml#chp.search)\n     1. [Creating the Document Collection](f_0053.xhtml#d24e8200)\n     2. [Creating the Search Interface](f_0054.xhtml#d24e8522)\n     3. [Improving the Search](f_0055.xhtml#d24e9016)\n     4. [Your Turn](f_0056.xhtml#d24e9307)\n     5. [Wrapping Up](f_0057.xhtml#d24e9326)\n  9. [7\\. Managing Assets with Pipes](f_0058.xhtml#chp.assets)\n     1. [Managing Stylesheets](f_0059.xhtml#d24e9361)\n     2. [Managing Images](f_0060.xhtml#d24e9797)\n     3. [Bundling JavaScript Files](f_0061.xhtml#d24e10660)\n     4. [Using Webpack and npm with Hugo](f_0062.xhtml#sec.webpack.node)\n     5. [Your Turn](f_0063.xhtml#d24e11574)\n     6. [Wrapping Up](f_0064.xhtml#d24e11600)\n  10. [8\\. Deploying the Site](f_0065.xhtml#chp.deploy)\n     1. [Deploying to Netlify](f_0066.xhtml#d24e11636)\n     2. [Deploying to Cloud Storage with Hugo](f_0067.xhtml#d24e12132)\n     3. [Deploying to a Traditional Web Server](f_0068.xhtml#d24e12641)\n     4. [Your Turn](f_0069.xhtml#d24e12994)\n     5. [Wrapping Up](f_0070.xhtml#d24e13023)\n  11. [A1. Migrating to Hugo](f_0071.xhtml#apx.migrating)\n     1. [Understanding What You Have](f_0072.xhtml#d24e13054)\n     2. [Transferring the Content](f_0073.xhtml#d24e13084)\n     3. [Replicating the Theme](f_0074.xhtml#d24e13427)\n     4. [Making the Switch](f_0075.xhtml#d24e13452)\n     5. [Wrapping Up](f_0076.xhtml#d24e13473)\n  12. [ Bibliography](f_0077.xhtml#d24e13480)\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  Early praise for _Build Websites with Hugo_\n\nI loved learning Hugo by building a real site from the ground up. Well-\nthought-out exercises at the end of each chapter ensure you master the\nmaterial. If you run a website or blog and want to make it simpler, faster,\nand more flexible, then you need to read this book.\n\n→ | Kieran Tully  \n---|---  \n| Solution Architect, Mastercard  \n  \nAbsolute guide for getting started on Hugo, and for learning how to build your\nnext amazing website. A must read for documentation experts and technical\nwriters looking to add power to their documentation website.\n\n→ | Aleemullah Samiullah  \n---|---  \n| Senior Engineering Specialist, Software AG  \n  \nThere are so many introductions and tutorials out there about bringing a\nwebsite online with WordPress, but _Build Websites with Hugo_ is the\nintroduction you need to get going fast—without a lot of overhead. Brian gives\nyou the tools to start crafting something and sparks your creativity, making\nyou want to create a fast, stylish, static site with Hugo. By the end of this\nbook, Hugo will go from being a stranger to being one of your best friends.\n\n→ | Dan Sarauer  \n---|---  \n| Computer Support Supervisor, City of Eau Claire\n\n\n#  \nAcknowledgments\n\nFirst off, this book wouldn’t be possible without Hugo itself, which is a\nresult of the fantasic work of the Hugo team. Thank you Bjørn Erik Pedersen,\nSteve Francia, and all of the other amazing people who’ve contributed to Hugo.\nThanks to your work, making things on the web is fun again, and I’m excited to\nshare the joy that Hugo brings to everyone who reads this book.\n\nThank you Tammy Coron for editing this book and keeping me on track. And for\nasking some pretty great questions when I failed to explain some things.\n\nThank you Andy Hunt for publishing this book.\n\nThank you Dan Kacenjar, Greg Myers, Ryan Palo, Aleem Samiullah, Dan Sarauer,\nKieran Tully, and Stephen Wolff, for reviewing the draft of this book and\ncatching errors before the general public would have. I wrote this book in\nchunks, and many pieces got moved around. Your keen eyes caught many places\nwhere inconsistencies crept in. Without your help, readers would have gotten\nconfused or stuck in more than a few places.\n\nThank you to my business associates Mitch Bullard, Jeff Carley, Kevin Gisi,\nAlex Henry, Jeff Holland, Chris Johnson, Jon Kinney, Nick LaMuro, Myles\nSteinhauser, Jessica Stodola, Charley Stran, Josh Swan, Erich Tesky, Mitchell\nVolk, Chris Warren, Mike Weber, and Andrew Vahey for your continued support.\n\nThank you Lisa and Ana for inspiring me. Thank you Carissa, for your love and\nsupport, and for all you do for our family.\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  \nPreface\n\nAre you using a database to serve content that rarely changes? If you’re using\nWordPress, Ghost, or other solutions for your content site, you probably are.\nOr at best, you’ve set up caching strategies to speed things up and reduce\ndatabase calls.\n\nDatabase-driven content management systems like WordPress let you define a\ncommon theme shared across your site, making it a breeze to publish new\ncontent. However, since most content doesn’t change in real time, you’re\nsacrificing speed and scalability for features that benefit content creators\nand developers instead of the people who want to read your content. And that\nadditional complexity means you need more resources in production too: more\nservers to handle the traffic, standby database servers, a caching layer you\nhave to manage, and more.\n\nThere’s no better way to make a snappy content site than by serving static\npages from a traditional web server or a content delivery network (CDN). But\nyou don’t have to give up the rapid development features you’ve come to\nexpect. Static site generators, like Hugo,[[1]](f_0009.xhtml#FOOTNOTE-1) give\nyou a fantastic middle ground. You get the theming and content management\nfeatures of a database-driven site without the bloat, security\nvulnerabilities, or complexities associated with caching.\n\nHugo gives you a framework for building a fast, organized content site using\nmany of the skills you already have. You define your layouts in HTML and your\ncontent in Markdown. Hugo has built-in support for tagging, categorization,\nrelated content, multiple output formats, image optimization, and asset\nhandling. While you’re developing your site, Hugo gives you a web server for\ntesting, and automatically refreshes your pages as you change them. When\nyou’re done building your site, Hugo generates a static site that you can\nupload to your web server.\n\nThere are other static website generators available, like\nJekyll[[2]](f_0009.xhtml#FOOTNOTE-2) and Gatsby,[[3]](f_0009.xhtml#FOOTNOTE-3)\ntwo popular and well-known choices. Hugo has a few benefits over those other\nchoices. First, Hugo uses a single binary with no dependencies, which means\nyou don’t need a complex build chain or additional runtimes like Node or Ruby\nto get started or use its features. Unlike Jekyll, Hugo doesn’t assume you’re\ncreating a blog. And unlike Gatsby, you don’t need to learn React to build\nyour themes or content; if you already know HTML and Markdown, you can be\nproductive right away. Finally, Hugo is incredibly fast when it comes to\nbuilding the site. It can generate thousands of pages quickly, which comes in\nhandy if you’re using Hugo to build something like a documentation website.\n\nIn this book, you’ll use Hugo to build a personal portfolio site that you can\nuse to showcase your skills and thoughts to the world. You’ll build the basic\nskeleton, develop a custom theme, and use content templates to generate new\npages quickly. You’ll use internal and external data sources to embed content\ninto your site, and render some of your content in JSON and RSS. You’ll add a\nblog section with posts and integrate Disqus with your site, and then make\nyour site searchable. While this isn’t a web design book, you’ll integrate\nmodern CSS into the site, and use Hugo’s asset management features to process\nstyles, images, and scripts. Then you’ll integrate Hugo with Node.js and\nWebpack for those situations where you need a little more flexibility.\nFinally, you’ll explore deployment with Netlify,[[4]](f_0009.xhtml#FOOTNOTE-4)\ncloud storage, and traditional web hosts so you can share your work with the\nworld.\n\n\n## What’s in This Book\n\nEach chapter of the book covers a specific part of the development process\nwith Hugo.\n\nIn Chapter 1, [​ _Kicking the Tires_ ​](f_0010.xhtml#chp.kicking.tires),\nyou’ll build the home page and a few supporting pages, along with a skeleton\nlayout.\n\nThen, in Chapter 2, [​ _Building a Basic Theme_\n​](f_0018.xhtml#chp.basictheme), you’ll transform the layout into a custom\ntheme for the site. You’ll break things up into reusable pieces and put\neverything in its place.\n\nIn Chapter 3, [​ _Adding Content Sections_\n​](f_0024.xhtml#chp.content.sections), you’ll create the projects section of\nthe site. You’ll work with custom content types and build out more customized\nlayouts for your new content type.\n\nThen, you’ll integrate data into the site in Chapter 4, [​ _Working with Data_\n​](f_0032.xhtml#chp.data). You’ll leverage front matter from your docs, data\nfrom external files, and data from external sites. You will also render some\nof your content as JSON data.\n\nIn Chapter 5, [​ _Adding a Blog_ ​](f_0042.xhtml#chp.blog), you’ll use what\nyou’ve learned so far to use Hugo to build a static blog. You’ll create a\ncontent template for blog posts, create a custom layout to control how your\nposts display, and add support for commenting. You’ll generate lists of posts,\nincluding a main list of posts in reverse chronological order, as well as\nlists for tags and categories.\n\nIn Chapter 6, [​ _Adding Search to Your Site_ ​](f_0052.xhtml#chp.search),\nyou’ll get search working with your site using a search index along with some\nclient-side JavaScript.\n\nNext, in Chapter 7, [​ _Managing Assets with Pipes_\n​](f_0058.xhtml#chp.assets), you’ll set up a proper asset pipeline so that you\ncan manage your JavaScript and CSS files more easily. You’ll switch to using\nSass for your stylesheets and explore some of Hugo’s built-in features for\nhandling images. You’ll also look at integrating Webpack with Hugo, and using\nnpm to manage tasks that make building your site easier.\n\nIn Chapter 8, [​ _Deploying the Site_ ​](f_0065.xhtml#chp.deploy), you’ll\nexplore a few methods to move your site to production for the world to see.\nYou’ll deploy to Netlify, then look at deploying to Amazon S3, and finally,\nhow to deploy to more traditional web servers.\n\nFinally, you’ll find Appendix 1, [​ _Migrating to Hugo_\n​](f_0071.xhtml#apx.migrating), which explores the process of what it takes to\nmove an existing site to Hugo.\n\nAt the end of each chapter, you’ll find a few additional exercises that will\nhelp cement your knowledge of the concepts.\n\n\n## What You Need\n\nYou’ll need your trusty text editor and some experience building things for\nthe web with HTML and CSS. This book doesn’t go into much detail about those\nthings and assumes you’ve built websites before. You won’t use any CSS\nframeworks for the layout of your site, but you will use a small amount of\nmodern CSS. The CSS you’ll use in this book is intended to demonstrate\nconcepts, not to substitute for careful and professional design. However, if\nyou’re an experienced web developer, you’ll be able to see exactly where you\ncan apply your existing knowledge as you build out your design.\n\nHugo runs on Windows, macOS, and various flavors of Linux and BSD operating\nsystems, and it’s a single binary file with no dependencies. You’ll download\nand install Hugo in the first chapter. The examples of this book use Hugo\nversion 0.68.3.\n\nBecause Hugo is a command-line tool, you should be comfortable using the\ncommand-line interface (CLI). You’ll use the hugo command throughout the book\nto build your site, launch a development server, and generate files. If you\nwant to get more comfortable with the CLI, you’ll find [_Small, Sharp Software\nTools_ [Hog19]](f_0077.xhtml#d1868e2) helpful.\n\nThe examples in this book will show CLI commands for copying and moving files.\nThese commands will work in the macOS and Linux terminals, and they will also\nwork on Windows machines using the Windows Subsystem for Linux if you’ve\nconfigured that. Alternatively, you can use your graphical environment or text\neditor to manage and create files.\n\nAdditionally, some experience with JavaScript will be helpful when integrating\nsearch into the site.\n\nFinally, in Chapter 5, [​ _Adding a Blog_ ​](f_0042.xhtml#chp.blog) and\nChapter 7, [​ _Managing Assets with Pipes_ ​](f_0058.xhtml#chp.assets), you’ll\nuse Node.js[[5]](f_0009.xhtml#FOOTNOTE-5) for some additional tooling. You\nshould have Node.js installed on your system by following the official\ninstallation instructions for your platform.\n\n\n## Conventions\n\nThroughout the book you’ll see commands like this:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**site** ​​**** ​​**portfolio** ​  \n---|---  \n  \nThis is a command that you’ll type at your command-line interface. The dollar\nsign indicates the prompt. You won’t type that character.\n\nYou’ll also see code listings, like this:\n\n​ | <div class=​ _\"container\"_ ​>  \n---|---  \n​ |   \n​ | </div>  \n  \nSometimes, you’ll see highlighted sections when adding new lines of code, like\nthis:\n\n​ | <div class=​ _\"container\"_ ​>  \n---|---  \n»|  <header>  \n»|  <h1>{{ .Site.title }}</h1>  \n»|  </header>  \n​ | </div>  \n  \nYou’ll find instructions on where to add the code to your project with each\nlisting, along with details on what the code does.\n\n\n## Online Resources\n\nThe book’s website[6] has links to submit errata for the book as well as the\nsource code for the sites you’ll build in this book. The downloadable source\ncode is there as a reference and contains the site as it exists at the end of\neach chapter.\n\n#### Footnotes\n\n[[1]](f_0005.xhtml#FNPTR-1)\n\n    \n\n<https://gohugo.io>\n\n[[2]](f_0005.xhtml#FNPTR-2)\n\n    \n\n<https://jekyllrb.com/>\n\n[[3]](f_0005.xhtml#FNPTR-3)\n\n    \n\n<https://www.gatsbyjs.org/>\n\n[[4]](f_0005.xhtml#FNPTR-4)\n\n    \n\n<https://www.netlify.com/>\n\n[[5]](f_0007.xhtml#FNPTR-5)\n\n    \n\n<https://nodejs.org>\n\n[6]\n\n    \n\n<http://pragprog.com/book/bhhugo>\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  Chapter 1  \nKicking the Tires\n\nThe best way to get comfortable with Hugo is to start building something with\nit. Throughout this book, you’ll use Hugo to build a portfolio site with a\nblog. In this chapter, you’ll develop a basic understanding of Hugo, layouts,\ncontent, and configuration, which form the foundation for working with Hugo as\nyou build a basic site.\n\nBut first, you need to install Hugo.\n\n\n## Installing Hugo\n\nHugo is available as a single binary. You can install Hugo two ways: using a\npackage manager, or by downloading the binary manually and placing it in a\nglobal location so you can run it anywhere.\n\nHugo comes in two versions: a regular version and an extended version that has\nadditional support for asset management, which you’ll want in Chapter 7, [​\n_Managing Assets with Pipes_ ​](f_0058.xhtml#chp.assets).\n\nPackage managers are utilities that let you install and remove programs and\nutilities. Linux systems often have a built-in package manager. If you’re\nrunning macOS, you can install the Homebrew[[7]](f_0017.xhtml#FOOTNOTE-7)\npackage manager. If you’re using Windows, you can install\nChocolatey.[[8]](f_0017.xhtml#FOOTNOTE-8) Finally, Linux users can install\nLinuxbrew,[[9]](f_0017.xhtml#FOOTNOTE-9) a version of Homebrew for Linux that\noffers more up-to-date packages than the package manager that comes with their\nsystem.\n\nInstallation via a package manager is the easiest method, although you might\nnot always get the most recent version.\n\nIf you’re using a Mac and you have Homebrew installed, you can install the\nextended version of Hugo with:\n\n​ | ​$ ​​**brew** ​​**** ​​**install** ​​**** ​​**hugo** ​  \n---|---  \n  \nOn Windows, if you have Chocolatey installed, you can install Hugo with this\ncommand:\n\n​ | ​$ ​​**choco** ​​**** ​​**install** ​​**** ​​**-y** ​​**** ​​**hugo-extended** ​  \n---|---  \n  \nTo install Hugo manually, find the extended version’s binary for your\noperating system on the Releases page[[10]](f_0017.xhtml#FOOTNOTE-10) on\nGitHub. For example, if you’re on Windows, you’re looking for a filename like\nhugo-extended-x.y.z-Windows-64bit.zip. Download the file.\n\nNow that you’ve manually downloaded the file, you’ll want to add it to your\nPATH environment variable, which your command-line interface uses to determine\nwhere it can find executable programs. That way you can execute it without\nspecifying the full directory location.\n\nOn macOS or Linux, copy the executable to /usr/local/bin, which is already\nincluded in your PATH environment variable by default.\n\nOn Windows 10, create the directory C:\\hugo\\bin. Copy the hugo.exe file you\nextracted to C:\\hugo\\bin, and then add that folder to your PATH environment\nvariable. To do this, use the Windows Search and type “environment”. Choose\nthe option for Edit Environment Variables for My Account. On the screen that\nappears, press the Environment Variables button, locate PATH in the System\nVariables section, and press the Edit button. Add c:\\hugo\\bin. Press OK to\nsave the settings, and then press OK on the rest of the dialogs to close them.\n\nOnce Hugo is installed, run the hugo version command from your command-line\ninterface to ensure that Hugo is available in any directory on your system,\nand that you’ve installed the extended version:\n\n​ | ​$ ​​**hugo** ​​**** ​​**version** ​  \n---|---  \n​ | Hugo Static Site Generator v0.68.3/extended darwin/amd64 BuildDate: unknown  \n  \nThe hugo command has several subcommands that you’ll use as you build your\nsite. You can see a list of all commands with hugo help.\n\nHugo is installed and ready. Let’s use it to build a basic site.\n\n\n## Creating Your Site\n\nHugo has a built-in command that generates a website project for you; this\nincludes all of the files and directories you need to get started.\n\nExecute the following command to tell Hugo to create a new site named\nportfolio:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**site** ​​**** ​​**portfolio** ​  \n---|---  \n  \nThis creates the portfolio directory, with the following files and directories\nwithin:\n\n​ | portfolio/  \n---|---  \n​ | ├── archetypes  \n​ | │ └── default.md  \n​ | ├── config.toml  \n​ | ├── content  \n​ | ├── data  \n​ | ├── layouts  \n​ | ├── static  \n​ | └── themes  \n  \nEach of these directories has a specific purpose:\n\n  * The archetypes directory is where you place Markdown templates for various types of content. An “archetype” is an original model or pattern that you use as the basis for other things of the same type. Hugo uses the files in the archetypes folder as models when it generates new content pages. There’s a default one that places a title and date in the file and sets the draft status to true. You’ll create new ones later.\n\n  * The config.toml file holds configuration variables for your site that Hugo uses internally when constructing your pages, but you can also use values from this file in your themes. For example, you’ll find the site’s title in this file, and you can use that in your layout.\n\n  * The content directory holds all of the content for your site. You can organize your content in subdirectories like posts, projects, and videos. Each directory would then contain a collection of Markdown or HTML documents.\n\n  * The data directory holds data files in YAML, JSON, or TOML. You can load these data files and extract their data to populate lists or other aspects of your site.\n\n  * The layouts folder is where you define your site’s look and feel.\n\n  * The static directory holds your CSS, JavaScript files, images, and any other assets that aren’t generated by Hugo.\n\n  * The themes directory holds any themes you download or create. You can use the layouts folder to override or extend a theme you’ve downloaded.\n\nIn your terminal, switch to the newly created portfolio directory:\n\n​ | ​$ ​​**cd** ​​**** ​​**portfolio** ​  \n---|---  \n  \nTake a look at the site’s configuration file. Open the config.toml file in\nyour text editor. You’ll see the following text:\n\n​ | baseURL = ​ _\"http://example.org/\"_ ​  \n---|---  \n​ | languageCode = ​ _\"en-us\"_ ​  \n​ | title = ​ _\"My New Hugo Site\"_ ​  \n  \nThis file is written in TOML,[[11]](f_0017.xhtml#FOOTNOTE-11) a configuration\nformat designed to be easy to read and modify. The default configuration file\nonly has a handful of data, but you’ll add more as you build out your site.\n\nHugo’s internal functions use the baseURL value to build absolute URLs. If you\nhave a domain name for your site, you should change this value to reflect that\ndomain. In this book, you’ll use relative URLs, so you can leave this value\nalone until you’re ready to deploy your site to production.\n\nThe title value is where you’ll store the site’s title. You’ll use this value\nin your layouts, so change it from its default value:\n\n[kicking_tires/portfolio/config.toml](http://media.pragprog.com/titles/bhhugo/code/kicking_tires/portfolio/config.toml)\n\n​ | baseURL = ​ _\"http://example.org/\"_ ​  \n---|---  \n​ | languageCode = ​ _\"en-us\"_ ​  \n»| title = ​ _\"Brian's Portfolio\"_ ​  \n  \nSave the file and exit the editor. You’re ready to start working on the site\nitself.\n\n\n## Building the Home Page\n\nA typical web page has a skeleton that looks like this:\n\n​ | ​ _<!DOCTYPE html>_​  \n---|---  \n​ | <html lang=​ _\"en-US\"_ ​>  \n​ |  <head>  \n​ |  <meta charset=​ _\"utf-8\"_ ​>  \n​ |  <title>Title</title>  \n​ |  </head>  \n​ |  <body>  \n​ |  ​ _<!-- some content goes here -->_​  \n​ |  </body>  \n​ | </html>  \n  \nEvery time you create a page, you start with a skeleton such as this and then\nfill in the body section. Your site will likely have a lot more common\nelements like navigation, a banner, and a footer. As you build out your site,\nyou end up duplicating all of this content on every page, which is difficult\nto manage if you do it by hand. That’s why dynamic sites are so popular; they\nprovide mechanisms to reduce duplication by separating the content from the\nlayout.\n\nIn a Hugo site, you define layouts that contain this skeleton, so you can keep\nthis boilerplate code in a central location. Your content pages contain only\nthe content, and Hugo applies a layout based on the type of content.\n\nHugo needs a layout for the home page of your site, a layout for other content\npages, and a layout that shows a list of pages, like an archive index or a\nproduct list. The following figure illustrates this relationship:\n\n![images/kicking_tires/layouts.png](Images/layouts.png)\n\nAs you can see in the figure, the “home page” of the site has its own layout.\nThe “Product list” page has a “list layout” associated with it. However, the\ntwo product pages and the “About” page all share a layout.\n\nIn this chapter, you’ll create a layout for the home page and another layout\nfor single pages, and they’ll have nearly identical content. You’ll build a\nlayout for list pages in the next chapter.\n\nLet’s start with the home page layout. Hugo uses a separate layout for the\nhome page because it assumes you’ll want your home page to have a different\nlook than other content pages. For example, your home page might contain a\nlist of recent blog posts or articles, or show previews of other content. Or\nit might have a larger banner image than other pages. For now, you’ll keep the\nhome page simple.\n\nCreate the file layouts/index.html and add the following code, which defines\nan HTML skeleton for the home page:\n\n[kicking_tires/portfolio/layouts/index.html](http://media.pragprog.com/titles/bhhugo/code/kicking_tires/portfolio/layouts/index.html)\n\n​ | ​ _<!DOCTYPE html>_​  \n---|---  \n​ | <html lang=​ _\"en-US\"_ ​>  \n​ |  <head>  \n​ |  <meta charset=​ _\"utf-8\"_ ​>  \n​ |  <title>{{ .Site.Title }}</title>  \n​ |  </head>  \n​ |  <body>  \n​ |   \n​ |  <h1>{{ .Site.Title}}</h1>  \n​ |   \n​ |  {{ .Content }}  \n​ |   \n​ |  </body>  \n​ | </html>  \n  \nTo pull in data and content, Hugo uses Go’s http/templates\nlibrary[[12]](f_0017.xhtml#FOOTNOTE-12) in its layouts. While you don’t need a\ndeep understanding of how the templating language works, it’s worth exploring\nwhen you want to build more complex templates.\n\nIn addition to the HTML code, there are some spots between double curly\nbraces. This is how you define where content goes, and the content can come\nfrom many places. The {{ .Site.Title }} lines pull the title field out of the\nconfig.toml file you just edited and place it into the <title> and <h1> tags.\nThe .Site prefix tells Hugo to get the value from the site’s data rather than\nfrom the page’s data. As you’ll see shortly, pages have their own data that\nyou can use.\n\nThe {{ .Content }} line displays the content for the page, which will come\nfrom an associated Markdown document in your site’s content folder. Note that\nthis doesn’t use the .Site prefix, because this data is related to the page.\nWhen you’re working with a Hugo layout, there’s a “scope”, or “context” that\ncontains the data you want to access. The current context in a template is\nrepresented by the dot. In a Hugo layout, the context is set to the Page\ncontext, which looks something like this:\n\n​ | Context (.)  \n---|---  \n​ | ├── Site.  \n​ | │ └── Title  \n​ | ├── Title  \n​ | └── Content  \n  \nFor convenience, Hugo makes all of the site’s data available in the Page\ncontext under the Site key. That’s why you can do .Site.Title to get the\nsite’s title. To get the page title, you’d use .Title. There are many more\npieces of data available to you within this context, and you’ll use many of\nthem later in the book.\n\nYou’ve added the {{ .Content }} statement to the home page layout, but you’re\nprobably wondering where the content comes from. For the site’s home page,\nHugo will look for the content in a file named _index.md in the content\ndirectory. This special filename is how Hugo finds content for all index\npages, like the home page and lists of content like tags, categories, or other\ncollections you’ll create.\n\nCreate the content/_index.md file and open it in your editor. You can place\nany valid Markdown content into this file. For this example, add a couple\nsentences and a list of what’s on the site:\n\n[kicking_tires/portfolio/content/_index.md](http://media.pragprog.com/titles/bhhugo/code/kicking_tires/portfolio/content/_index.md)\n\n​ | This is my portfolio.  \n---|---  \n​ |   \n​ | On this site, you'll find  \n​ |   \n​ | * My biography  \n​ | * My projects  \n​ | * My résumé  \n  \nAfter you’ve added your content, save the file.\n\nTime to test things out. Hugo has a built-in development server that you can\nuse to preview your site while you build it. Run the following command to\nstart the server:\n\n​ | ​$ ​​**hugo** ​​**** ​​**server** ​  \n---|---  \n  \nHugo builds your site and displays the following output in your console\nletting you know that the server is running:\n\n​ | ​...​  \n---|---  \n​ | Web Server is available at http://localhost:1313/ (bind address 127.0.0.1)  \n​ | Press Ctrl+C to stop  \n  \nVisit http://localhost:1313 in your web browser and you’ll see your home page:\n\n![images/kicking_tires/homepage.png](Images/homepage.png)\n\nUse your browser’s View Source feature and you’ll see the layout and your\ncontent combined:\n\n​ | ​ _<!DOCTYPE html>_​  \n---|---  \n​ | <html lang=​ _\"en-US\"_ ​>  \n​ |  <head>  \n​ |  <meta name=​ _\"generator\"_ ​ content=​ _\"Hugo 0.68.3\"_ ​ />  \n​ |  <script src=​ _\"/livereload.js?port=1313 &mindelay=10&v=2\"_​  \n​ |  data-no-instant defer></script>  \n​ |  <meta charset=​ _\"utf-8\"_ ​>  \n​ |  <title>Brian&#39;s Portfolio</title>  \n​ |  </head>  \n​ |  <body>  \n​ |  <h1>Brian&#39;s Portfolio</h1>  \n​ |  <p>This is my portfolio.</p>  \n​ |  <p>On this site, you&rsquo;ll find</p>  \n​ |  <ul>  \n​ |  <li>My biography</li>  \n​ |  <li>My projects</li>  \n​ |  <li>My résumé</li>  \n​ |  </ul>  \n​ |  </body>  \n​ | </html>  \n  \nHugo’s development server automatically reloads files when they change. Open\nthe content/_index.md file in your text editor and make some changes to the\ncontent. When you save the file, the changes appear in your browser\nautomatically. There’s no need to install a separate server or browser\nextension. The single Hugo binary handles it all for you by injecting a little\nbit of JavaScript at the bottom of each page which handles reloading the page.\n\nIn your terminal, press CTRL+C to stop the Hugo server. You’re ready to add\nanother page to the site, but this time you will do it with Hugo’s content\ngenerator.\n\n\n## Creating Content Using Archetypes\n\nWhen you created content/_index.md, you created the file manually. You can\ntell Hugo to create content pages that contain placeholder content. This way,\nyou never have to start with a blank slate when creating content. Hugo uses\narchetypes to define this default content.\n\nThe file archetypes/default.md—which was generated when you ran the hugo new\nsite command—contains the following code:\n\n[kicking_tires/portfolio/archetypes/default.md](http://media.pragprog.com/titles/bhhugo/code/kicking_tires/portfolio/archetypes/default.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _{{_ ​ ​ _replace_ ​ ​ _.Name_ ​ ​ _\"-\" \" \" | title }}\"_ ​  \n​ | date: {{ .Date }}  \n​ | draft: true  \n​ | ​**\\---** ​  \n  \nThis is a Markdown file with YAML front matter and a little bit of templating\ncode that will generate the title from the filename you specify, and fill in\nthe date the file is generated. Hugo uses the front matter of each file when\nit generates pages. You’ll dig into front matter a lot more in [​ _Populating\nPage Content Using Data in Front Matter_\n​](f_0034.xhtml#sec.data.frontmatter). Front matter isn’t required in either\ncontent pages or archetypes, but you’ll find it useful in many places as you\nbuild out your site. In this case, there’s a draft field set to true. When\nHugo generates pages, it will skip pages marked as drafts.\n\nThe hugo new command uses this file as a template to create a new Markdown\nfile. Try it out. Create a new “About” page with this command:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**about.md** ​  \n---|---  \n​ | /Users/brianhogan/portfolio/content/about.md created  \n  \nThis generates the file content/about.md. Open the file in your editor, and\nyou’ll see this code:\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _About\"_ ​  \n​ | date: ​ _2020-01-01T12:40:44-05:00_ ​  \n​ | draft: true  \n​ | ​**\\---** ​  \n  \nThe title is filled in, and the front matter also includes the date and time\nthe file was created. It also has a draft status of true. Modify the draft\nstatus to false or remove the line entirely so that Hugo will generate this\npage. Then, below the front matter, add some additional content. When you’re\ndone, your file will look like this:\n\n[kicking_tires/portfolio/content/about.md](http://media.pragprog.com/titles/bhhugo/code/kicking_tires/portfolio/content/about.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _About\"_ ​  \n​ | date: ​ _2020-01-01T12:40:44-05:00_ ​  \n​ | draft: false  \n​ | ​**\\---** ​  \n​ |   \n​ | This is my About page.  \n  \nIn order for Hugo to generate this page, you need another layout file.\nRemember that the layout you created, index.html, is only for the home page of\nthe site. The “About” page you just created is an example of what Hugo calls a\n“single” page. As such, you need a “single page” layout to display it.\n\nYou can create different single page layouts for each content type. These get\nstored in subdirectories of the layouts directory. You’re not going to do\nanything that complex yet. To create a default single page layout that every\ncontent page will use, store it in the layouts/_default directory. Create that\ndirectory now, either in your text editor or on the command line like this:\n\n​ | ​$ ​​**mkdir** ​​**** ​​**layouts/_default/** ​  \n---|---  \n  \nNow, create the file layouts/_default/single.html by copying the existing\nlayouts/index.html file. Again, you can do this in your editor or the CLI:\n\n​ | ​$ ​​**cp** ​​**** ​​**layouts/index.html** ​​**** ​​**layouts/_default/single.html** ​  \n---|---  \n  \nLet’s make a slight modification to this file; you’ll have it display the page\ntitle in addition to the content. Open the single.html file in your editor and\nadd the title like this:\n\n[kicking_tires/portfolio/layouts/_default/single.html](http://media.pragprog.com/titles/bhhugo/code/kicking_tires/portfolio/layouts/_default/single.html)\n\n​ | <body>  \n---|---  \n​ |   \n​ |  <h1>{{ .Site.Title}}</h1>  \n​ |   \n»|  <h2>{{ .Title }}</h2>  \n​ |   \n​ |  {{ .Content }}  \n​ |   \n​ | </body>  \n  \nSave the file and exit the editor. Then, start up the development server\nagain:\n\n​ | ​$ ​​**hugo** ​​**** ​​**server** ​  \n---|---  \n  \nVisit http://localhost:1313/about and you’ll see your new page:\n\n![images/kicking_tires/about.png](Images/about.png)\n\nThe site title, page title, and page content are all visible. The page title\ncomes from the about.md file’s front matter, while the site title comes from\nthe config.toml file. This is a small example of how you can use data from\nvarious locations to build your pages.\n\nStop the Hugo server with CTRL+C. Let’s explore what Hugo creates for you and\nlook at a few options to control it.\n\n\n## Building and Exploring Hugo’s Output\n\nWhen you run hugo server, it generates your content in memory. To write Hugo’s\noutput to disk, run the hugo command with no options, like this:\n\n​ | ​$ ​​**hugo** ​  \n---|---  \n​ | ​...​  \n​ |  | EN  \n​ | +------------------+----+  \n​ |  Pages | 5  \n​ |  Paginator pages | 0  \n​ |  Non-page files | 0  \n​ |  Static files | 0  \n​ |  Processed images | 0  \n​ |  Aliases | 0  \n​ |  Sitemaps | 1  \n​ |  Cleaned | 0  \n​ |   \n​ | Total in 21 ms  \n  \nThis generates the pages for your site in a new directory named public. If you\nlook at that directory’s contents, you’ll see these files and directories:\n\n​ | public/  \n---|---  \n​ | ├── about  \n​ | │ └── index.html  \n​ | ├── categories  \n​ | │ └── index.xml  \n​ | ├── index.html  \n​ | ├── index.xml  \n​ | ├── sitemap.xml  \n​ | └── tags  \n​ |  └── index.xml  \n  \nHugo has created the HTML files for your home page and the About page, as well\nas the file index.xml, which is an RSS feed for your site. It’s also created a\nsitemap file, as well as RSS feeds for your site’s tags and categories. You’re\nnot doing anything with those right now, so you can ignore them.\n\nThis public folder is your entire static site. To host it, you could upload\nthe contents of the public folder to your web server, or upload it to your\nCDN. You’ll explore how to put your site live in Chapter 8, [​ _Deploying the\nSite_ ​](f_0065.xhtml#chp.deploy).\n\nHugo doesn’t clean up the public folder. If you were to remove some pages or\nrename them, you would need to delete the generated versions from the public\nfolder as well. It’s much easier to delete the entire public folder whenever\nyou generate the site:\n\n​ | ​$ ​​**rm** ​​**** ​​**-r** ​​**** ​​**public** ​​**** ​​**& &**​​**** ​​**hugo** ​  \n---|---  \n  \nAlternatively, use Hugo’s \\--cleanDestinationDir argument:\n\n​ | ​$ ​​**hugo** ​​**** ​​**\\--cleanDestinationDir** ​  \n---|---  \n  \nYou can tell Hugo to minify the files it generates. This process removes\nwhitespace characters, resulting in smaller file sizes that will make the site\ndownload faster for your visitors. To do this, use the \\--minify option:\n\n​ | ​$ ​​**hugo** ​​**** ​​**\\--cleanDestinationDir** ​​**** ​​**\\--minify** ​  \n---|---  \n  \nThe public/index.html now looks something like this:\n\n​ | ​ _<!doctype html>_​<html lang=​ _en-us_ ​><head><meta name=​ _generator_ ​  \n---|---  \n​ | content=​ _\"Hugo 0.68.3\"_ ​><meta charset=​ _utf-8_ ​><title>Brian's Portfolio</title>  \n​ | </head><body><h1>Brian's Portfolio</h1><p>This is my portfolio.</p>  \n​ | <p>On this site, you&rsquo;ll find</p><ul><li>My biography</li>  \n​ | <li>My projects</li><li>My résumé</li></ul></body></html>  \n  \nAll the indentation and line breaks are removed. As a result, this file\ncontains fewer bytes, which means it’ll transfer faster when you eventually\ndeploy the files to production.\n\n\n## Your Turn\n\nBefore moving on, try the following things to make sure you understand how\npage creation and content generation works:\n\n  1. Change the draft status of the About page’s content back to true and regenerate the site with the hugo command, with no additional options. Notice that the about/index.html file still exists. Use the \\--cleanDestinationDir option and the about/index.html file will disappear. Set the draft status back to false again and rebuild the site to restore the file.\n\n  2. Create a “Résumé” page using hugo new resume.md. The generated title in the front matter will say “Resume”. Open the content/resume.md file in your editor, update the generated title from “Resume” to “Résumé”, and set the draft status to false. Fill in some content, and then run the development web server. Navigate to http://localhost:1313/resume to view the page. The single page content template you created applies to this page as well.\n\n  3. Experiment with the default archetype. Change the draft state to false in the default archetype and generate a fourth page called contact.md. This new page will now have the draft state set to false. All future pages you create with the hugo new command will now have this status set.\n\n\n## Wrapping Up\n\nYou built a basic Hugo site, and you created a handful of content pages using\nHugo’s command-line interface. You’ve also defined the layout those content\npages will use. However, you’ve got some duplicate code in your layout, which\nmakes your site more difficult to maintain. In the next chapter, you’ll\nextract your layout into a reusable theme and organize the code to reduce\nduplication.\n\n#### Footnotes\n\n[[7]](f_0011.xhtml#FNPTR-7)\n\n    \n\n<https://brew.sh>\n\n[[8]](f_0011.xhtml#FNPTR-8)\n\n    \n\n<https://chocolatey.org>\n\n[[9]](f_0011.xhtml#FNPTR-9)\n\n    \n\n<https://docs.brew.sh/Homebrew-on-Linux>\n\n[[10]](f_0011.xhtml#FNPTR-10)\n\n    \n\n<https://github.com/gohugoio/hugo/releases>\n\n[[11]](f_0012.xhtml#FNPTR-11)\n\n    \n\n<https://github.com/toml-lang/toml>\n\n[[12]](f_0013.xhtml#FNPTR-12)\n\n    \n\n<https://golang.org/pkg/text/template/>\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  Chapter 2  \nBuilding a Basic Theme\n\nYou’ve built your site, but you have two nearly identical layout files with a\nlot of duplicate code. Your site’s layout is going to get more complex as you\nintroduce additional content types, navigation, and styles, so it’s time to\nstart organizing things. So far, you’ve placed all of your layout files into\nyour Hugo site’s layouts directory, but Hugo has another mechanism for\ncontrolling how things look: themes.\n\nThere are many Hugo themes available that you can use, but instead of using\none created by someone else, you’re going to build your own. Many off-the-\nshelf themes are fairly complex with lots of features that take time to\nconfigure properly. It’s best to understand how theming works before you dive\ninto someone else’s code.\n\nA basic Hugo theme only needs these files:\n\n​ | layouts  \n---|---  \n​ | ├── _default  \n​ | │ ├── list.html  \n​ | │ └── single.html  \n​ | └─── index.html  \n  \nThis should look pretty familiar to you from the previous chapter. The\nindex.html file is the home page of the site. The _default directory contains\nthe default layouts applied to single content pages (single.html) and pages\nthat display lists of content pages (list.html). However, as you’ll discover\nin this chapter, there are some additional files you can create that will let\nyou share code between files.\n\nLet’s get started with your theme.\n\n\n## Generating the Theme\n\nYou can make a theme by creating a new directory in the themes folder of your\nsite, but Hugo has a built-in theme generator that creates everything you need\nfor your theme. Execute this command from the root of your Hugo site to\ngenerate a new theme named basic:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**theme** ​​**** ​​**basic** ​  \n---|---  \n​ | Creating theme at ...portfolio/themes/basic  \n  \nThis command creates the themes/basic directory and several subdirectories and\nfiles:\n\n​ | themes/basic/  \n---|---  \n​ | ├── LICENSE  \n​ | ├── archetypes  \n​ | │ └── default.md  \n​ | ├── layouts  \n​ | │ ├── 404.html  \n​ | │ ├── _default  \n​ | │ │ ├── baseof.html  \n​ | │ │ ├── list.html  \n​ | │ │ └── single.html  \n​ | │ ├── index.html  \n​ | │ └── partials  \n​ | │ ├── footer.html  \n​ | │ ├── head.html  \n​ | │ └── header.html  \n​ | ├── static  \n​ | │ ├── css  \n​ | │ └── js  \n​ | └── theme.toml  \n  \nThe theme has a place for its own archetypes, as well as directories to store\nthe layout files and static assets like stylesheets, scripts, and images. Each\ntheme has a license file so you can open source your theme if you choose, as\nwell as a configuration file where you can store theme-specific configuration\nvalues.\n\nNotice that there’s already a layouts/_default directory with files for single\npage layouts and list page layouts. There’s also a layouts/index.html file\nthat serves as the home page layout. Those files don’t have any content in\nthem, though.\n\nMove your existing layout files into this new theme. Move the\nlayouts/index.html file to themes/basic/layouts/index.html, and then move\nlayouts/_default/single.html to themes/basic/layouts/_default/single.html. You\ncan do this quickly with these commands:\n\n​ | ​$ ​​**mv** ​​**** ​​**layouts/index.html** ​​**** ​​**themes/basic/layouts/index.html** ​  \n---|---  \n​ | ​$ ​​**mv** ​​**** ​​**layouts/_default/single.html** ​​**** ​​**themes/basic/layouts/_default/single.html** ​  \n  \nBefore you can use the theme, you have to tell Hugo about it by adding a line\nto your site’s configuration. Open config.toml and add the following line to\nthe end:\n\n[basic_theme/portfolio/config.toml](http://media.pragprog.com/titles/bhhugo/code/basic_theme/portfolio/config.toml)\n\n​ | baseURL = ​ _\"http://example.org/\"_ ​  \n---|---  \n​ | languageCode = ​ _\"en-us\"_ ​  \n​ | title = ​ _\"Brian's Portfolio\"_ ​  \n»| theme = ​ _\"basic\"_ ​  \n  \nSave the file and run the server again:\n\n​ | hugo server  \n---|---  \n  \nVisit http://localhost:1313 in your browser. Your home page still displays,\nwhich means your theme works. Once you know it works, stop the development\nserver with Ctrl-c.\n\nNow, let’s break the theme up and reduce some duplication by taking advantage\nof Hugo’s layout framework.\n\n\n## Using Content Blocks and Partials\n\nYour home page layout and single page layout both contain the HTML skeleton.\nThat skeleton is going to get a lot more complex once you add a header,\nfooter, and navigation. Instead of duplicating that code in multiple places,\nHugo provides a single place for you to put your skeleton so that all other\nlayouts can build on it. When you created the theme, it generated it for you.\n\nLocate the file themes/basic/layouts/_default/baseof.html and open it in your\neditor. You’ll see this code:\n\n​ | ​ _<!DOCTYPE html>_​  \n---|---  \n​ | <html>  \n​ |  {{- partial \"head.html\" . -}}  \n​ |  <body>  \n​ |  {{- partial \"header.html\" . -}}  \n​ |  <div id=​ _\"content\"_ ​>  \n​ |  {{- block \"main\" . }}{{- end }}  \n​ |  </div>  \n​ |  {{- partial \"footer.html\" . -}}  \n​ |  </body>  \n​ | </html>  \n  \nThis file will be the “base” of every other layout you’ll create, hence its\nname. And instead of including the full skeleton, it’s pulling in other files,\nor partials, which contain pieces of the layout. Placing common pieces in\npartials makes it easier for you to reuse these across different layouts, and\nit helps you think about parts of your site as components. The template\ngenerator also created these files, but it left them blank. Let’s fill them\nin, one piece at a time.\n\nThe first partial listed in the baseof.html file is the head.html file, which\nyou’ll find in themes/basic/layouts/partials/head.html. This file will contain\nthe code that would normally appear in the head section of a website. Open it\nin your editor.\n\nAdd the following code to the file to define the head element, with one meta\ntag that specifies the content type, another meta tag that specifies the\nviewport, so your page will scale properly on mobile devices, and finally, the\ntitle of the site:\n\n[basic_theme/portfolio/themes/basic/layouts/partials/head.html](http://media.pragprog.com/titles/bhhugo/code/basic_theme/portfolio/themes/basic/layouts/partials/head.html)\n\n​ | <head>  \n---|---  \n​ |  <meta charset=​ _\"utf-8\"_ ​>  \n​ |  <meta name=​ _\"viewport\"_ ​ content=​ _\"width=device-width, initial-scale=1\"_ ​>  \n​ |  <title>{{ .Site.Title }}</title>  \n​ | </head>  \n  \nSave the file when you’ve made those changes.\n\nThe next partial reference is the header.html file, so open the file\nthemes/basic/layouts/partials/header.html. This file will hold the header of\nyour page. It’s where you’ll put the banner and navigation. Add the following\ncode to add an HTML header section and a nav section with links to the root of\nthe site and the static pages you created in the previous chapter:\n\n[basic_theme/portfolio/themes/basic/layouts/partials/header.html](http://media.pragprog.com/titles/bhhugo/code/basic_theme/portfolio/themes/basic/layouts/partials/header.html)\n\n​ | <header>  \n---|---  \n​ |  <h1>{{ .Site.Title }}</h1>  \n​ | </header>  \n​ |   \n​ | <nav>  \n​ |  <a href=​ _\"/\"_ ​>Home</a>  \n​ |  <a href=​ _\"/about\"_ ​>About</a>  \n​ |  <a href=​ _\"/resume\"_ ​>Résumé</a>  \n​ |  <a href=​ _\"/contact\"_ ​>Contact</a>  \n​ | </nav>  \n  \nHugo has support for a more complex menu system, where you can configure your\nmenu titles and destinations in your site’s configuration file, but for small\nsites like this, it’s less work to hard-code the URLs in the navigation. Since\nthe navigation is in a partial, you only have to maintain it in a single file,\nso there’s no advantage to doing it in a data-driven fashion like you would\nwith a dynamic site.\n\nFinally, create the footer of the site by opening\nthemes/basic/layouts/_default/partials/footer.html, the last partial\nreferenced in the baseof.html file. Add a footer element and a copyright date\nto the file with the following code:\n\n[basic_theme/portfolio/themes/basic/layouts/partials/footer.html](http://media.pragprog.com/titles/bhhugo/code/basic_theme/portfolio/themes/basic/layouts/partials/footer.html)\n\n​ | <footer>  \n---|---  \n​ |  <small>Copyright {{now.Format \"2006\"}} Me.</small>  \n​ | </footer>  \n  \nYou’re using Go’s date formatting to print out the current year. Go uses Mon\nJan 2 15:04:05 MST 2006 as a reference time for its formatters. Instead of\nhaving to use special characters to parse out a current time, Go lets you use\nthis reference time to format the specific dates and times. In this case, you\nonly want the year, so you can use “2006” as the formatting string.\n\nAll of the partials for the base template are in place, but before moving on,\nlet’s look at the syntax for partials in the baseof.html file. Partials in the\nbaseof.html template that Hugo generated for you look like this:\n\n​ | {{- partial \"head.html\" . -}}  \n---|---  \n  \nPreviously, when you’ve used those curly braces to inject the title, you used\n{{. But this code uses {{-. The dash suppresses whitespace characters in the\noutput, such as spaces and newline characters. Placing a dash after the\nopening braces removes all whitespace in front of the expression, and placing\nthe dash in front of the closing braces removes whitespace after the\nexpression. In most cases, it’s up to you whether or not you want to use them,\nbut you’ll often see dashes used to reduce the number of blank lines in the\nfiles Hugo generates.\n\nIn addition to the dashes, there’s a dot after the name of the partial. The\npartial function takes a filename and a context for the data. In order to\naccess data like the page title and content, you have to pass the context to\nthe partial function, and a period means “the current context.” Remember that\nthe default context for a layout is the Page context, so when you pass the dot\nto the partial function, you’re making the Page context available to the\npartial.\n\nTo use the new base template, replace the existing layouts you’ve used with\ncode that defines a layout “block”. In the baseof.html file, you’ll find this\nline:\n\n​ | {{- block \"main\" . }}{{- end }}  \n---|---  \n  \nThis line looks for a block named “main” and pulls it in. Those blocks are\nwhat you’ll define in your actual layout pages like index.html and\nsingle.html. Notice it’s also passing the current context, so you’ll be able\nto access it in the layout pages.\n\nDefine this block in your home page layout first. Open\nthemes/basic/layouts/index.html and replace the contents with this code, which\ndefines the main block:\n\n[basic_theme/portfolio/themes/basic/layouts/index.html](http://media.pragprog.com/titles/bhhugo/code/basic_theme/portfolio/themes/basic/layouts/index.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ |   \n​ |  {{ .Content }}  \n​ |   \n​ | {{ end }}  \n  \nWhen Hugo builds the site, it’ll construct the home page by combining the\ncontent file (content/_index.md) with the layout file, which will then use the\nbaseof file. The partials and content are all assembled, creating the full\npage.\n\nThe index.html layout only affects your site’s home page, so modify the code\nin themes/basic/layouts/_default/single.html so the single page layout works\nthe same way:\n\n[basic_theme/portfolio/themes/basic/layouts/_default/single.html](http://media.pragprog.com/titles/bhhugo/code/basic_theme/portfolio/themes/basic/layouts/_default/single.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ |   \n​ |  <h2>{{ .Title }}</h2>  \n​ |   \n​ |  {{ .Content }}  \n​ |   \n​ | {{ end }}  \n  \nThis code looks just like the code in the home page layout, except you’re also\ndisplaying the title of the page.\n\nWith the changes in place, make sure all your files are saved and then fire up\nthe development server with hugo server. Visit http://localhost:1313 and test\nyour pages. The home page displays with the current year displayed in the\nfooter.\n\n![images/basic_theme/basic_unstyled.png](Images/basic_unstyled.png)\n\nUse the navbar you created to jump between pages to ensure they all work.\n\nYou now have a working theme that’s organized and maintainable. Let’s add some\nCSS to make it look nice.\n\n\n## Styling the Theme with CSS\n\nIn addition to layout files, themes contain images, scripts, and the\nstylesheets that control the visual aspects of the site, such as colors,\nfonts, and placement of content. These assets go in the static/ directory of\nyour theme. You’ll find both a css folder and js folder in your theme’s static\nfolder.\n\nTo style your site, you could bring in any number of CSS frameworks, but for\nthis site, you’ll build a very bare-bones layout by hand using plain CSS.\nModern browsers have built-in support for newer CSS features like\nFlexbox[[13]](f_0023.xhtml#FOOTNOTE-13) or CSS Grid, which makes it much less\nchallenging to build a layout.\n\nThe theme you’re going to build in this book won’t win any design awards, but\nit will give you a place to start from and show you how to integrate CSS into\nyour Hugo site.\n\nBefore diving into the CSS, let’s add more structure to the layout so you can\nhave more control over the width of the page. This will be helpful on larger\ndevices. Modify the baseof file to wrap everything in a div with the class of\ncontainer, and change the existing div tag around the main block to an HTML\nmain sectioning tag. The main tag will make it easier for assistive technology\nto identify the site’s main content, and the container div will let you\ncontrol how wide the site is on larger monitors when you add the CSS:\n\n[basic_theme/portfolio/themes/basic/layouts/_default/baseof.html](http://media.pragprog.com/titles/bhhugo/code/basic_theme/portfolio/themes/basic/layouts/_default/baseof.html)\n\n​ | ​ _<!DOCTYPE html>_​  \n---|---  \n​ | <html>  \n​ |  {{- partial \"head.html\" . -}}  \n​ |  <body>  \n»|  <div class=​ _\"container\"_ ​>  \n​ |  {{- partial \"header.html\" . -}}  \n»|  <main>  \n​ |  {{- block \"main\" . }}{{- end }}  \n»|  </main>  \n​ |  {{- partial \"footer.html\" . -}}  \n»|  </div>  \n​ |  </body>  \n​ | </html>  \n  \nSave the file.\n\nNow, create the stylesheet itself. Since you’re making a theme, create the\nfile themes/basic/static/css/style.css.\n\nIn the file, add this code to define the width of the container:\n\n[basic_theme/portfolio/themes/basic/static/css/style.css](http://media.pragprog.com/titles/bhhugo/code/basic_theme/portfolio/themes/basic/static/css/style.css)\n\n​ | .container {  \n---|---  \n​ |  margin: 0 auto;  \n​ |  width: 80%;  \n​ | }  \n  \nNext, define the background and foreground colors for the navigation bar and\nfooter of the site, and center the text in both:\n\n[basic_theme/portfolio/themes/basic/static/css/style.css](http://media.pragprog.com/titles/bhhugo/code/basic_theme/portfolio/themes/basic/static/css/style.css)\n\n​ | nav, footer {  \n---|---  \n​ |  background-color: #333;  \n​ |  color: #fff;  \n​ |  text-align: center;  \n​ | }  \n  \nOn small screens, the navigation elements will need to stack as a list; on\nlarger screens, the navigation can be a long horizontal navigation bar. Add\nthis code to style the navbar for both small and large screens:\n\n[basic_theme/portfolio/themes/basic/static/css/style.css](http://media.pragprog.com/titles/bhhugo/code/basic_theme/portfolio/themes/basic/static/css/style.css)\n\n​ | nav {  \n---|---  \n​ |  display: flex;  \n​ |  flex-direction: column;  \n​ | }  \n​ |   \n​ | nav > a {  \n​ |  flex: 1;  \n​ |  text-align: center;  \n​ |  text-decoration: none;  \n​ |  color: #fff;  \n​ | }  \n​ |   \n​ | ​**@media** ​ only screen and (min-width: 768px) {  \n​ |  nav { flex-direction: row; }  \n​ | }  \n  \nThis code defines the nav element as a Flexbox region and defines the elements\nin the region to flow as a column. It then sets the anchor elements within the\nnavbar as flex elements, evenly spaced apart. After that, it defines a color\nfor each element and centers the text for each link. From there, using a media\nquery targeting on larger screens, it redefines the flex-direction to align\nthe contents as a row.\n\nFinally, in the head.html partial, add a link tag to load a stylesheet named\nstyle.css, which will be located in the css directory:\n\n[basic_theme/portfolio/themes/basic/layouts/partials/head.html](http://media.pragprog.com/titles/bhhugo/code/basic_theme/portfolio/themes/basic/layouts/partials/head.html)\n\n​ | <head>  \n---|---  \n​ |  <meta charset=​ _\"utf-8\"_ ​>  \n​ |  <meta name=​ _\"viewport\"_ ​ content=​ _\"width=device-width, initial-scale=1\"_ ​>  \n​ |  <title>{{ .Site.Title }}</title>  \n»|  <link rel=​ _\"stylesheet\"_ ​ href=​ _\"{{ \"_ ​css​**/** ​style​**.**\n​css​**\"** ​ ​**|** ​ relURL ​**}}\"** ​>  \n  \nThe relURL function creates site-root-relative link to the file instead of an\nabsolute link that contains the site’s domain name. For ease of development\nand deployment, you should use relative URLs whenever possible. When Hugo\ngenerates the site, it’ll copy the contents of the themes/basic/static\ndirectory, including all subdirectories, into the public directory, so your\nCSS file will be located at /css/style.css.\n\nSave the file and switch back to your browser. The styles are applied to the\npage and you have a basic theme. In Chapter 7, [​ _Managing Assets with Pipes_\n​](f_0058.xhtml#chp.assets), you’ll explore more things you can do with CSS.\n\n![images/basic_theme/basic_styled.png](Images/basic_styled.png)\n\nIn this chapter, you kept the stylesheet in the static directory of the theme\ninstead of in the static directory in your Hugo site. It’s best to follow this\nconvention and use your site’s static directory for images or other assets\nthat are specific to your site, and keep things that are specific to the theme\nwithin the theme’s directory structure. When you generate your site, Hugo will\ngrab files from both places and put them in the public directory. If you name\nfiles the same, the ones in your site’s static directory will override the\nones in the theme.\n\n\n## Your Turn\n\nTo solidify your understanding of how theming works in Hugo, try the following\nexercises:\n\n  1. Currently, the header partial contains the site’s header and navigation. Use what you’ve learned about partials to move the navigation section into its own partial called nav.html.\n\n  2. Create a new theme named “bootstrap” using the theme generator. Create a layout using Bootstrap instead of your own custom CSS. Follow Bootstrap’s documentation[[14]](f_0023.xhtml#FOOTNOTE-14) to create your theme. To test it out, be sure to switch your site’s theme in config.toml. Be sure to switch the theme back to basic before continuing on with the book.\n\n  3. Look at the Hugo theme gallery[[15]](f_0023.xhtml#FOOTNOTE-15) and examine the source code for an existing theme you like. If you have Git installed, use Git to download the theme to your site and try it out. Many public themes have additional settings you’ll have to configure, so explore the documentation for the theme you select.\n\n\n## Wrapping Up\n\nYou now know how to create a Hugo theme from scratch, using regular HTML and\nCSS, along with a small amount of Go’s templating language. Your layouts are\ndefined in a clear maintainable way, and you’ll add more to your theme in the\nfollowing chapters.\n\nYou’re ready to look at Hugo’s powerful content creation and management\nfeatures.\n\n#### Footnotes\n\n[[13]](f_0021.xhtml#FNPTR-13)\n\n    \n\n<https://www.w3.org/TR/css-flexbox-1/>\n\n[[14]](f_0022.xhtml#FNPTR-14)\n\n    \n\n<https://getbootstrap.com/docs/4.1/getting-started/introduction/>\n\n[[15]](f_0022.xhtml#FNPTR-15)\n\n    \n\n<https://themes.gohugo.io/>\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  Chapter 3  \nAdding Content Sections\n\nHugo is designed to help you get your content in front of people quickly. Hugo\nhas a few rules and conventions about how it handles collections of content,\nand understanding them will let you add and manage entire content sections to\nyour site quickly.\n\nIn this chapter, you’ll build a “projects” section of the site that showcases\nthings you’ve accomplished. You’ll create a custom layout for projects so\nthey’re visually distinct from the other pieces of your site, and you’ll use\nHugo’s archetypes feature to create a content template so you can create new\nproject pages quickly.\n\nLet’s start with that content template.\n\n\n## Creating a Project Archetype\n\nIn [​ _Creating Content Using Archetypes_\n​](f_0014.xhtml#sec.create.with.archetype), you learned about the default\narchetype that Hugo automatically includes when you generate a new site. When\nyou created new pages, this archetype acted as a content template, filling in\nthe YAML front matter for you. You can create more specific archetypes for\nother types of content and include whatever you’d like, including placeholder\ncontent.\n\nCreate the file archetypes/projects.md and open it in your editor. Add the\nfollowing to the file, which defines not only front matter, but some\nplaceholder content:\n\n[content_sections/portfolio/archetypes/projects.md](http://media.pragprog.com/titles/bhhugo/code/content_sections/portfolio/archetypes/projects.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _{{_ ​ ​ _replace_ ​ ​ _.Name_ ​ ​ _\"-\" \" \" | title }}\"_ ​  \n​ | draft: false  \n​ | ​**\\---** ​  \n​ |   \n​ | ![alt](​ _//via.placeholder.com/640x150_ ​)  \n​ |   \n​ | Description...  \n​ |   \n​ | ### Tech used  \n​ |   \n​ | * item  \n​ | * item  \n​ | * item  \n  \nThe front matter is nearly identical to the content in the default archetype,\nwhich uses some Go template functions to generate the page name from the\nfilename. But unlike the default archetype, you’re adding some content to the\nbody. You specified a placeholder image, a placeholder for the description,\nand a “Tech Used” section where you can list the various pieces of technology\nyou used. Whenever you generate a new project, Hugo uses this file as the\nbasis, and you can use the placeholder text here to quickly fill out your\nproject’s details.\n\nSave the file and try it out. Create a new project page with the hugo new\ncommand:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**projects/awesomeco.md** ​  \n---|---  \n​ | /Users/brianhogan/portfolio/content/projects/awesomeco.md created  \n  \nThis generates content/projects/awesomeco.md. The hugo new command creates\nfiles in the content directory, and since you prefixed the filename with\nprojects/, Hugo looked for, and found, a projects archetype, which it used to\ncreate this file.\n\nWhen you open the file, you’ll see that Hugo used your new project archetype\ninstead of the default:\n\n[content_sections/portfolio/content/projects/awesomeco.md](http://media.pragprog.com/titles/bhhugo/code/content_sections/portfolio/content/projects/awesomeco.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _Awesomeco\"_ ​  \n​ | draft: false  \n​ | ​**\\---** ​  \n​ |   \n​ | ![alt](​ _//via.placeholder.com/640x150_ ​)  \n​ |   \n​ | Description...  \n​ |   \n​ | ### Tech used  \n​ |   \n​ | * item  \n​ | * item  \n​ | * item  \n  \nReplace the placeholder text with some details associated with the project.\nSave the file, start up the development server with hugo server, and visit\nhttp://localhost:1313/projects/awesomeco to view the project page as shown in\nthe screenshot.\n\n![images/content_sections/awesomeco.png](Images/awesomeco.png)\n\nStop the server and create another project page with the hugo new command:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**projects/jabberwocky.md** ​  \n---|---  \n  \nThis creates the file content/projects/jabberwocky.md. Start up the server\nagain. You’ll find this file at http://localhost:1313/projects/jabberwocky.\n\n![Joe asks:](Images/joe.jpg)\n\nJoe asks:\n\nDo I Have to Stop and Start the Server Every Time I Want to Add a New File?\n\nNo, you don’t. Hugo is usually pretty good at noticing new files. That said,\nin this book I’m going to prompt you to do so at various times because this\nensures you’ll see exactly what you should. It also avoids you having to\njuggle multiple terminal windows or manage background processes.\n\nYou now have a fast way to generate pages that showcase your projects. All you\nhave to do is generate a new page and fill in the details. Archetypes can be\nfantastic boilerplates that guide you as you create additional content.\n\nUnfortunately, if you visited http://localhost:1313/projects, instead of a\nlist of projects, you won’t see anything at all. That’s because you haven’t\ndefined a layout that displays lists. Let’s do that now.\n\n\n## Creating the List Layout\n\nUp until this point, you’ve only worked with individual pages, like the home\npage or a project page. You haven’t done anything with lists of content yet.\nBut if you’re looking to show a list of tags, categories, or in this case,\nprojects, you have to define a layout for those named list.html. When you\ngenerated the theme, Hugo placed a list layout in the\nthemes/basic/layouts/_default directory, but it’s blank. That’s why you don’t\nsee anything when you visit http://localhost:1313/projects.\n\nLet’s define a default list template that will work for all list pages on the\nsite. Open the file themes/basic/layouts/_default/list.html and add the\nfollowing code to the file, which displays the title of the content page and\nbuilds a list of links to each content page:\n\n[content_sections/portfolio/themes/basic/layouts/_default/list.html](http://media.pragprog.com/titles/bhhugo/code/content_sections/portfolio/themes/basic/layouts/_default/list.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ |   \n​ |  <h2>{{ .Title }}</h2>  \n​ |  <ul>  \n​ |  {{ range .Pages }}  \n​ |  <li><a href=​ _\"{{ .RelPermalink }}\"_ ​>{{ .Title }}</a></li>  \n​ |  {{ end }}  \n​ |  </ul>  \n​ |   \n​ | {{ end }}  \n  \nThe {{ range .Pages }} section is where the magic happens. The .Pages\ncollection contains all of the pages related to the section you’re working\nwith. When Hugo builds the list page for Projects, for example, it collects\nall the pages within content/projects and makes those available in the .Pages\nvariable in the context. The range function lets you iterate over the results\nso you can display each record in the collection. Inside of the range block,\nyou access the properties of each page, as the context is now set to that\nspecific page’s context. In this case, you’re displaying the site-relative URL\nand title of each page.\n\nFire up the development server again with hugo server and visit\nhttp://localhost:1313/projects, and you’ll see a list of your projects. Notice\nthat the heading on the page also shows “Projects”. The .Title variable at the\ntop of the layout file uses the content type’s title:\n\n![images/content_sections/projects.png](Images/projects.png)\n\nWith this in place, add a Projects link to your main navigation so visitors\ncan find that section. In the exercises at the end of Chapter 2, [​ _Building\na Basic Theme_ ​](f_0018.xhtml#chp.basictheme), you moved your navigation from\nthe header partial to its own nav partial. Open\nthemes/basic/layouts/partials/nav.html and add the link to the /projects url:\n\n[content_sections/portfolio/themes/basic/layouts/partials/nav.html](http://media.pragprog.com/titles/bhhugo/code/content_sections/portfolio/themes/basic/layouts/partials/nav.html)\n\n​ | <nav>  \n---|---  \n​ |  <a href=​ _\"/\"_ ​>Home</a>  \n​ |  <a href=​ _\"/about\"_ ​>About</a>  \n»|  <a href=​ _\"/projects\"_ ​>Projects</a>  \n​ |  <a href=​ _\"/resume\"_ ​>Résumé</a>  \n​ |  <a href=​ _\"/contact\"_ ​>Contact</a>  \n​ | </nav>  \n  \nThe default list layout you made is very generic. It’s a good start and will\nserve you well when you add other content types to your site later. Let’s\ncreate more specific layouts for projects so you can make project pages look a\nlittle different.\n\n\n## Creating More Specific Layouts\n\nYou’ll often find that you’ll want some pages or sections of your site to have\nslightly different themes or layouts. Let’s make a specific layout for project\npages that displays the list of projects in the sidebar of each project page\nso that visitors can navigate through projects easier. You’ll use a similar\napproach to the one you just used to make the list of projects.\n\nIn the themes/basic/layouts folder, create a new folder named projects. You\ncan do that on the command line like this:\n\n​ | ​$ ​​**mkdir** ​​**** ​​**themes/basic/layouts/projects/** ​  \n---|---  \n  \nThen, create the file themes/basic/layouts/projects/single.html. Add this code\nto define the main block with sections for the content and the project list:\n\n[content_sections/portfolio/themes/basic/layouts/projects/single.html](http://media.pragprog.com/titles/bhhugo/code/content_sections/portfolio/themes/basic/layouts/projects/single.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ |  <div class=​ _\"project-container\"_ ​>  \n​ |  <section class=​ _\"project-list\"_ ​>  \n​ |  <h2>Projects</h2>  \n​ |  </section>  \n​ |   \n​ |  <section class=​ _\"project\"_ ​>  \n​ |  <h2>{{ .Title }}</h2>  \n​ |   \n​ |  {{ .Content }}  \n​ |  </section>  \n​ |   \n​ |  </div>  \n​ | {{ end }}  \n  \nIn the project-list section, add the code to iterate over all of your projects\nand display a link to each page. Since you’re not working with a collection in\na list layout, you won’t have access to a .Pages variable. Hugo provides a\nmechanism where you can access any content collection. The .Site.RegularPages\nvariable gives you access to all of the pages in your site. You can whittle\nthat down with the where function, which works similar to how a SQL statement\nworks. For example, to find all of the Project pages, you’d write this\nstatement:\n\n​ | {{ range (where .Site.RegularPages \"Type\" \"in\" \"projects\") }}  \n---|---  \n  \nSo, to display the list of all projects, add this code to the project_list\nsection:\n\n[content_sections/portfolio/themes/basic/layouts/projects/single.html](http://media.pragprog.com/titles/bhhugo/code/content_sections/portfolio/themes/basic/layouts/projects/single.html)\n\n​ | <section class=​ _\"project-list\"_ ​>  \n---|---  \n​ |  <h2>Projects</h2>  \n»|  <ul>  \n»|  {{ range (where .Site.RegularPages \"Type\" \"in\" \"projects\") }}  \n»|  <li><a href=​ _\"{{ .RelPermalink }}\"_ ​>{{ .Title }}</a></li>  \n»|  {{ end }}  \n»|  </ul>  \n​ | </section>  \n  \nYou can sort the items too. If you’d like to order them by the most recent\nproject first, use the .ByDate function and the .Reverse function like this:\n\n​ | range (where .Site.RegularPages \"Type\" \"in\" \"projects\").ByDate.Reverse  \n---|---  \n  \nIf you only wanted to display the most recent project, you could do this:\n\n​ | range first 1 (where .Site.RegularPages \"Type\" \"in\" \"projects\").ByDate.Reverse  \n---|---  \n  \nThis would be one way to showcase your most recent project on your site’s home\npage. Note that even though you’re only getting one element, you still treat\nit like a collection.\n\nStart up the development server, switch back to your browser, and visit a\nproject page. The list of projects shows up at the top of your page. Let’s\nturn that project list into a sidebar with a little CSS.\n\nOpen themes/basic/static/css/style.css in your editor. Locate the media query\nthat targets screens larger than 768 pixels wide, and add the following code\nto align the project list to the left of the screen in those situations:\n\n[content_sections/portfolio/themes/basic/static/css/style.css](http://media.pragprog.com/titles/bhhugo/code/content_sections/portfolio/themes/basic/static/css/style.css)\n\n​ | ​**@media** ​ only screen and (min-width: 768px) {  \n---|---  \n​ |  nav { flex-direction: row; }  \n​ |   \n»|  .project-container { display: flex; }  \n»|  \n»|  .project-container .project-list { width: 20%; }  \n»|  \n»|  .project-container .project { flex: 1; }  \n​ | }  \n  \nThe project info and the project list are contained in an element with the\nclass project. Applying display: flex to that element makes the two child\nelements sit side by side. You then set the width of the project list section\nto 20%, and you set flex: 1 for the project_info section, which causes the\nelement expands to fill the space. This gives you a nice two-column layout.\n\n![images/content_sections/projects_sidebar.png](Images/projects_sidebar.png)\n\nBefore moving on, let’s look at how to add Markdown content to the page that\nlists your projects.\n\n\n## Adding Content to List Pages\n\nWhen you visit http://localhost:1313/projects,you see a list of projects and\nnothing else. Let’s add some content to the page as well. To add content to\nlist pages, you need to add an _index.md file to the folder associated with\nthe content. This is similar to how you added content to your site’s home\npage.\n\nCreate the file content/projects/_index.md. You can do this with the hugo\ncommand:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**projects/_index.md** ​  \n---|---  \n​ | /Users/brianhogan/portfolio/content/projects/_index.md created  \n  \nOpen the file in your editor. It’ll have the front matter filled in, and it’ll\nalso have the placeholder content, since it applied the projects.md archetype.\nReplace the content with some text that introduces your projects:\n\n[content_sections/portfolio/content/projects/_index.md](http://media.pragprog.com/titles/bhhugo/code/content_sections/portfolio/content/projects/_index.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _Projects\"_ ​  \n​ | draft: false  \n​ | ​**\\---** ​  \n​ |   \n​ | This is a list of my projects. You can select each project to learn more about  \n​ | each one.  \n  \nThe list template you created earlier doesn’t display the content. Open\nthemes/basic/layouts/_default/list.html and add code to include the content\ninto the layout:\n\n[content_sections/portfolio/themes/basic/layouts/_default/list.html](http://media.pragprog.com/titles/bhhugo/code/content_sections/portfolio/themes/basic/layouts/_default/list.html)\n\n​ |  <h2>{{ .Title }}</h2>  \n---|---  \n​ |   \n»|  {{ .Content }}  \n  \nMake sure both files are saved and view your project list to see the content:\n\n![images/content_sections/projects_content.png](Images/projects_content.png)\n\nWith this in place, all list pages in your site support additional content,\nnot just your project list. However, all of those lists will look the same.\nLet’s make a layout for the project list next.\n\n\n## Customizing the Project List\n\nJust like how you can create layouts for individual items in a content\nsection, you can control how the list for a content section looks with its own\nlist layout. The default list layout uses a bulleted list, but let’s make a\nlayout for projects with a little more structure.\n\nCreate the file themes/basic/layouts/projects/list.html. Define the main\nblock, bring in the page title and the content section, and then iterate\nthrough the pages the same way you did for the default list page, but use HTML\nsectioning elements instead of a list:\n\n[content_sections/portfolio/themes/basic/layouts/projects/list.html](http://media.pragprog.com/titles/bhhugo/code/content_sections/portfolio/themes/basic/layouts/projects/list.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ |   \n​ |  <h2>{{ .Title }}</h2>  \n​ |   \n​ |  {{ .Content }}  \n​ |   \n​ |  <section class=​ _\"projects\"_ ​>  \n​ |  {{ range .Pages }}  \n​ |  <section class=​ _\"project\"_ ​>  \n​ |  <h3><a href=​ _\"{{ .RelPermalink }}\"_ ​>{{ .Title }}</a></h3>  \n​ |  </section>  \n​ |  {{ end }}  \n​ |  </section>  \n​ |   \n​ | {{ end }}  \n  \nSave the file and view the projects list again to see the changes:\n\n![images/content_sections/projects_list_custom.png](Images/projects_list_custom.png)\n\nIn Chapter 4, [​ _Working with Data_ ​](f_0032.xhtml#chp.data), you’ll add\nmore information about each project to this page, but for now this\ndemonstrates that you can override the default layout for a content section.\n\n\n## Your Turn\n\n  1. Add the most recent project to the site’s home page by modifying the index layout for the site.\n\n  2. Create a new type of content named “Presentations”. Create the archetype, a new single page template, a list template, a couple of content pages, and wire it up to your navigation.\n\n\n## Wrapping Up\n\nYou’ve added a new Projects section to your site so you can show off your\nprojects. Whenever you want to add a new project, you can generate a new\ncontent page with ease, thanks to the custom archetype you’ve built. When you\nwant to add new content sections to your site, you’ll follow this same\npattern.\n\nSometimes content comes from other sources, or you want other sites to be able\nto consume your content. Hugo has some features that let you do both, and\nyou’ll explore those next.\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  Chapter 4  \nWorking with Data\n\nModern sites are driven by data. That data might come in the form of content\nstored in Markdown files, or from external APIs.\n\nYou’ve already used some data in your site. For example, you’ve included the\nsite’s title in your templates, and you’ve displayed each page’s title. But\nyou’re not restricted to global configuration data. Hugo has built-in support\nfor incorporating external data files into your site, and it can fetch data\nfrom remote sources to generate content in your layouts.\n\n\n## Using Site Configuration Data in Your Theme\n\nYour layouts use {{ .Site.Title }} to display the name of the site in the\nbrowser title bar and in your header navigation. You can place all kinds of\nother data in your site’s configuration file and use it as well.\n\nFor example, let’s use the site’s configuration to build additional <meta>\ntags in the site’s header. The site configuration file has built-in fields\nlike Title, but you can add anything you’d like to this file if you add it to\na params section of the file.\n\nOpen config.toml and add a new params section that defines the author of the\nsite and a description of the site:\n\n[working_with_data/portfolio/config.toml](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/config.toml)\n\n​ | ​**[params]** ​  \n---|---  \n​ |  author = ​ _\"Brian Hogan\"_ ​  \n​ |  description = ​ _\"My portfolio site\"_ ​  \n  \nThen, open the file themes/basic/layouts/partials/head.html and add a new\nauthor meta tag to the page:\n\n[working_with_data/portfolio/themes/basic/layouts/partials/head.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/partials/head.html)\n\n»| <meta name=​ _\"author\"_ ​ content=​ _\"{{ .Site.Params.author }}\"_ ​>  \n---|---  \n​ | <link rel=​ _\"stylesheet\"_ ​ href=​ _\"{{ \"_ ​css​**/** ​style​**.** ​css​**\"** ​ ​**|** ​ relURL ​**}}\"** ​>  \n  \nBelow that, add one for the description:\n\n​ | <meta name=​ _\"description\"_ ​ content=​ _\"{{ .Site.Params.description }}\"_ ​>  \n---|---  \n  \nNow all of your pages will have these tags filled in. If you open your page in\na browser and look at its source, you’ll see the data:\n\n​ | ...  \n---|---  \n​ |  <title>Brian&#39;s Portfolio</title>  \n»|  <meta name=​ _\"author\"_ ​ content=​ _\"Brian Hogan\"_ ​>  \n»|  <meta name=​ _\"description\"_ ​ content=​ _\"My portfolio site\"_ ​>  \n​ |  <link rel=​ _\"stylesheet\"_ ​ href=​ _\"/css/style.css\"_ ​>  \n​ | ...  \n  \nThe description field isn’t page-specific yet, but you’ll fix that shortly\nafter you explore how to use front matter data to pull in content.\n\nAdding Google Analytics\n\nWhile we’re on the subject of data, you might want to collect data about how\npeople are interacting with your site. Hugo has built-in support for working\nwith Google Analytics,[[16]](f_0041.xhtml#FOOTNOTE-16) a platform from Google\nthat lets you track unique page views, browser data, and other metrics from\nyour site’s visitors.\n\nTo incorporate this into your site, grab your Google Analytics tracking ID and\nadd it to your site’s configuration file using the googleAnalytics field:\n\n​ |  title = ​ _\"Brian's Portfolio\"_ ​  \n---|---  \n»|  googleAnalytics = ​ _\"UA-xxxxxxxxxxxx\"_ ​  \n  \nThen, in your themes/basic/layouts/partials/head.html file, use Hugo’s built-\nin template:\n\n​ | {{ template \"_internal/google_analytics_async.html\" . }}  \n---|---  \n  \nWhen you generate your site, the appropriate JavaScript will be added to your\npages, and it’ll pull the tracking ID out of your site’s configuration.\n\nIf you are going to use Google Analytics or other tracking software, be sure\nto consult local privacy laws, as you may need to obtain permission from your\nusers to collect data.[[17]](f_0041.xhtml#FOOTNOTE-17)\n\n\n## Populating Page Content Using Data in Front Matter\n\nWhen you created your Project archetype, you created some placeholder content\nthat you could replace. Over time, you might want to change the content on\nthese pages, and going through each one manually to get them all looking the\nsame could be a lot of work.\n\nLet’s refactor the project pages so they’re more data-driven.\n\nModify the default archetype for Projects to include the image, the image’s\nalternative text, and the “Tech Used” content. You’ll also add a summary that\nyou can use in various places:\n\n[working_with_data/portfolio/archetypes/projects.md](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/archetypes/projects.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _{{_ ​ ​ _replace_ ​ ​ _.Name_ ​ ​ _\"-\" \" \" | title }}\"_ ​  \n​ | draft: false  \n​ | image: ​ _//via.placeholder.com/640x150_ ​  \n​ | alt_text: ​ _\"_ ​​ _{{_ ​ ​ _replace_ ​ ​ _.Name_ ​ ​ _\"-\" \" \" | title }} screenshot\"_ ​  \n​ | summary: ​ _\"_ ​​ _Summary_ ​ ​ _of_ ​ ​ _the_ ​ ​ _{{_ ​ ​ _replace_ ​ ​ _.Name_ ​ ​ _\"-\" \" \" | title }} project\"_ ​  \n​ | tech_used:  \n​ | \\- ​ _JavaScript_ ​  \n​ | \\- ​ _CSS_ ​  \n​ | \\- ​ _HTML_ ​  \n​ | ​**\\---** ​  \n​ |   \n​ | Description of the {{ replace .Name \"-\" \" \" | title }} project...  \n  \nNotice that you’re using the name of the file to generate some of the default\ntext for the summary, the image alt text, and even the main content.\n\nGenerate a third project using this template. Stop your server and execute the\nfollowing command to create a page for a project called “Linkitivity.”\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**projects/linkitivity.md** ​  \n---|---  \n​ | /Users/brianhogan/portfolio/content/projects/linkitivity.md created  \n  \nOpen content/projects/linkitivity.md and you’ll see this content:\n\n[working_with_data/portfolio/content/projects/linkitivity.md](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/content/projects/linkitivity.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _Linkitivity\"_ ​  \n​ | draft: false  \n​ | image: ​ _//via.placeholder.com/640x150_ ​  \n​ | alt_text: ​ _\"_ ​​ _Linkitivity_ ​ ​ _screenshot\"_ ​  \n​ | summary: ​ _\"_ ​​ _Summary_ ​ ​ _of_ ​ ​ _the_ ​ ​ _Linkitivity_ ​ ​ _project\"_ ​  \n​ | tech_used:  \n​ | \\- ​ _JavaScript_ ​  \n​ | \\- ​ _CSS_ ​  \n​ | \\- ​ _HTML_ ​  \n​ | ​**\\---** ​  \n​ |   \n​ | Description of Linkitivity project...  \n  \nThe name “Linkitivity” is placed throughout the front matter, making it easier\nfor you to maintain consistency.\n\nBefore moving on, modify the two existing project pages you created to reflect\nthese changes. Remove the placeholder text and move it all to the front matter\nsection instead, under those keys. For reference, here’s what your Awesomeco\nproject should look like:\n\n[working_with_data/portfolio/content/projects/awesomeco.md](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/content/projects/awesomeco.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _Awesomeco\"_ ​  \n​ | draft: false  \n​ | image: ​ _//via.placeholder.com/640x150_ ​  \n​ | alt_text: ​ _\"_ ​​ _Awesomeco_ ​ ​ _screenshot\"_ ​  \n​ | summary: ​ _\"_ ​​ _Summary_ ​ ​ _of_ ​ ​ _the_ ​ ​ _AwesomeCo_ ​ ​ _project\"_ ​  \n​ | tech_used:  \n​ | \\- ​ _JavaScript_ ​  \n​ | \\- ​ _CSS_ ​  \n​ | \\- ​ _HTML_ ​  \n​ | ​**\\---** ​  \n​ |   \n​ | Description of the Awesomeco project...  \n  \nNext, modify the project layout to use this data. Open\nthemes/basic/layouts/projects/single.html and locate the {{ .Content }}\nsection. Below that line, add code that adds the image and alternative text\nfrom the front matter, and then iterates through the values in the tech used\nfield to display those values on the page:\n\n[working_with_data/portfolio/themes/basic/layouts/projects/single.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/projects/single.html)\n\n​ | <section class=​ _\"project\"_ ​>  \n---|---  \n​ |  <h2>{{ .Title }}</h2>  \n​ |   \n​ |  {{ .Content }}  \n»|  <img alt=​ _\"{{ .Params.alt_text }}\"_ ​ src=​ _\"{{ .Params.image }}\"_ ​>  \n»|  \n»|  <h3>Tech used</h3>  \n»|  <ul>  \n»|  {{ range .Params.tech_used }}  \n»|  <li>{{ . }}</li>  \n»|  {{ end }}  \n»|  </ul>  \n​ |   \n​ | </section>  \n  \nNotice that the image, alt_text, and tech_used fields are prefixed by .Params.\nAny custom fields you add to the front matter get added to this .Params\ncollection. If you don’t add that prefix, Hugo won’t be able to find the data.\nFields like description and title are predefined fields that Hugo knows about,\nso you don’t need the params prefix when referencing them. You can find the\nlist of predefined fields in Hugo’s\ndocumentation.[[18]](f_0041.xhtml#FOOTNOTE-18)\n\nSave the layout and start the development server with hugo server. Visit\nhttp://localhost:1313/projects/awesomeco.md and your project displays, but\nthis time it’s driven by front matter data instead of hard-coded content:\n\n![images/data/data_project.png](Images/data_project.png)\n\nThis will give you a much more uniform approach for adding projects. There’s\nabsolutely nothing wrong with continuing to define your content using the\nmethod you used before, where you used placeholder content, but you might find\nthis method more appropriate for things that need to be developed in a more\nuniform fashion. However, by taking advantage of Hugo’s data-driven features,\nit’s easier to make list pages more interesting.\n\nThe information you’ve added to the front matter is available in other\ntemplates. Let’s add the information in each project’s summary field beneath\neach entry on the project listing page, so it’s more than just a list of\nprojects. Open themes/basic/layouts/projects/list.html and add the summary\nbeneath the project link:\n\n[working_with_data/portfolio/themes/basic/layouts/projects/list.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/projects/list.html)\n\n​ |  {{ range .Pages }}  \n---|---  \n​ |  <section class=​ _\"project\"_ ​>  \n​ |  <h3><a href=​ _\"{{ .RelPermalink }}\"_ ​>{{ .Title }}</a></h3>  \n»|  <p>{{ .Summary }}</p>  \n​ |  </section>  \n​ |  {{ end }}  \n​ |  </section>  \n​ |   \n​ | {{ end }}  \n  \nSave the page and visit http://localhost:1313/projects. The summaries now\nappear after each header as shown in the screenshot.\n\n![images/data/summaries.png](Images/summaries.png)\n\nRemember, when you’re working with range, it’s iterating over each entry.\nInside the block, the range is pointing at the current entry, so you can\naccess any of the properties of that item, including content or front matter\ndata.\n\nIn addition to displaying data, you can also use the data in pages to make\ndecisions about what to display.\n\n\n## Conditionally Displaying Data\n\nEarlier in this chapter, you added a <meta> tag for the description of the\npage, but it’s good practice to have that description reflect what’s actually\non the page. You can add conditional logic to your layouts to control how you\ndisplay data. For example, you can check to see if there’s a description field\nset on the page, and if there isn’t, you can fall back to the site-level\ndescription.\n\nHugo has an isset function which, at first glance, looks like a great way to\ncheck whether a variable has a value. Unfortunately, it has limitations that\naren’t intuitive. It doesn’t handle situations where values are always defined\nbut are empty, like default values. The Description field on a page is\nactually a default field. If you don’t define it in your page, its value will\nbe defined, but empty, and isset won’t work.\n\nTo handle cases where you’re checking for a value in a default variable like\nthis, use Hugo’s with function. Replace the existing meta description in\nthemes/basic/layouts/partials/head.html with this block of code, which\nconditionally sets the description:\n\n[working_with_data/portfolio/themes/basic/layouts/partials/head.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/partials/head.html)\n\n​ | <meta name=​ _\"description\"_ ​ content=​ _\"_ ​  \n---|---  \n​ | ​ _{{- with .Page.Description -}}_ ​  \n​ | ​ _{{ . }}_ ​  \n​ | ​ _{{- else -}}_ ​  \n​ | ​ _{{ .Site.Params.description }}_ ​  \n​ | ​ _{{- end -}}\"_ ​>  \n  \nThe with function rebinds the context. Using with, you can switch the current\ncontext to .Page.Description. Then within that block, a single period prints\nout the value. But the with function has a nice side effect: if the value of\nthe context is empty, then the block gets skipped and nothing gets rendered.\nTo handle the case where there’s no description, you pair the with function\nwith an else statement.\n\nSave the head partial. To test this new behavior, open the content file for\nthe project list page at content/projects/_index.md and add a description\nfield:\n\n[working_with_data/portfolio/content/projects/_index.md](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/content/projects/_index.md)\n\n​ | \\---  \n---|---  \n​ | title: \"Projects\"  \n​ | draft: false  \n»| description: A list of Brian's projects.  \n  \nSave the changes and visit the projects list page at\nhttp://localhost:1313/projects. Inspect the source and you’ll see that the\ndescription meta tag now shows the more specific description. You can now add\nthe description field to other content pages’ front matter.\n\n![Joe asks:](Images/joe.jpg)\n\nJoe asks:\n\nWhat’s the Difference Between summary and description in Front Matter?\n\nThe difference is mostly up to you. In some cases, they might be the same\ncontent. However, the description field is great for providing a description\nof the page optimized for search engines or social sharing, while the summary\nfield gives you a chance to create a short summary of the content you’ll\ndisplay on other parts of the site. As you’ll see later in this chapter, Hugo\ncan automatically generate a page’s summary, but the summary field in the\nfront matter overrides that, giving you more control.\n\nThe <title> element currently uses the title of the site and doesn’t\naccurately reflect the title of an individual page. This can be bad for search\nengine ranking, but it’s also bad from a usability standpoint. The value of\nthe <title> tag is what appears in the browser title or bookmark tab, as well\nas a bookmark someone creates.\n\nLet’s use the default site title on the home page, and use the more specific\npage title everywhere else. To do this, use an if statement with the built-in\n.Site.IsHome variable to check to see if you’re on the home page or not and\ndisplay the site title or the more specific page title. Modify the head\npartial and replace the existing <title> tag with this code:\n\n[working_with_data/portfolio/themes/basic/layouts/partials/head.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/partials/head.html)\n\n​ | <title>  \n---|---  \n​ | {{- if .Page.IsHome -}}  \n​ |  {{ .Site.Title }}  \n​ | {{- else -}}  \n​ |  {{ .Title }} – {{ .Site.Title }}  \n​ | {{- end -}}  \n​ | </title>  \n  \nNotice that this code appends the site title to the page title, which is a\ncommon practice when optimizing your site for search engines, as the page\ntitle shows up as the title in search results. With these changes in place,\nyour page’s data more accurately reflects the specific page.\n\nSometimes you might want to drive sections of your site from other data\nsources. Let’s look at how to do that.\n\n\n## Using Local Data Files\n\nThe data directory can hold structured data files in YAML, JSON, or TOML\nformats that you can use in your layouts to display content. You could write\nthese data files by hand or extract them from other sources.\n\nLet’s try this feature out and use it to add social media profile information\nto the contact page of the site. Instead of embedding your social media\naccounts in your layout directly, you’ll define them in a JSON file. Then in\nyour layout, you’ll load the file and iterate over its contents and display\nthe data.\n\nCreate the file socialmedia.json in the data directory of your site. In the\nnew file, create an accounts property with an array of accounts. In the array,\nrepresent each account as an object with a name and url property, like this:\n\n[working_with_data/portfolio/data/socialmedia.json](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/data/socialmedia.json)\n\n​ | { ​ _\"accounts\"_ ​ :  \n---|---  \n​ |  [  \n​ |  {  \n​ |  ​ _\"name\"_ ​: ​ _\"Twitter\"_ ​,  \n​ |  ​ _\"url\"_ ​: ​ _\"https://twitter.com/bphogan\"_ ​  \n​ |  },  \n​ |  {  \n​ |  ​ _\"name\"_ ​: ​ _\"LinkedIn\"_ ​,  \n​ |  ​ _\"url\"_ ​: ​ _\"https://linkedin.com/in/bphogan\"_ ​  \n​ |  }  \n​ |  ]  \n​ | }  \n  \nSave the file once you’ve entered in your accounts.\n\nTo use this data file, you must use a layout to read the file in and use it.\nContent pages can’t directly include dynamic content. In [​ _Using a Shortcode\nto Process Images_ ​](f_0060.xhtml#sec.shortcode.image), you’ll learn how to\nmake functions you can include in your content pages that can get dynamic\ncontent. For this example, you’ll make a specific layout for the contact page\nof the site, instead of relying on the default single.html layout.\n\nAdd this new layout to the site’s layouts directory, rather than as part of\nthe theme, since this is a specific customization. You can incorporate this\ninto the theme later if you find it useful. Create the file\nlayouts/_default/contact.html and add the following boilerplate to define the\nmain block and display the title and content:\n\n[working_with_data/portfolio/layouts/_default/contact.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/layouts/_default/contact.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ |  <h2>{{ .Title }}</h2>  \n​ |   \n​ |  {{ .Content }}  \n​ |   \n​ | {{ end }}  \n  \nThen, right below the {{ .Content }} line, add this code, which loads the data\nand iterates over it:\n\n[working_with_data/portfolio/layouts/_default/contact.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/layouts/_default/contact.html)\n\n​ | <h3>Social Media</h3>  \n---|---  \n​ | <ul>  \n​ |  {{ range .Site.Data.socialmedia.accounts }}  \n​ |  <li><a href=​ _\"{{ .url }}\"_ ​>{{ .name }}</a></li>  \n​ |  {{ end }}  \n​ | </ul>  \n  \nSave the file. The layout you created won’t override the default single page\nlayout because it’s not associated with a specific type of content. When you\ncreated a layout for projects, Hugo automatically associated the layout with\nall content within the projects folder. In this case, there’s no association\nlike that, so you have to explicitly assign the layout file to the contact.md\nMarkdown file. Open content/contact.md and specify the contact layout in the\npage’s front matter by adding the following code:\n\n[working_with_data/portfolio/content/contact.md](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/content/contact.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _Contact\"_ ​  \n​ | date: ​ _2020-01-01T12:55:44-05:00_ ​  \n​ | draft: false  \n»| layout: ​ _contact_ ​  \n​ | ​**\\---** ​  \n​ |   \n​ | This is my Contact page.  \n  \nSave the file, fire up the development server with hugo server, visit\nhttp://localhost:1313/contact in your browser. Your social media links are now\ndisplayed on the page:\n\n![images/data/contact.png](Images/contact.png)\n\nSometimes the data you want comes from an external site. Let’s look at how to\nhandle that.\n\n\n## Pulling Data from Remote Sources\n\nYou’re not limited to using local data. You can use Hugo to fetch remote data\nand process it every time you build the site.\n\nLet’s create a page of the site that shows your public GitHub repositories.\n\nTo get that data, you will use the GitHub API and then make a request to\nhttps://api.github.com/users/<your username>/repos. This returns a JSON\ncollection of all your repositories and doesn’t require any authorization.\n\nStore the API URL and your GitHub username in the site’s configuration file,\nrather than directly in the layout. Open config.toml and add two new fields to\nthe params section to hold these values:\n\n[working_with_data/portfolio/config.toml](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/config.toml)\n\n​ | ​**[params]** ​  \n---|---  \n​ |  author = ​ _\"Brian Hogan\"_ ​  \n​ |  description = ​ _\"My portfolio site\"_ ​  \n​ |   \n»|  gh_url = ​ _\"https://api.github.com/users\"_ ​  \n»|  gh_user = ​ _\"your-gh-user\"_ ​  \n  \nThen, create a layout for this file in\nthemes/basic/layouts/_default/opensource.html. Unlike the contact page you\ncreated, you’ll keep this with your theme. Add the usual boilerplate to the\nfile:\n\n[working_with_data/portfolio/themes/basic/layouts/_default/opensource.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/_default/opensource.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ |  <h2>{{ .Title }}</h2>  \n​ |   \n​ |  {{ .Content }}  \n​ | {{ end }}  \n  \nNext, right after the {{ .Content }} line, add the following line of code to\nbuild up the GitHub URL using your username from the site’s configuration:\n\n[working_with_data/portfolio/themes/basic/layouts/_default/opensource.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/_default/opensource.html)\n\n​ | {{ $url := printf \"%s/%s/repos\" .Site.Params.gh_url .Site.Params.gh_user }}  \n---|---  \n  \nThis defines a $url variable and uses Go’s printf function to concatenate the\nbase URL, your username, and the /repos endpoint. Note that you have to use\n.Site.Params as a prefix on both of these, as you stored them in the site’s\nconfiguration.\n\nNow, add this line to make the request for the JSON file using the $url\nvariable you built:\n\n[working_with_data/portfolio/themes/basic/layouts/_default/opensource.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/_default/opensource.html)\n\n​ | {{ $repos := getJSON $url }}  \n---|---  \n  \nThis makes the request and fetches the JSON data into a collection that works\nlike the other collections you’ve used. From here, you can use the range\nfunction and iterate over the results. Each result has a name, url, html_url,\nand description property, so use those to build a list of your repositories,\nlike this:\n\n[working_with_data/portfolio/themes/basic/layouts/_default/opensource.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/_default/opensource.html)\n\n​ | <section class=​ _\"oss\"_ ​>  \n---|---  \n​ |  {{ range $repos }}  \n​ |  <article>  \n​ |  <h3><a href=​ _\"{{ .html_url }}\"_ ​>{{ .name }}</a></h3>  \n​ |  <p>{{ .description }}</p>  \n​ |  </article>  \n​ |  {{ end }}  \n​ | </section>  \n  \nThe html_url property points to the URL of the repository, while the url\nproperty points to the API endpoint, which you could use if you wanted to\nfetch even more details about each project.\n\nEvery time you rebuild the site, Hugo will make a request to the GitHub API\nand pull in this data. Since the data about your repositories doesn’t change\nthat often, this level of caching is perfect. However, if you don’t want to\nhit the API every time you build, you can download the JSON data, store it in\nyour data directory, and load it in like you did with your social media links\non the contact. If you take this approach, remember to refresh your local file\nperiodically.\n\nNext, create a new content page for your site called opensource.md which will\nuse this layout. Stop the development server and use the hugo new command to\ncreate this file:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**opensource.md** ​  \n---|---  \n  \nOpen the newly created content/opensource.md file in your editor. Ensure the\ndraft status is false, set the title to “Open Source Software”, and ensure it\nuses the opensource layout. Below the front matter, add a paragraph of content\nthat introduces the page content. Your completed file should look like this:\n\n[working_with_data/portfolio/content/opensource.md](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/content/opensource.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _Open_ ​ ​ _Source_ ​ ​ _Software\"_ ​  \n​ | date: ​ _2020-01-01T13:35:47-05:00_ ​  \n​ | draft: false  \n​ | layout: ​ _opensource_ ​  \n​ | ​**\\---** ​  \n​ |   \n​ | My Open Source Software on GitHub:  \n  \nLet’s add some CSS to transform the list into a series of tiles. Open\nthemes/basic/static/css/style.css and add the following code:\n\n[working_with_data/portfolio/themes/basic/static/css/style.css](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/static/css/style.css)\n\n​ | .oss {  \n---|---  \n​ |  display: flex;  \n​ |  flex-wrap: wrap;  \n​ |  justify-content: space-between;  \n​ | }  \n​ |   \n​ | .oss article {  \n​ |  border: 1px solid #ddd;  \n​ |  box-shadow: 3px 3px 3px #ddd;  \n​ |  margin: 0.5%;  \n​ |  padding: 0.5%;  \n​ |  width: 30%;  \n​ | }  \n  \nFlexbox once again comes to the rescue. The oss container becomes the flex\ncontainer and specifies that child elements should wrap and be spaced out\nequally. The inner article elements get a width, margin, a border and a small\ndrop shadow. The result is a series of tiles nicely spaced apart.\n\nEnsure all of your files are saved and start up the development server with\nhugo server. Visit http://localhost:1313/opensource and you’ll see your\nprojects displayed as tiles as shown in the screenshot.\n\n![images/data/oss.png](Images/oss.png)\n\nNow, whenever you create a new project on GitHub, it’ll show up when you\nregenerate the site.\n\n![Joe asks:](Images/joe.jpg)\n\nJoe asks:\n\nHow Would I Generate Content Pages from Data?\n\nHugo is a static site generator that converts existing content documents into\nweb pages. It doesn’t have any built-in ability to generate content pages from\ndata, but you can still make it work.\n\nFor example, you could write a small script that reads the data and generates\nMarkdown documents, which it stores in the content folder. Then, when you run\nhugo to build the site, the generated pages will be included.\n\nHugo’s developers want Hugo to stay focused on fast website generation. As a\nresult, you’ll often find that you’ll rely on tools outside of Hugo for more\ncomplex situations.\n\nBefore moving on, add the link to your open source projects page to your\nproject list page. Open themes/basic/layouts/projects/list.html and add the\nlink on the page like this, along with its summary:\n\n[working_with_data/portfolio/themes/basic/layouts/projects/list.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/projects/list.html)\n\n​ | <section class=​ _\"projects\"_ ​>  \n---|---  \n»|  <section class=​ _\"project\"_ ​>  \n»|  {{ with .Site.GetPage \"/opensource.md\" }}  \n»|  <h3><a href=​ _\"{{ .RelPermalink }}\"_ ​>{{ .Title }}</a></h3>  \n»|  <p>{{ .Summary }}</p>  \n»|  {{ end }}  \n»|  </section>  \n  \nInstead of using a hard-coded link, you’re grabbing the title and URL from the\npage using Hugo’s GetPage function, which takes the path to the Markdown file.\nUsing this method, you can pull data from any page into your layouts.\n\nThe front matter for the open source page doesn’t have a summary field, so\nyou’re probably wondering where the summary will come from. Hugo gets it by\nreading in the first few sentences of the content for that page. You’ll take\nmore control of auto-generated summaries in Chapter 5, [​ _Adding a Blog_\n​](f_0042.xhtml#chp.blog).\n\nVisit http://localhost:1313/projects to see your open source projects\ndisplayed above the other projects:\n\n![images/data/projects_page_with_oss.png](Images/projects_page_with_oss.png)\n\nSo far you’ve used Hugo to generate HTML pages, but you can also generate\nother formats too.\n\n\n## Syndicating Content with RSS\n\nHugo creates RSS feeds for your site automatically using a built-in RSS 2.0\ntemplate. If you visit http://localhost:1313/index.xml, you’ll find a pre-\nbuilt RSS feed that includes all of your pages and looks something like this:\n\n​ | ​ _<?xml version=\"1.0\" encoding=\"utf-8\" standalone=\"yes\" ?>_​  \n---|---  \n​ | <rss version=​ _\"2.0\"_ ​ xmlns:atom=​ _\"http://www.w3.org/2005/Atom\"_ ​>  \n​ |  <channel>  \n​ |  <title>Brian&#39;s Portfolio</title>  \n​ |  <link>http://localhost:1313/</link>  \n​ |  <description>Recent content on Brian&#39;s Portfolio</description>  \n​ |  <generator>Hugo -- gohugo.io</generator>  \n​ |  <language>en-us</language>  \n​ |  <lastBuildDate>Thu, 02 Jan 2020 12:45:51 -0600</lastBuildDate>  \n​ |   \n​ |  <atom:link href=​ _\"http://localhost:1313/index.xml\"_ ​ rel=​ _\"self\"_ ​  \n​ |  type=​ _\"application/rss+xml\"_ ​ />  \n​ |   \n​ |  <item>  \n​ |  <title>Open Source Software</title>  \n​ |  <link>http://localhost:1313/opensource/</link>  \n​ |  <pubDate>Thu, 02 Jan 2020 12:42:17 -0500</pubDate>  \n​ |   \n​ |  <guid>http://localhost:1313/opensource/</guid>  \n​ |  <description>My Open Source Software:</description>  \n​ |  </item>  \n​ | ...  \n​ |   \n​ |  </channel>  \n​ | </rss>  \n  \nHugo generates RSS feeds for your sections too. Your projects have their own\nfeed at http://localhost:1313/projects/index.xml.\n\nPeople won’t know there’s a feed for your site unless you tell them about it.\nTo make your feed discoverable, you can add a meta tag to your site’s header\nthat looks like this:\n\n​ | <link rel=​ _\"alternate\"_ ​ type=​ _\"application/rss+xml\"_ ​  \n---|---  \n​ | href=​ _\"http://example.com/feed\"_ ​ >  \n  \nRSS readers and other tools can use this tag to identify the RSS feed\nautomatically.\n\nAdd this code to your themes/basic/layouts/partials/head.html file to add\nlinks to any alternative formats associated with your page:\n\n[working_with_data/portfolio/themes/basic/layouts/partials/head.html](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/partials/head.html)\n\n​ | {{ range .AlternativeOutputFormats -}}  \n---|---  \n​ |  {{- $link := `<link rel=​ _\"%s\"_ ​ type=​ _\"%s\"_ ​ href=​ _\"%s\"_ ​ title=​ _\"%s\"_ ​>` -}}  \n​ |  {{- $title := printf \"%s - %s\" $.Page.Title $.Site.Title -}}  \n​ |   \n​ |  {{- if $.Page.IsHome -}}  \n​ |  {{ $title = $.Site.Title }}  \n​ |  {{- end -}}  \n​ |   \n​ |  {{ printf $link .Rel .MediaType.Type .Permalink $title | safeHTML }}  \n​ | {{- end }}  \n  \nThis iterates over all of the alternative formats associated with the current\npage. Right now there’s only one, but you may add more in the future. Each\ncontent has a type attribute. Hugo will attempt to escape special characters\nwhen you print values using the {{ }} notation. One of those values is the\nplus sign in application/rss+xml, the value associated with RSS feeds.\n\nTo avoid escaping special characters, use the printf function to inject the\nvalues. Note the backticks around the value for the $link variable. By using\nthe backticks, you don’t need to escape the double-quotes for the HTML\nattributes.\n\nThe title attribute should reflect the title of the page, so you detect if\nthis is the home page or not, and assign the proper title to the $title\nvariable. This is similar to how you set the value for the <title> tag.\nHowever, since the range function is operating on the collection of\nalternative formats, the current scope is limited to values in that\ncollection. Prefixing the scope with a dollar sign tells Hugo that you’re\nlooking for values in the global scope rather than in the current local scope.\nThat is why you use $.Page.isHome here instead of .Page.isHome.\n\nThe final printf statement creates the <link> tag. The safeHTML at the end\nensures the HTML snippet itself isn’t escaped. Be careful with safeHTML; only\nuse it with HTML snippets you create, and use it sparingly. Never use it on\nsnippets you don’t trust.\n\nWhen you visit http://localhost:1313/ in your browser and look at its source,\nyou’ll see the RSS link generated:\n\n​ | <link rel=​ _\"alternate\"_ ​ type=​ _\"application/rss+xml\"_ ​  \n---|---  \n​ | href=​ _\"http://localhost:1313/index.xml\"_ ​ title=​ _\"Brian's Portfolio\"_ ​>  \n  \nSince this link to the feed is generated using the .Permalink function, Hugo\nwill use the value of the baseURL field in the config.toml file when you build\nthe site. When it comes time to deploy the site, you’ll specify that value so\neverything works properly.\n\nIf you visit http://localhost:1313/projects/, you’ll see the link for that\npage as well:\n\n​ | <link rel=​ _\"alternate\"_ ​ type=​ _\"application/rss+xml\"_ ​  \n---|---  \n​ | href=​ _\"http://localhost:1313/projects/index.xml\"_ ​  \n​ | title=​ _\"Projects - Brian's Portfolio\"_ ​>  \n  \nHugo can support many output formats. Let’s use Hugo to generate a JSON file\nthat lists your projects.\n\n\n## Rendering Content as JSON\n\nHugo supports JSON output out of the box too, which means you can use Hugo to\ncreate a JSON API that you can consume from other applications. Unlike RSS\nfeeds, you need to create a layout for your JSON output, and you must specify\nwhich pages of your site should use this output type.\n\nTo explore this, you’ll make a JSON list of your project pages containing the\ntitle and URL for each project page, which you can then consume from other\napplications. The resulting file will look like this:\n\n​ | {  \n---|---  \n​ |  ​ _\"projects\"_ ​: [  \n​ |  {  \n​ |  ​ _\"url\"_ ​: ​ _\"http://example.org/projects/awesomeco/\"_ ​,  \n​ |  ​ _\"title\"_ ​: ​ _\"Awesomeco\"_ ​,  \n​ |  },  \n​ |  {  \n​ |  ​ _\"url\"_ ​: ​ _\"http://example.org/projects/jabberwocky/\"_ ​,  \n​ |  ​ _\"title\"_ ​: ​ _\"Jabberwocky\"_ ​,  \n​ |  }  \n​ |  ]  \n​ | }  \n  \nFirst, create a JSON template file at themes/basic/layouts/projects/list.json.\n\nIn the new template file, create a JSON template that iterates through your\nproject pages and displays them:\n\n[working_with_data/portfolio/themes/basic/layouts/projects/list.json](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/themes/basic/layouts/projects/list.json)\n\n​ | {  \n---|---  \n​ |  ​ _\"projects\"_ ​: [  \n​ |  {{​**-** ​ ​**range** ​ ​**$index** ​, ​**$page** ​ :​**=** ​ ​**(where** ​ ​**.Site.RegularPages** ​ ​ _\"Type\"_ ​ ​ _\"in\"_ ​ ​ _\"projects\"_ ​​**)** ​ }}  \n​ |  {{​**-** ​ ​**if** ​ ​**$index** ​ ​**-** ​}} , {{​**-** ​ ​**end** ​ }}  \n​ |  {  \n​ |  ​ _\"url\"_ ​: {{ ​**.Permalink** ​ ​**|** ​ ​**jsonify** ​ }},  \n​ |  ​ _\"title\"_ ​: {{ ​**.Title** ​ ​**|** ​ ​**jsonify** ​ }}  \n​ |  }  \n​ |  {{​**-** ​ ​**end** ​ }}  \n​ |  ]  \n​ | }  \n  \nEntries in a JSON array need a comma between each entry, but they don’t need a\ncomma after the last entry. By using an index as you iterate through the\nentries, you can insert the comma in front of the current entry. Note that\nyou’re using the {{- form for the templates, which suppresses whitespace in\nthe output, depending on where the dash is located. Remember from [​ _Using\nContent Blocks and Partials_ ​](f_0020.xhtml#sec.content.blocks.partials),\nthat adding the dash after the opening braces suppresses whitespace characters\nin front of the output, while adding a dash in front of the closing braces\nsuppresses whitespace that follows. Suppressing whitespace like this will\nresult in JSON that’s more readable by humans.\n\nHugo won’t generate the JSON file until you configure it to do so. You can\nconfigure output formats in the main configuration file, but you can only\nspecify that for the home page, all sections, and all content pages. To apply\nthe output to a specific section of the site, you specify it in the front\nmatter of the section’s page.\n\nIn this case, the output formats need to be specified in the project list\ncontent page. Edit the file content/projects/_index.md and add the following\nfront matter to tell Hugo to generate a JSON file in addition to the HTML and\nXML files it generates by default:\n\n[working_with_data/portfolio/content/projects/_index.md](http://media.pragprog.com/titles/bhhugo/code/working_with_data/portfolio/content/projects/_index.md)\n\n​ | description: A list of Brian's projects.  \n---|---  \n»| outputs:  \n»| \\- HTML  \n»| \\- JSON  \n»| \\- RSS  \n  \nSave the file and then run hugo server. Visit\nhttp://localhost:1313/projects/index.json and you’ll see your file.\n\nYou might be thinking that the URL is a little ugly, and you’d like to change\nit to /projects.json instead. The url field in a page’s front matter lets you\nchange the URL for a page, like this:\n\n​ | url: ​ _/projects.json_ ​  \n---|---  \n  \nUnfortunately, if you add that line to the content/projects/_index.md file,\nHugo will no longer render the HTML page. Hugo doesn’t have a way to handle\ndifferent URLs for different types. If you wanted to change the URL for your\nproject feed, you have two options.\n\nThe first option is to configure your web server to rewrite the URL. The\nsecond (and much easier) option is to move the file before you upload it to\nyour server. In other words, move projects/index.json to projects.json. You\ncould do this as part of a larger build and deploy process like the one you’ll\ncreate in [​ _Using Webpack and npm with Hugo_\n​](f_0062.xhtml#sec.webpack.node).\n\nOne last thing: if you visit http://localhost:1313/projects/ and look at its\nsource, you’ll see a <link> tag for your JSON feed next to your RSS feed. The\nloop you created to display your RSS feed iterates through all of the\nalternative formats for a page, so this JSON feed gets included.\n\n\n## Your Turn\n\nBefore moving on, see if you can complete these challenges:\n\n  1. Add keywords to the front matter of your home page and content pages, and add a <meta name=\"keywords\"> tag to your site’s heading.\n\n  2. Change the footer so it uses the author name in the site’s configuration file in the copyright notice.\n\n  3. Incorporate the social media links into your site’s footer. Include the code in a partial.\n\n  4. Download your repository data to a local JSON file and modify the template to read that local file instead. Once you have it working, revert the change so the data is pulled directly from GitHub again.\n\n  5. Dive deeper into how whitespace suppression works in Hugo templates by adding and removing dashes in your list.json template. Make a change and then review the source of the file in the browser. Notice how changing {{ to {{- or }} to -}} affects how the JSON is formatted.\n\n  6. Add additional fields to the JSON file for your project feed.\n\n\n## Wrapping Up\n\nYou’ve integrated some JSON data into your site. You’ve got social media links\ncoming from a local file, and you’ve loaded your GitHub repositories from\nGitHub’s public-facing API. In addition, you used data from the configuration\nfile and individual front matter sections throughout your site. Combined with\nwhat you’ve learned in previous chapters, you have all the tools to add a blog\nto your personal site, which you’ll do next.\n\n#### Footnotes\n\n[[16]](f_0033.xhtml#FNPTR-16)\n\n    \n\n<https://analytics.google.com/>\n\n[[17]](f_0033.xhtml#FNPTR-17)\n\n    \n\n<https://www.cookiepro.com/knowledge/google-analytics-and-gdpr/>\n\n[[18]](f_0034.xhtml#FNPTR-18)\n\n    \n\n<https://gohugo.io/content-management/front-matter/#predefined>\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  Chapter 5  \nAdding a Blog\n\nWhen you want to share your thoughts with the world, using your own site is\none of the best ways to do it. While there are platforms you can use to do\nthis, choosing to instead host from your own domain offers certain benefits.\nYou can measure its effects, control how the information is presented, and\nmore importantly, build your own brand with content you own. When you publish\ncontent elsewhere, you have to opt in to their terms of service, and sometimes\nhand over control over your content and community.\n\nTo simplify the process of hosting your own content, you can use Hugo to add a\nblog to your site. To create a blog in Hugo, you’ll create a new content type,\nnamed “Post”, and you’ll create layouts to support displaying those posts. A\nlot of what you’ll do in this chapter will build on what you’ve done\npreviously, but you’ll apply it in new ways. In addition to creating the\ncontent type, you’ll incorporate a third-party commenting system into your\nstatic site, and you’ll implement pagination so you can support future content\ngrowth.\n\nA post on a blog has a title, an author, and some content. It might have a\nsummary as well. You might want to put your posts into categories and tag\nthem. You can manage most of this from the front matter of each piece of\ncontent much like you did with projects.\n\nStart by creating an archetype for a post so you have a blueprint to follow.\nCreate the file archetypes/posts.md by copying the default archetype file:\n\n[blog/portfolio/archetypes/posts.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/archetypes/posts.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _{{_ ​ ​ _replace_ ​ ​ _.Name_ ​ ​ _\"-\" \" \" | title }}\"_ ​  \n​ | date: {{ .Date }}  \n​ | draft: false  \n​ | ​**\\---** ​  \n  \nThen, add an author field and add your name:\n\n[blog/portfolio/archetypes/posts.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/archetypes/posts.md)\n\n​ | author: Brian Hogan  \n---|---  \n  \nNext, add some default content to this file. Any placeholder text will do,\nlike Lorem Ipsum:[[19]](f_0051.xhtml#FOOTNOTE-19)\n\n[blog/portfolio/archetypes/posts.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/archetypes/posts.md)\n\n​ | Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod  \n---|---  \n​ | tempor incididunt ut labore et dolore magna aliqua.  \n​ |   \n​ | ​ _<!--more-->_​  \n​ |   \n​ | Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut  \n​ | aliquip ex ea commodo consequat.  \n  \nThe <!--more--> line lets you specify where the content summary ends. As you\nlearned in [​ _Pulling Data from Remote Sources_\n​](f_0037.xhtml#sec.data.remote.sources), when you use {{ .Summary }} in a\nlayout, Hugo will pull the summary from the front matter or by generating it\nfrom the content. Sometimes that auto-generated summary ends in an awkward\nplace. To control where the summary should end, add <!--more--> to the\ncontent.\n\nSave the archetype and use it to generate an initial post to test things out:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**posts/first-post.md** ​  \n---|---  \n​ | /Users/brianhogan/portfolio/content/posts/first-post.md created  \n  \nVisit http://localhost:1313/posts/ and you’ll see your post listed. This list\nis generated using the default list layout, which you’ll customize later.\nLet’s flesh out the layout for an individual post.\n\n\n## Creating the Post’s Layout\n\nThe page for an individual post is bare because it’s using the default single\npage layout. Like with project pages, there’s information in each post’s front\nmatter you can use on the page. To do that, create a new single page layout\nfor posts.\n\nCreate the directory themes/basic/layouts/posts/ to hold the layout. You can\nuse your editor or use the following command in your terminal:\n\n​ | ​$ ​​**mkdir** ​​**** ​​**themes/basic/layouts/posts** ​  \n---|---  \n  \nThen create the file themes/basic/layouts/posts/single.html, which will hold\nthe layout for an individual post.\n\nCreate the main content block and place the title and post content in their\nown sectioning elements with classes; this will help you style them later:\n\n[blog/portfolio/themes/basic/layouts/posts/single.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/posts/single.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ | <article class=​ _\"post\"_ ​>  \n​ |  <header>  \n​ |  <h2>{{ .Title }}</h2>  \n​ |  </header>  \n​ |   \n​ |  <section class=​ _\"body\"_ ​>  \n​ |  {{ .Content }}  \n​ |  </section>  \n​ |   \n​ | </article>  \n​ | {{ end }}  \n  \nWithin the header section, add the byline, which will contain the publication\ndate and author name. The .Date field will fetch the date, and the .Format\nfunction will let you format it in a similar fashion to how you formatted the\ndate in the footer.\n\n[blog/portfolio/themes/basic/layouts/posts/single.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/posts/single.html)\n\n​ |  <header>  \n---|---  \n​ |  <h2>{{ .Title }}</h2>  \n»|  <p>  \n»|  By {{ .Params.Author }}  \n»|  </p>  \n»|  <p>  \n»|  Posted {{ .Date.Format \"January 2, 2006\" }}  \n»|  </p>  \n  \nMany blogs will display the amount of time it takes to read the content at the\ntop of an article. Let’s add that to our blog page template.\n\nThe average person reads anywhere from 200 to 250 words per\nminute[[20]](f_0051.xhtml#FOOTNOTE-20) depending on several factors. If you\ncount the number of words in a page’s content and divide it by 200, you’ll get\na conservative estimate of the number of minutes it’ll take to read your\ncontent.\n\nHugo has built-in functions for counting words and doing math, so in your\ntemplate, add the following code to your byline to determine and display the\nreading time:\n\n[blog/portfolio/themes/basic/layouts/posts/single.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/posts/single.html)\n\n​ |  <p>  \n---|---  \n​ |  Posted {{ .Date.Format \"January 2, 2006\" }}  \n​ |  </p>  \n»|  <p>  \n»|  Reading time: {{ math.Round (div (countwords .Content) 200.0) }} minutes.  \n»|  </p>  \n  \nTo make sure this works, add a significant amount of content to your first\nblog post so there’s some text to count.\n\nSave the file and visit http://localhost:1313/posts/first-post.md. The author,\ndate, and reading time display above the post:\n\n![images/blog/byline.png](Images/byline.png)\n\nAs you build out more content, you’ll probably want to organize and group it\nso it’s easier for people to find.\n\n![Joe asks:](Images/joe.jpg)\n\nJoe asks:\n\nDoes Hugo Support Syntax Highlighting for Code?\n\nIf you’re publishing posts, you might want to include snippets of code from\ntime to time. Hugo supports syntax highlighting using a library named\nChroma,[[21]](f_0051.xhtml#FOOTNOTE-21) which is compatible with the popular\nPygments[[22]](f_0051.xhtml#FOOTNOTE-22) syntax highlighter.\n\nTo configure this, tell Hugo you want it to use Pygments-style classes when it\nhighlights your code. Add this line to config.toml:\n\n​ | pygmentsUseClasses = ​**true** ​  \n---|---  \n  \nThen, generate a stylesheet to highlight your code using one of the available\nChroma styles:[[23]](f_0051.xhtml#FOOTNOTE-23)\n\n​ | ​$ ​​**hugo** ​​**** ​​**gen** ​​**** ​​**chromastyles** ​​**** ​​**\\--style=github** ​​**** ​​**& gt;**​​**** ​​**syntax.css** ​  \n---|---  \n  \nAdd the syntax.css style to your head.html partial.\n\nNow, when you write your posts, use code fences and specify the appropriate\nlanguage:\n\n​ | ​ _```javascript_ ​  \n---|---  \n​ | ​ _let x = 25;_ ​  \n​ | ​ _let y = 30;_ ​  \n​ | ​ _```_ ​  \n  \nHugo will apply the styles to your code.\n\n\n## Organizing Content with Taxonomies\n\nMany blogs and content systems let you place your posts in categories and\napply tags to your posts. This logical grouping of content is known as a\ntaxonomy. Hugo supports categories and tags out of the box and can generate\ncategory and tag list pages automatically. All you have to do is add\ncategories and tags to your front matter.\n\nOpen the posts archetype at archetypes/post.md and add some default categories\nand tags:\n\n[blog/portfolio/archetypes/posts.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/archetypes/posts.md)\n\n​ | categories:  \n---|---  \n​ | \\- Personal  \n​ | \\- Thoughts  \n​ | tags:  \n​ | \\- software  \n​ | \\- html  \n  \nAdding these defaults to the archetype won’t affect the content you’ve already\ncreated, so open content/posts/first-post.md and add categories and tags there\ntoo:\n\n[blog/portfolio/content/posts/first-\npost.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/content/posts/first-\npost.md)\n\n​ | categories:  \n---|---  \n​ | \\- Personal  \n​ | \\- Thoughts  \n​ | tags:  \n​ | \\- software  \n​ | \\- html  \n  \nBoth categories and tags are lists of items, so you need to use the correct\nnotation in YAML. Hugo supports TOML and JSON front matter as well, so you\ncould use those for your posts instead if you find those easier to manage.\n\nBy adding the tags and categories to your post, Hugo will generate pages for\nthose using your default list layout. Visit http://localhost:1313/tags to see\nthe tags list:\n\n![images/blog/tags.png](Images/tags.png)\n\nSelecting a tag shows you a list of all of the pieces of content associated\nwith that tag.\n\nVisit https://localhost:1313/categories to see the list of categories:\n\n![images/blog/categories.png](Images/categories.png)\n\nWhen you visit https://localhost:1313/tags, you’re looking at what Hugo calls\n“taxonomy terms.” When you look at a specific tag, that’s what Hugo calls a\n“taxonomy.” This becomes important when you’d like to customize the layouts\nfor these pages. Let’s alter the tags list so it shows the count of items\nassociated with each tag in addition to the tag.\n\nTo customize the page that displays the list of all of your tags, create a new\nlayout named tag.terms.html. Place it in themes/basic/layouts/_default/.\n\nIn the new file, add the usual layout boilerplate, including the title and the\n{{. Content }} pieces. Instead of iterating over the related pages like you\nhave done in previous list templates, iterate over all of the tags for the\nsite with .Data.Terms. This will give you access to the number of content\npages associated with each tag:\n\n[blog/portfolio/themes/basic/layouts/_default/tag.terms.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/_default/tag.terms.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ |   \n​ |  <h2>{{ .Title }}</h2>  \n​ |   \n​ |  {{ .Content }}  \n​ |   \n​ |  {{ range .Data.Terms.Alphabetical }}  \n​ |  <p class=​ _\"tag\"_ ​>  \n​ |  <a href=​ _\"{{ .Page.Permalink }}\"_ ​>{{ .Page.Title }}</a>  \n​ |  <span class=​ _\"count\"_ ​>({{ .Count }})</span>  \n​ |  </p>  \n​ |  {{ end }}  \n​ |   \n​ | {{ end }}  \n  \nYou’ve included {{. Content }} in the layout. When you’re looking at the /tags\nsection of the site, Hugo will look in content/tags/_index.md for that\ncontent. Create the _index.md file now using:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**tags/_index.md** ​  \n---|---  \n​ | /Users/brianhogan/portfolio/content/tags/_index.md created  \n  \nOpen the file in your editor and add some content:\n\n[blog/portfolio/content/tags/_index.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/content/tags/_index.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _Tags\"_ ​  \n​ | date: ​ _2020-01-01T15:17:39-05:00_ ​  \n​ | draft: false  \n​ | ​**\\---** ​  \n​ |   \n​ | These are the site's tags:  \n  \nNow, visit http://localnost:1313/tags and you’ll see your tag list with counts\nand the associated content:\n\n![images/blog/taglist.png](Images/taglist.png)\n\nWhen you select a tag, Hugo looks for a layout associated with tags. If you\nwant to customize this layout, create a layout named tags.html in the\ntheme/basic/layouts/_default folder and use the same logic you use in your\nexisting list layout to pull in the content. When you’re displaying content\nfor a specific tag, you’re not interested in the collection of tags; you’re\ninterested in the pages associated with the tag.\n\nBefore moving on, add the list of tags to the post’s single layout. Open\nthemes/basic/layouts/posts/single.html.\n\nTo display the tags, iterate over the tags in the front matter using\n.Params.tags and the range function:\n\n[blog/portfolio/themes/basic/layouts/posts/single.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/posts/single.html)\n\n​ |  <p>  \n---|---  \n​ |  By {{ .Params.Author }}  \n​ |  </p>  \n​ |  <p>  \n​ |  Posted {{ .Date.Format \"January 2, 2006\" }}  \n»|  <span class=​ _\"tags\"_ ​>  \n»|  in  \n»|  {{ range .Params.tags }}  \n»|  <a class=​ _\"tag\"_ ​ href=​ _\"/tags/{{ . | urlize }}\"_ ​>{{ . }}</a>  \n»|  {{ end }}  \n»|  </span>  \n​ |  </p>  \n  \nThe tags listing page is located at /tags, and each tag itself is located at\n/tags/tag-name. As you iterate over each tag, you can construct the link to\neach tag by appending the tag name to /tags/. However, since tags might\ncontain spaces or other characters, use the urlize function to encode the tag\nas a URL-safe string.\n\nEach link in the tag list has a class of tag so you can more easily style the\nentries in the list. Open themes/basic/static/css/style.css and add the\nfollowing CSS to change each tag into a gray button:\n\n[blog/portfolio/themes/basic/static/css/style.css](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/static/css/style.css)\n\n​ | a.tag {  \n---|---  \n​ |  background-color: #ddd;  \n​ |  color: #333;  \n​ |  display: inline-block;  \n​ |  padding: 0.1em;  \n​ |  font-size: 0.9em;  \n​ |  text-decoration: none;  \n​ | }  \n  \nWhen you add padding to each tag so that the background color doesn’t touch\nthe words, the boxes will become larger, so you can decrease the font size to\nmake up the difference.\n\nVisit http://localhost:1313/posts/first-post to see the updated byline with\nthe tag list:\n\n![images/blog/post_tag_list.png](Images/post_tag_list.png)\n\nDisabling Taxonomies\n\nBy default, Hugo generates category and tag pages for you. But if you have no\ninterest in tags, you can configure your site to ignore then. In your\nconfig.toml file, add the following code:\n\n​ | ​**[taxonomies]** ​  \n---|---  \n​ |  category = ​ _\"categories\"_ ​  \n  \nBy doing this, you’re redefining the taxonomies to exclude tags. If you wanted\ntags but not categories, you’d add this code instead:\n\n​ | ​**[taxonomies]** ​  \n---|---  \n​ |  tag = ​ _\"tags\"_ ​  \n  \nIf you don’t want Hugo to use any kind of taxonomy, you can disable it\nentirely by adding this option to the configuration instead:\n\n​ | disableKinds = [​ _\"taxonomy\"_ ​, ​ _\"taxonomyTerm\"_ ​]  \n---|---  \n  \nThis removes all support for taxonomies on your site, so take care with this\noption.\n\nYour individual post page looks good, and you’ve got tags and categories\nconfigured. Now let’s look at customizing the URLs for your posts.\n\n\n## Customizing the URL for Posts\n\nBy default, your blog contents show up under posts/. For example, your first\nblog post is available at http://localhost:1313/posts/first-post. Many blogs\nuse the year/month/title format for their blog post URLs. This meaningful URL\nshows anyone looking at the URL how old the post might be, but it also shows\nthat the content is organized by date. In sites with content organized like\nthis, a visitor could see content for the rest of the month, or for the whole\nyear, by specifying the year or month.\n\nA permalink is a permanent link to a specific page, often used when sharing a\npage with others through social media, newsletters, or even search results.\nYou can use front matter on a post to control the permalink for a post by\nusing the url field, but that’s really only meant to handle situations where\nyou’re migrating content or need to do some one-off customization. Hugo lets\nyou define how you’d like to structure your links in its configuration file.\n\nIn config.toml, add a new Permalinks section and define a new rule that makes\nposts available under /posts/year/month/slug:\n\n[blog/portfolio/config.toml](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/config.toml)\n\n​ | ​**[permalinks]** ​  \n---|---  \n​ |  posts = ​ _\"posts/:year/:month/:slug/\"_ ​  \n  \nThis gives you URLs like /posts/2020/01/first_post. The slug is the end part\nof the URL that identifies the page’s content. It’s generated from the page\ntitle by default, but you can define your own slug by adding a slug field to\nyour page’s front matter section.\n\nIf you visit /posts/2020, you might expect to find a list of all posts for\nthat year. Unfortunately, Hugo doesn’t support generating these pages\ncurrently, at least not without a little extra work.\n\nHowever, one of Hugo’s maintainers offered a practical\nworkaround.[[24]](f_0051.xhtml#FOOTNOTE-24) By using Hugo’s taxonomy feature\nand a little clever use of front matter, you can generate archive pages of\nposts for years and months. You’re going to add “year” and “month” as new\ntaxonomies, and “tag” your posts with a year and month. Hugo can then build\nthe year and month pages for you just like it builds pages for categories and\ntags. You’ll use this approach with some minor tweaks to build out your pages.\n\nFirst, add year and month fields to your content’s front matter. For the year,\nuse the four digit year. For the month, use the four digit year, a forward\nslash, and the two digit month. For example, for a post written in January of\n2020, you’d add these fields:\n\n​ | year: ​ _\"_ ​​ _2020\"_ ​  \n---|---  \n​ | month: ​ _\"_ ​​ _2020/01\"_ ​  \n  \nOpen content/posts/first-post.md and add the year and month fields:\n\n[blog/portfolio/content/posts/first-\npost.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/content/posts/first-\npost.md)\n\n​ | title: \"First Post\"  \n---|---  \n​ | date: 2020-01-01T14:17:39-05:00  \n​ | draft: false  \n​ | author: Brian Hogan  \n»| year: \"2020\"  \n»| month: \"2020/01\"  \n  \nAdding these fields every time you create new content on your blog is going to\nget old pretty quickly, and it feels redundant. You can generate these in your\nposts.md archetype. It’s already getting the date, so create these fields in\nthe archetype and extract the month and year:\n\n[blog/portfolio/archetypes/posts.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/archetypes/posts.md)\n\n​ | year: \"{{ dateFormat \"2006\" .Date }}\"  \n---|---  \n​ | month: \"{{ dateFormat \"2006/01\" .Date }}\"  \n  \nThe dateFormat function uses Hugo’s date formatting strings and applies them\nto the given date. Now when you generate new pages for your site, the month\nand year front matter will be created. Create a new post for your site to\nverify that these front matter changes work:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**posts/second-post.md** ​  \n---|---  \n​ | /Users/brianhogan/portfolio/content/posts/second-post.md created  \n  \nOpen content/posts/second-post.md to verify that the month and year is set:\n\n[blog/portfolio/content/posts/second-\npost.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/content/posts/second-\npost.md)\n\n​ | \\---  \n---|---  \n​ | title: \"Second Post\"  \n​ | date: 2020-01-01T14:25:39-05:00  \n​ | draft: false  \n»| year: \"2020\"  \n»| month: \"2020/09\"  \n​ | author: Brian Hogan  \n  \nNext, open your site’s configuration file and define permalinks for the year\nand month pages. Add this code:\n\n[blog/portfolio/config.toml](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/config.toml)\n\n​ | ​**[permalinks]** ​  \n---|---  \n​ |  posts = ​ _\"posts/:year/:month/:slug/\"_ ​  \n»|  year = ​ _\"/posts/:slug/\"_ ​  \n»|  month = ​ _\"/posts/:slug/\"_ ​  \n  \nFinally, to generate the archive lists, define the year and month data as new\ntaxonomies. To do this, add a taxonomies section to the configuration file,\nlike this:\n\n[blog/portfolio/config.toml](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/config.toml)\n\n​ | ​**[taxonomies]** ​  \n---|---  \n​ |  year = ​ _\"year\"_ ​  \n​ |  month = ​ _\"month\"_ ​  \n​ |  tag = ​ _\"tags\"_ ​  \n​ |  category = ​ _\"categories\"_ ​  \n  \nWhen you define a taxonomies section in your configuration, it replaces the\ndefaults. To keep support for tags and categories, you have to explicitly\ndefine them now that you’ve customized things.\n\nSave the configuration file. Your default list layout will handle the actual\ndisplay of the posts, so when you visit /posts/<year> or\n/posts/<year>/<month>, the posts for that section will show.\n\nThey don’t look very good, though, so let’s fix that.\n\n\n## Customizing Blog List Pages\n\nThe list of posts isn’t very appealing since we’re using the default list\nlayout. Let’s make a layout for posts that shows the title, post date, and a\nsummary of each post’s content.\n\nYou’ll need to make a main posts list showing the most recent posts, but\nyou’ll want to do the same thing for your “year” and “month” list pages. Since\nthere’s going to be significant duplication, you can make a partial to hold\nthe bulk of the markup for a post and share that across layouts.\n\nStart by adding that partial. Create the file\nthemes/basic/layouts/partials/post_summary.html. In the file, add the\nfollowing code, which renders the post’s title, publication date, and summary\nin an <article> element:\n\n[blog/portfolio/themes/basic/layouts/partials/post_summary.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/partials/post_summary.html)\n\n​ | <article>  \n---|---  \n​ |  <header>  \n​ |  <h3>  \n​ |  <a href=​ _\"{{ .RelPermalink }}\"_ ​>{{ .Title }}</a>  \n​ |  </h3>  \n​ |  <time>  \n​ |  {{ .Date | dateFormat \"January\" }}  \n​ |  {{ .Date | dateFormat \"2\" }}  \n​ |  </time>  \n​ |  </header>  \n​ |   \n​ |  {{ .Summary }}  \n​ |   \n​ | </article>  \n  \nSave the file. Now create the file themes/basic/layouts/posts/list.html and\nadd the following code, which iterates over the pages and uses the partial to\ndisplay them:\n\n[blog/portfolio/themes/basic/layouts/posts/list.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/posts/list.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ |  <h2>{{ .Title }}</h2>  \n​ |   \n​ |  {{ range .Pages }}  \n​ |  {{ partial \"post_summary.html\" . }}  \n​ |  {{ end }}  \n​ |   \n​ | {{ end }}  \n  \nSave the file and visit http://localhost:1313/posts to see it in action. Each\npost displays, with the most recent post first, and its abstract displays as\nwell:\n\n![images/blog/post_list.png](Images/post_list.png)\n\nThis layout only works for posts. It won’t work for taxonomy pages like your\nyear and month archive pages. To make that work, you’ll need more specific\nlayouts. You defined the year and month pages as new taxonomies, so create the\nfiles year.html and month.html in the themes/basic/layouts/_default directory\nwith the same code as the post list layout. To speed up the process, copy the\nexisting list page. You can do that your editor, or with the following\ncommands if you’re using macOS, Linux, or WSL:\n\n​ | ​$ ​​**cd** ​​**** ​​**themes/basic/layouts** ​  \n---|---  \n​ | ​$ ​​**cp** ​​**** ​​**posts/list.html** ​​**** ​​**_default/year.html** ​  \n​ | ​$ ​​**cp** ​​**** ​​**posts/list.html** ​​**** ​​**_default/month.html** ​  \n​ | ​$ ​​**cd** ​​**** ​​**-** ​  \n  \nThe cd - command returns you to the previous directory.\n\nOnce those files are in place, start up the server again with hugo server and\nvisit http://localhost:1313/posts/2020. You’ll see the posts for that year\ndisplayed:\n\n![images/blog/year_post_list.png](Images/year_post_list.png)\n\nWith your list page complete, add your blog to the site’s navigation bar. Open\nthemes/basic/layouts/partials/nav.html and add a link to your posts page:\n\n[blog/portfolio/themes/basic/layouts/partials/nav.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/partials/nav.html)\n\n​ | <nav>  \n---|---  \n​ |  <a href=​ _\"/\"_ ​>Home</a>  \n​ |  <a href=​ _\"/about\"_ ​>About</a>  \n»|  <a href=​ _\"/posts\"_ ​>Blog</a>  \n​ |  <a href=​ _\"/projects\"_ ​>Projects</a>  \n​ |  <a href=​ _\"/resume\"_ ​>Résumé</a>  \n​ |  <a href=​ _\"/contact\"_ ​>Contact</a>  \n​ | </nav>  \n  \nSave the file. Your navigation bar now contains a link to your blog.\n\nAs you get more content, your list page might become quite long. You can break\nthings up with pagination.\n\n\n## Adding Pagination\n\nOnce you have more than a handful of posts, your archives pages are going to\nget very long. And your main blog list page will grow and grow until it’s too\nbig to be useful. To handle this, you can break up the list of results into\nmultiple pages, with links to navigate between the list pages. This process is\nknown as pagination.\n\nHugo has built-in pagination support, and it’s enabled by default. All you\nhave to do is change how you fetch pages and add pagination navigation to your\nlayouts.\n\nTo use pagination, use .Paginator.Pages instead of .Pages in your range\nstatement, like this:\n\n​ | {{ range .Paginator.Pages }}  \n---|---  \n  \nHugo defaults to showing 10 pages at a time with its paginator, but you can\noverride this in the layout. Let’s explore this by applying pagination to the\nlist layout for posts.\n\nFirst, create another post in your site so you have more than two pages. Use\nhugo new to create the page:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**posts/third-post.md** ​  \n---|---  \n​ | /Users/brianhogan/portfolio/content/posts/third-post.md created  \n  \nThen, open themes/basic/layouts/posts/list.html and modify it to use the\npaginator and the built-in pagination template. For now, set the number of\npages to show to 1 since you only have three pages and you’ll want to be able\nto test out the navigation:\n\n[blog/portfolio/themes/basic/layouts/posts/list_with_pagination.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/posts/list_with_pagination.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ |  <h2>{{ .Title }}</h2>  \n​ |   \n»|  {{ range (.Paginator 1).Pages }}  \n​ |  {{ partial \"post_summary.html\" . }}  \n​ |  {{ end }}  \n​ |   \n»|  {{ template \"_internal/pagination.html\" . }}  \n​ |   \n​ | {{ end }}  \n  \nSave the file. When you view the site, the pagination won’t look very pretty\nas shown in the screenshot.\n\n![images/blog/unstyled_pagination.png](Images/unstyled_pagination.png)\n\nHugo’s internal pagination template uses markup compatible with\nBootstrap,[[25]](f_0051.xhtml#FOOTNOTE-25) the popular CSS framework. Since\nyou’re not using Bootstrap in this theme, you’ll have to whip up a few styles.\nIf you view the source of your page in the browser, you’ll see markup like\nthis for the pagination:\n\n​ | <ul class=​ _\"pagination\"_ ​>  \n---|---  \n​ |  <li class=​ _\"page-item\"_ ​>  \n​ |  <a href=​ _\"/posts/\"_ ​ class=​ _\"page-link\"_ ​ aria-label=​ _\"First\"_ ​>  \n​ |  <span aria-hidden=​ _\"true\"_ ​>&laquo;&laquo;</span>  \n​ |  </a>  \n​ |  </li>  \n​ |  <li class=​ _\"page-item disabled\"_ ​>  \n​ |  <a href=​ _\"\"_ ​ class=​ _\"page-link\"_ ​ aria-label=​ _\"Previous\"_ ​>  \n​ |  <span aria-hidden=​ _\"true\"_ ​>&laquo;</span>  \n​ |  </a>  \n​ |  </li>  \n​ |  <li class=​ _\"page-item active\"_ ​><a class=​ _\"page-link\"_ ​ href=​ _\"/posts/\"_ ​>1</a></li>  \n​ |  <li class=​ _\"page-item\"_ ​><a class=​ _\"page-link\"_ ​ href=​ _\"/posts/page/2/\"_ ​>2</a></li>  \n​ |  <li class=​ _\"page-item\"_ ​><a class=​ _\"page-link\"_ ​ href=​ _\"/posts/page/3/\"_ ​>3</a></li>  \n​ |  <li class=​ _\"page-item\"_ ​>  \n​ |  <a href=​ _\"/posts/page/2/\"_ ​ class=​ _\"page-link\"_ ​ aria-label=​ _\"Next\"_ ​>  \n​ |  <span aria-hidden=​ _\"true\"_ ​>&raquo;</span>  \n​ |  </a>  \n​ |  </li>  \n​ |  <li class=​ _\"page-item\"_ ​>  \n​ |  <a href=​ _\"/posts/page/3/\"_ ​ class=​ _\"page-link\"_ ​ aria-label=​ _\"Last\"_ ​>  \n​ |  <span aria-hidden=​ _\"true\"_ ​>&raquo;&raquo;</span>  \n​ |  </a>  \n​ |  </li>  \n​ | </ul>  \n  \nHugo’s pagination template generated a list of links with various classes that\nyou can use to style the elements. There are classes to identify the active\nelements, disabled elements, and regular elements.\n\nTo style this quickly, use a method similar to how you styled the navbar and\nuse Flexbox. Open the themes/basic/static/css/style.css file in your editor\nand add the following code to style the pagination container:\n\n[blog/portfolio/themes/basic/static/css/style.css](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/static/css/style.css)\n\n​ | .pagination {  \n---|---  \n​ |  display: flex;  \n​ |  justify-content: space-between;  \n​ |  list-style: none;  \n​ |  margin: 1em auto;  \n​ |  padding: 0;  \n​ | }  \n​ |   \n​ | ​**@media** ​ only screen and (min-width: 768px) {  \n​ |  .pagination {  \n​ |  width: 30%;  \n​ |  }  \n​ | }  \n  \nOn larger screens, you constrain the width to be 30% of the page. The margin:\n0 auto line centers the element horizontally.\n\nNext, add this code to define how each pagination button looks by giving it a\nborder and some width:\n\n[blog/portfolio/themes/basic/static/css/style.css](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/static/css/style.css)\n\n​ | .pagination > .page-item {  \n---|---  \n​ |  border: 1px solid #ddd;  \n​ |  flex: 1;  \n​ |  text-align: center;  \n​ |  width: 5em;  \n​ | }  \n  \nThen style the individual links. Set each link to display: block so it fills\nthe parent container. This makes the links easier to click, as the click\ntarget is the entire box, rather than the text:\n\n[blog/portfolio/themes/basic/static/css/style.css](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/static/css/style.css)\n\n​ | .pagination .page-link {  \n---|---  \n​ |  display: block;  \n​ |  color: #000;  \n​ |  text-decoration: none;  \n​ | }  \n  \nFinally, add code to change the colors for the active page link and the\ndisabled links:\n\n[blog/portfolio/themes/basic/static/css/style.css](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/static/css/style.css)\n\n​ | .pagination > .page-item.active {  \n---|---  \n​ |  background-color: #333;  \n​ | }  \n​ |   \n​ | .pagination > .page-item.active > .page-link {  \n​ |  color: #fff;  \n​ | }  \n​ |   \n​ | .pagination > .page-item.disabled > .page-link {  \n​ |  color: #ddd;  \n​ | }  \n  \nView the posts page, and this time you’ll see styled pagination:\n\n![images/blog/pagination.png](Images/pagination.png)\n\nNow that you know the pagination works, open\nthemes/basic/layouts/posts/list.html and change the number of paginated\nresults to 10 posts:\n\n​ | {{ range (.Paginator 10).Pages }}  \n---|---  \n  \nAlternatively, since the default is 10, change the range line back to the\noriginal code:\n\n​ | {{ range .Paginator.Pages }}  \n---|---  \n  \nYou can then control the number of results globally in the site’s\nconfiguration by adding the Paginate field to config.toml:\n\n​ | Paginate = 10  \n---|---  \n  \nHandling Lots of Posts\n\nOnce you’ve been adding new content to your site consistently, or if you’ve\nmigrated content into your site, you’ll end up with hundreds of files in your\n‘posts‘ folder, which can be difficult to manage.\n\nHugo uses the folders that you create inside of your ‘content‘ folder to\ndefine content sections, but you can create subfolders within these folders to\norganize your content in a way that works better for you. For example, you can\ncreate a ‘2020‘ folder inside ‘posts‘ and move all of the posts from 2020 into\nthat folder. Hugo will still see them as posts.\n\nBy default, Hugo tries to mirror what’s on disk with how the URLs are\nconstructed, but you can override that with the ‘url‘ front matter field on\neach document or with the ‘permalinks‘ configuration settings like you did in\n[xxx](#sec.customizing.url.posts).\n\nYou can explore content sections in more detail, including how to create\nnested content sections, in Hugo’s\ndocumentation.[[26]](f_0051.xhtml#FOOTNOTE-26)\n\nWith pagination in place, your blog list pages will be more manageable for\nyour visitors. Now let’s add interactivity to your blog posts with comments.\n\n\n## Adding Comments to Posts Using Disqus\n\nMany blogs include a commenting system that lets your community of readers\ninteract with your posts. Hugo only generates static sites, but you can add\nsupport for comments using Disqus,[[27]](f_0051.xhtml#FOOTNOTE-27) a platform\nthat hosts comments and provides tools for community moderation. Hugo has\nbuilt-in support for Disqus. To use it, you’ll create a Disqus account for\nyour site, set the site name in your Hugo site’s configuration file, and\ninclude the Disqus template on your pages.\n\nCreate a new account on Disqus for your site. Once your account is created,\nselect the option to use Disqus on your site. Disqus will ask you to provide a\nfew pieces of info about your site:\n\n![images/blog/disqus_creation.png](Images/disqus_creation.png)\n\nFill in the name of your site and select the appropriate category. Take note\nof the URL that Disqus shows under the Website Name field; you’ll need the\nfirst part, which Disqus calls the “shortname,” to link your Hugo site to\nDisqus. In the preceding image, the URL for the site is pp-hugo-\ndemo.disqus.com, so the shortname is pp-hugo-demo. Press the Create Site\nbutton to continue.\n\nNext, select a plan. You can pay for Disqus or use the free ad-supported tier.\n\nOnce you’ve selected your plan, you’re presented with options to integrate\nDisqus with your site. Scroll to the bottom and choose the option to set up\nDisqus manually. This presents you with some code snippets you can add to your\nwebsite. You can ignore this, as you’ll use Hugo’s built-in Disqus template\nshortly. Continue to the Configure Disqus option.\n\nThe Configure Disqus page lets you fill in the website URL, the description,\nand a few other attributes. You don’t need to fill these in now either. Press\nthe Complete Setup button.\n\nThen, open config.toml and add the following line to tell Hugo the shortname\nfor the Disqus site you configured:\n\n[blog/portfolio/config.toml](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/config.toml)\n\n​ | theme = ​ _\"basic\"_ ​  \n---|---  \n»| disqusShortname = ​ _\"pp-hugo-demo\"_ ​  \n  \nIn this example, the shortname is pp-hugo-demo. Save the file and then stop\nthe Hugo server and restart it again, just to make sure the new setting is\napplied.\n\nNext, open the blog post layout at themes/basic/layout/posts/single.html, and\nafter the article contents, add a new comments section that uses Hugo’s built-\nin Disqus template:\n\n[blog/portfolio/themes/basic/layouts/posts/single.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/posts/single.html)\n\n​ |  <section class=​ _\"body\"_ ​>  \n---|---  \n​ |  {{ .Content }}  \n​ |  </section>  \n»|  <section class=​ _\"comments\"_ ​>  \n»|  <h3>Comments</h3>  \n»|  {{ template \"_internal/disqus.html\" . }}  \n»|  </section>  \n  \nThis template uses the disqusShortname shortname variable you set in\nconfig.toml and pulls in the Disqus commenting interface for this page. Save\nthe file.\n\nAs it turns out, Disqus won’t load if your site is served from the localhost\ndomain, so you won’t be able to see it in action. To get around this, you have\na few different options:\n\n  * Host the site via a fully qualified domain name.\n\n  * Edit your local hosts file and create an entry like example.com that points to your local machine. Then visit http://example.com:1313 in your browser.\n\n  * Use a tunneling service and its client to proxy connections through external servers.\n\nWe’ll use the last approach, as it also offers an easy way to share your work\nwith others while you’re developing your site. The service\nlocaltunnel.me[[28]](f_0051.xhtml#FOOTNOTE-28) is a free service that lets you\ndo this quickly using their command-line client. The client is written in\nNode.js, which means you need Node installed on your local machine.\n\nUse the npx command, included with Node.js, to launch the localtunnel client\nand proxy your site. Ensure the Hugo server is running, open a new Terminal\nwindow, and execute this command:\n\n​ | ​$ ​​**npx** ​​**** ​​**localtunnel** ​​**** ​​**-p** ​​**** ​​**1313** ​  \n---|---  \n​ | npx: installed 55 in 3.292s  \n​ | your url is: https://grumpy-turtle-68.localtunnel.me  \n  \nThis downloads the localtunnel package and executes its binary. The -p flag\nspecifies on which port your development server is running.\n\nUse the URL you see in your terminal to access your site. Visit one of your\nposts and you’ll see your Disqus comments section at the bottom of the page:\n\n![images/blog/comments.png](Images/comments.png)\n\nAs it stands now, you’ve added comments to every blog post. However, you might\noccasionally want to disallow comments on a page.\n\nOpen the first-post.md file and add a new piece of front matter that turns\ncomments off:\n\n[blog/portfolio/content/posts/first-\npost.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/content/posts/first-\npost.md)\n\n​ | categories:  \n---|---  \n​ | \\- Personal  \n​ | \\- Thoughts  \n​ | tags:  \n​ | \\- software  \n​ | \\- html  \n»| disableComments: true  \n  \nThen, modify the post layout to use this value to determine whether or not the\ncomments should display:\n\n[blog/portfolio/themes/basic/layouts/posts/single.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/posts/single.html)\n\n​ |  <section class=​ _\"comments\"_ ​>  \n---|---  \n​ |  <h3>Comments</h3>  \n»|  {{ if .Params.disableComments }}  \n»|  <p>Comments are disabled for this post</p>  \n»|  {{ else }}  \n»|  {{ template \"_internal/disqus.html\" . }}  \n»|  {{ end }}  \n  \nReturn to your browser and visit the “First Post” page; you’ll see that\ncomments are disabled for that page. Visit one of the other posts to ensure\nthat you can still comment there. When you deploy your site to production,\nvisitors will be able to comment and discuss your content, but only on the\nposts you choose. Remember to use Disqus’s interface to manage and moderate\nthe comments people leave on your site though.\n\nSwitch to the terminal window that’s running the localtunnel server and use\nCtrl+c to shut it down. You can then close the terminal window as you won’t\nneed it anymore.\n\nYour blog is almost complete. Let’s add one final feature: showing people\nother posts related to the one they’re reading.\n\n\n## Displaying Related Content\n\nWhen people find a page on your site through a social media share or a search\nresult, you might want to make some of your other content visible as well.\nHugo lets you display related content and has some sensible defaults for doing\nso. To enable this feature, you have to add some keywords to your pages’ front\nmatter section. You also have to add some code to your single page template\nthat displays the related content. To demonstrate, let’s add a keywords\nsection to the front matter of the Jabberwocky project and the second-post\nblog post.\n\nFirst, open content/projects/jabberwocky.md and add the keywords section. Like\ntags, it’s a list:\n\n[blog/portfolio/content/projects/jabberwocky.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/content/projects/jabberwocky.md)\n\n​ | tech_used:  \n---|---  \n​ | \\- JavaScript  \n​ | \\- CSS  \n​ | \\- HTML  \n»| keywords:  \n»| \\- jabberwocky  \n  \nAdd the same keywords section to content/posts/second-post.md:\n\n[blog/portfolio/content/posts/second-\npost.md](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/content/posts/second-\npost.md)\n\n​ | tags:  \n---|---  \n​ | \\- software  \n​ | \\- html  \n»| keywords:  \n»| \\- jabberwocky  \n  \nThen, open themes/basic/layouts/posts/single.html and add this code below your\npost but above the comments section:\n\n[blog/portfolio/themes/basic/layouts/posts/single.html](http://media.pragprog.com/titles/bhhugo/code/blog/portfolio/themes/basic/layouts/posts/single.html)\n\n​ |  <section class=​ _\"body\"_ ​>  \n---|---  \n​ |  {{ .Content }}  \n​ |  </section>  \n​ |   \n»|  <section class=​ _\"related\"_ ​>  \n»|  {{ $related := .Site.RegularPages.Related . | first 5 }}  \n»|  {{ with $related }}  \n»|  <h3>Related pages</h3>  \n»|  <ul>  \n»|  {{ range . }}  \n»|  <li><a href=​ _\"{{ .RelPermalink }}\"_ ​>{{ .Title }}</a></li>  \n»|  {{ end }}  \n»|  </ul>  \n»|  {{ end }}  \n»|  </section>  \n  \nThis code uses a with block to check if there’s any related content. If there\nis, it displays the header and the list of content.\n\nBy adding the same keyword to the Jabberwocky project and the “second post”\nblog post, the Jabberwocky project now shows up as a related piece of content\nas shown in the screenshot.\n\n![images/blog/related.png](Images/related.png)\n\nThis is a great way to make people aware of your work. Add keywords throughout\nyour pages to get them to show up on your blog posts.\n\nHugo uses these default settings for related content, creating indices on the\nkeywords and dates of your content:\n\n​ | [related]  \n---|---  \n​ | threshold = 80.0  \n​ | includeNewer = false  \n​ | toLower = false  \n​ |   \n​ |  [[related.indices]]  \n​ |  name = \"keywords\"  \n​ |  weight = 100.0  \n​ |   \n​ |  [[related.indices]]  \n​ |  name = \"date\"  \n​ |  weight = 10.0  \n  \nTo change the behavior of related content, you must add the entire\nconfiguration block to your config.toml file and then modify it to suit your\nneeds.\n\nThere are a few options you might want to explore when setting up the related\npost content. For example, the includeNewer option, if set to true, will\nupdate older pages on your site with new related content. The threshold is a\nnumber between 0 and 100, with lower numbers showing more content with less\nrelevance. Also, the toLower option can increase the matches by lowercasing\nthe keywords and queries that get created for finding related content.\n\nYou can also add new indices for tags, author, or any other front matter\nfields for that matter. The weight for each index you create controls how\nrelevant this index is compared to others. Experiment with these values to get\nthe right balance for your content.\n\n\n## Your Turn\n\nBefore moving on to the next chapter, complete the following tasks:\n\n  1. Create a layout for the tag pages using the same approach you used for year and month pages. Create the tag list template in themes/basic/layouts/_default/tags.html.\n\n  2. Create layouts for the /categories page and the individual category pages.\n\n  3. Add an optional header image for your blog posts. Images go in the static folder, and you link to them using the same approach you use when you link your CSS files. Use front matter to define the banner image for a post and display it if it exists.\n\n  4. Apply pagination to your project list.\n\n  5. Place your latest blog post on the home page of your site.\n\n\n## Wrapping Up\n\nYou’ve applied what you learned about creating content sections and data to\nbuild a blog. You’ve gained a few new skills as well. You know how to\ncustomize URLs for sections of your site, you can organize content using\ntaxonomies, and you can add comments using Disqus to your pages.\n\nWith all this new content, you’ll need a way for people to find it. So let’s\nlook at how you can integrate search into your site.\n\n#### Footnotes\n\n[[19]](f_0042.xhtml#FNPTR-19)\n\n    \n\n<https://www.lipsum.com/>\n\n[[20]](f_0043.xhtml#FNPTR-20)\n\n    \n\n<https://www.irisreading.com/what-is-the-average-reading-speed/>\n\n[[21]](f_0043.xhtml#FNPTR-21)\n\n    \n\n<https://github.com/alecthomas/chroma>\n\n[[22]](f_0043.xhtml#FNPTR-22)\n\n    \n\n<https://pygments.org/>\n\n[[23]](f_0043.xhtml#FNPTR-23)\n\n    \n\n<https://xyproto.github.io/splash/docs/>\n\n[[24]](f_0045.xhtml#FNPTR-24)\n\n    \n\n<https://discourse.gohugo.io/t/how-to-generate-chronological-blog-archives-in-\nhugo/13491/6>\n\n[[25]](f_0047.xhtml#FNPTR-25)\n\n    \n\n<https://getbootstrap.com/>\n\n[[26]](f_0047.xhtml#FNPTR-26)\n\n    \n\n[ https://gohugo.io/content-management/sections/](https://gohugo.io/content-\nmanagement/sections/)\n\n[[27]](f_0048.xhtml#FNPTR-27)\n\n    \n\n<https://disqus.com>\n\n[[28]](f_0048.xhtml#FNPTR-28)\n\n    \n\n<https://localtunnel.me>\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  Chapter 6  \nAdding Search to Your Site\n\nOnce you’ve created a large amount of content on your site, you’ll want to\nmake it easier for people to find things. When your site is live for all the\nworld to see, you’ll want to make sure everyone can find your content.\n\nYou’ll also want a local search engine for your site, especially for\nsituations where you have a significantly large corpus of content.\n\nDatabase-driven sites like WordPress have built-in search capabilities. When a\nvisitor seearches for content, their keywords are used to build a query that\ngets sent to the database containing the content. The database returns results\nthat match, and the system displays the page.\n\nFor static sites like Hugo, you’re working without a database, so you’re going\nto have to think about solving the problem differently. You can use a third-\nparty search service like Algolia,[[29]](f_0057.xhtml#FOOTNOTE-29) which\nindexes your content and lets you search it. You can set up your own search\nindexer like ElasticSearch[[30]](f_0057.xhtml#FOOTNOTE-30) and integrate it\ninto your site. Or you can generate your own search index and use client-side\nJavaScript to perform the search.\n\nIn this chapter, we’ll take the last approach. You’ll build a client-side\nsearch engine using a JavaScript library called\nLunr[[31]](f_0057.xhtml#FOOTNOTE-31) to do the heavy lifting. Lunr needs a\nlist of your site’s content in JSON format, so you’ll leverage Hugo’s ability\nto generate JSON to create that list.\n\n\n## Creating the Document Collection\n\nFor Lunr to search your site, it needs to know about all of the documents\navailable, and it’ll need the titles and some text to search. Lunr accepts a\ncollection of documents that looks something like this:\n\n​ | [{  \n---|---  \n​ |  ​ _\"name\"_ ​: ​ _\"A document\"_ ​,  \n​ |  ​ _\"text\"_ ​: ​ _\"A bunch of content filled with amazing thoughts.\"_ ​  \n​ | }, {  \n​ |  ​ _\"name\"_ ​: ​ _\"A second document\"_ ​,  \n​ |  ​ _\"text\"_ ​: ​ _\"Similar, but different from the first one.\"_ ​  \n​ | }]  \n  \nTo generate the search index that Lunr needs, you’ll use an approach similar\nto how you generated the projects JSON feed; you’ll create a layout for the\nsearch index that iterates through all of the pages in the site, emitting the\nfields that Lunr will use. Later, you’ll fetch this JSON file from the server\nusing JavaScript, parse it with Lunr, and match it against the search terms\nyour visitor provides.\n\nCreate the file themes/basic/layouts/_default/search.json and add the\nfollowing code which iterates through all the pages in the site and displays\nthe title, the body, and the link to the page:\n\n[search/portfolio/themes/basic/layouts/_default/search.json](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/layouts/_default/search.json)\n\n​ | {  \n---|---  \n​ |  ​ _\"results\"_ ​: [  \n​ |  {{​**-** ​ ​**range** ​ ​**$index** ​, ​**$page** ​ :​**=** ​ ​**.Site.RegularPages** ​ }}  \n​ |  {{​**-** ​ ​**if** ​ ​**$index** ​ ​**-** ​}} , {{​**-** ​ ​**end** ​ }}  \n​ |  {  \n​ |  ​ _\"href\"_ ​: {{ ​**.Permalink** ​ ​**|** ​ ​**jsonify** ​ }},  \n​ |  ​ _\"title\"_ ​: {{ ​**.Title** ​ ​**|** ​ ​**jsonify** ​ }},  \n​ |  ​ _\"body\"_ ​: {{ ​**.Content** ​ ​**|** ​ ​**plainify** ​ ​**|** ​ ​**jsonify** ​ }}  \n​ |  }  \n​ |  {{​**-** ​ ​**end** ​ }}  \n​ |  ]  \n​ | }  \n  \nThe .RegularPages collection gives you access to all of the pages on the site.\nYou’ll need the link to the page when you eventually display the search\nresults to the visitor.\n\nNext, create the Search content page itself. It won’t have any content, but\nyou need it so you can specify the output formats. Define both an HTML and\nJSON format, as you’ll create an HTML layout which will display the actual\nsearch interface shortly.\n\nCreate content/search.md:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**search.md** ​  \n---|---  \n​ | /Users/brianhogan/portfolio/content/search.md created  \n  \nModify the file’s front matter so it displays the output formats. Use layout\nto associate this file with the search layout you created, and make sure draft\nis set to false:\n\n[search/portfolio/content/search.md](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/content/search.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _Search\"_ ​  \n​ | date: ​ _2020-01-02T12:42:17-05:00_ ​  \n​ | draft: false  \n»| outputs:  \n»| \\- ​ _HTML_ ​  \n»| \\- ​ _JSON_ ​  \n»| layout: ​ _search_ ​  \n​ | ​**\\---** ​  \n  \nSave the file. This is enough to generate the search index. Start the Hugo\nserver and visit http://localhost:1313/search/index.json and you’ll see your\ndocuments:\n\n​ | {  \n---|---  \n​ |  \"results\": [  \n​ |  {  \n​ |  \"href\": \"http://localhost:1313/search/\",  \n​ |  \"title\": \"Search\",  \n​ |  \"body\": \"\"  \n​ |  },  \n​ |  {  \n​ |  \"href\": \"http://localhost:1313/posts/2020/01/third-post/\",  \n​ |  \"title\": \"Third Post\",  \n​ |  \"body\": \"Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed  \n​ |  do eiusmod tempor incididunt ut labore et dolore magna aliqua.\\n  \n​ |  Ut enim ad minim veniam, quis nostrud exercitation ullamco  \n​ |  laboris nisi ut aliquip ex ea commodo consequat.\\n\"  \n​ |  },  \n​ |   \n​ | ...  \n​ |   \n​ |  {  \n​ |  \"href\": \"http://localhost:1313/projects/linkitivity/\",  \n​ |  \"title\": \"Linkitivity\",  \n​ |  \"body\": \"Description of the Linkitivity project\\u0026hellip;\\n\"  \n​ |  }  \n​ |  ]  \n​ | }  \n  \nYou now have a single JSON file that contains the entire contents of your\nsite. Let’s build the page that displays the search box next.\n\n![Joe asks:](Images/joe.jpg)\n\nJoe asks:\n\nWon’t the Search Index Get Huge If I Have a Lot of Content?\n\nYes it will. And a large JSON file will take longer for your visitors to\ndownload and longer for Lunr to index. You might consider using the summary\ninstead of the entire content. This will reduce the size of the file, but will\nalso reduce the reliability of your searches, as they’ll have less to work\nwith. In that case you can explore other options. On a site like this, a\nsingle search index such as this one won’t cause any serious performance\nissues. On sites with thousands of pages, a solution like Algolia will\nprobably be a better fit.\n\n\n## Creating the Search Interface\n\nRight now, when you visit http://localhost/search in your browser, you see the\ntitle. The search.md file you created renders output in both JSON and HTML\nformats, but you only created a JSON layout. The default single page layout is\ncurrently applied, but you didn’t define any content in the search.md file.\nLet’s get the search form to appear on the page.\n\nCreate the file themes/basic/layouts/_default/search.html and add the\nfollowing code, which defines the main block, displays the title, and defines\na text box, button, and area for search results:\n\n[search/portfolio/themes/basic/layouts/_default/search.html](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/layouts/_default/search.html)\n\n​ | {{ define \"main\" }}  \n---|---  \n​ |   \n​ |  <h2>{{ .Title }}</h2>  \n​ |   \n​ |  <input type=​ _\"search\"_ ​ id=​ _\"searchField\"_ ​>  \n​ |  <button id=​ _\"searchButton\"_ ​>Search</button>  \n​ |   \n​ |  <div id=​ _\"output\"_ ​>  \n​ |  <p>Waiting for search input</p>  \n​ |  </div>  \n​ | {{ end }}  \n  \nSave the file. Visit http://localhost:1313/search in your browser and you’ll\nsee the form as shown in the screenshot.\n\n![images/search/form.png](Images/form.png)\n\nAt this point, the form doesn’t do anything. To implement the search\nfunctionality, you need to write some JavaScript and attach it to this page.\nYou’ll fetch the document collection you just created, use the Lunr library to\nbuild a search index from that document collection, and perform a search using\nthe text your visitor submits.\n\nYou’ll use the Axios[[32]](f_0057.xhtml#FOOTNOTE-32) library to fetch remote\ndata. Axios is a promise-based library that makes grabbing remote data a\nbreeze.\n\nTo use Lurn and Axios, you need to include them on your page. Open\nthemes/basic/layouts/_default/search.html and, right before the {{ end }}\nmarkup, add these two lines to load the Lunr and Axios JavaScript libraries\nfrom a Content Delivery Network (CDN):\n\n[search/portfolio/themes/basic/layouts/_default/search.html](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/layouts/_default/search.html)\n\n​ | <script src=​ _\"//unpkg.com/lunr@2.3.6/lunr.js\"_ ​></script>  \n---|---  \n​ | <script src=​ _\"//unpkg.com/axios@0.19.0/dist/axios.js\"_ ​></script>  \n  \nUsing a CDN saves you the trouble of downloading them locally, and lets you\ntake advantage of the caching mechanisms the CDN provides. In the next\nchapter, you’ll refactor this to use npm and Webpack to create a bundle that\ncontains these libraries, so you won’t be relying on the CDN. But let’s get\nthe search working first before adding additional complexity.\n\nCreate the file themes/basic/static/js/search.js and add an alert statement to\nthe file so you can test that the script loads properly:\n\n​ | alert(​ _\"Search!\"_ ​);  \n---|---  \n  \nSave the file, and then switch back to\nthemes/basic/layouts/_default/search.html and include the search.js file by\nadding this code after the other script tags:\n\n[search/portfolio/themes/basic/layouts/_default/search.html](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/layouts/_default/search.html)\n\n​ | <script src=​ _\"{{ \"_ ​js​**/** ​search​**.** ​js​**\"** ​ ​**|** ​ relURL ​**}}\"** ​></script>  \n---|---  \n  \nNow, visit https://localhost:1313/search and you’ll see an alert box pop up.\nThis demonstrates that your JavaScript is properly linked up.\n\nSwitch back to themes/basic/static/js/search.js. Remove the alert line from\nthe file.\n\nDefine a global SearchApp object, which will hold some references you’ll need\nthroughout the search script:\n\n[search/portfolio/themes/basic/static/js/search.js](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/static/js/search.js)\n\n​ | ​ _'use strict'_ ​  \n---|---  \n​ | window.SearchApp = {  \n​ |  searchField: document.getElementById(​ _\"searchField\"_ ​),  \n​ |  searchButton: document.getElementById(​ _\"searchButton\"_ ​),  \n​ |  output: document.getElementById(​ _\"output\"_ ​),  \n​ |  searchData: {},  \n​ |  searchIndex: {}  \n​ | };  \n  \nThis stores references to the search field, search button, and the output\narea. It also defines two other properties: searchData and searchIndex.\n\nYou’ll fetch the JSON data from the server and store it in the searchData\nproperty. Then you’ll feed that to Lunr, which will build a search index that\nyou’ll store in searchIndex. You’ll need to keep the original JSON data around\nbecause when you query the search index, the list of results won’t contain the\ntitle and other information in the search index. The results you’ll get\ncontain the hyperlink to the page, along with other data like the relevance\nand weight. To display the page title, you’ll cross-reference the results you\nget with the original data.\n\nUse the Axios library to fetch the data from the search page. When you get the\nresults, store them in the searchData property. Then populate the search index\nwith the results from the field:\n\n[search/portfolio/themes/basic/static/js/search.js](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/static/js/search.js)\n\n​ | axios  \n---|---  \n​ |  .​**get** ​(​ _'/search/index.json'_ ​)  \n​ |  .then(response => {  \n​ |  SearchApp.searchData = response.data;  \n​ |  SearchApp.searchIndex = lunr(​**function** ​ () {  \n​ |  ​**this** ​.ref(​ _'href'_ ​);  \n​ |  ​**this** ​.field(​ _'title'_ ​);  \n​ |  ​**this** ​.field(​ _'body'_ ​);  \n​ |  response.data.results.forEach(e => {  \n​ |  ​**this** ​.add(e);  \n​ |  });  \n​ |  });  \n​ |  });  \n  \nLunr uses the data from the title and the body to build the search index. When\nyou perform a search, Lunr will compare the search terms with the words in its\nindex and generate results.\n\nNext, add an event listener to the search button which calls a search\nfunction, and then implement the function which uses Lunr to perform the\nsearch:\n\n[search/portfolio/themes/basic/static/js/search.js](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/static/js/search.js)\n\n​ | SearchApp.searchButton.addEventListener(​ _'click'_ ​, search);  \n---|---  \n​ |   \n​ | ​**function** ​ search() {  \n​ |  ​**let** ​ searchText = SearchApp.searchField.value;  \n​ |   \n​ |   \n​ |  ​**let** ​ resultList = SearchApp.searchIndex.search(searchText);  \n​ |   \n​ |  ​**let** ​ list = [];  \n​ |  ​**let** ​ results = resultList.map(entry => {  \n​ |  SearchApp.searchData.results.filter(d => {  \n​ |  ​**if** ​(entry.ref == d.href) {  \n​ |  list.push(d);  \n​ |  }  \n​ |  })  \n​ |  });  \n​ |   \n​ |  display(list);  \n​ |   \n​ | }  \n  \nLunr gives you results, but the results only contain a score and a hyperlink.\nTo get results you can display, search through the JSON data you pulled from\nthe server and match on the URLs. Then call the display function to display\nthe results you found.\n\nFinally, write the display function, which iterates over the results and\ndisplays them:\n\n[search/portfolio/themes/basic/static/js/search.js](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/static/js/search.js)\n\n​ | ​**function** ​ display(list) {  \n---|---  \n​ |   \n​ |  SearchApp.output.innerText = ​ _''_ ​;  \n​ |  ​**if** ​ (list.length > 0) {  \n​ |  ​**const** ​ ul = document.createElement(​ _\"ul\"_ ​);  \n​ |  list.forEach(el => {  \n​ |  ​**const** ​ li = document.createElement(​ _\"li\"_ ​);  \n​ |  ​**const** ​ a = document.createElement(​ _\"a\"_ ​);  \n​ |  a.href = el.href;  \n​ |  a.text = el.title;  \n​ |  li.appendChild(a);  \n​ |  ul.appendChild(li);  \n​ |  });  \n​ |   \n​ |  SearchApp.output.appendChild(ul);  \n​ |  }​**else** ​{  \n​ |  SearchApp.output.innerHTML = ​ _\"Nothing found\"_ ​;  \n​ |  }  \n​ |   \n​ | };  \n  \nTake the search out for a spin. This current implementation only finds whole\nwords, so search for “Jabberwocky” and you’ll see the link to that project\nappear in the results.\n\n![images/search/jabberwocky_result.png](Images/jabberwocky_result.png)\n\nLet’s tweak the search to make it a little more useful.\n\n\n## Improving the Search\n\nWhen you pass text to Lunr, it’s turning the text into a search query. When\nyou pass single words, it searches for all documents containing that word. But\nif you search for multiple words, Lunr defaults to searching for documents\nthat contain either word. So a search for “first post” would return all the\ndocuments with the word “first” or the word “post”.\n\nIf you wanted to show documents that contain all of the words, you’d have to\nplace plus signs in front of each word. For example, to find pages with “first\npost”, you’d have to search for +first +post.\n\nFinally, Lunr supports partial word search. You can use wildcard characters.\nSearch for jabber* and you’ll get the result you’re looking for.\n\nYour visitors won’t know about these search capabilities unless you add\ninstructions to the site, so let’s modify the behavior of the search to make\nit easier for people to use. You’ll add asterisks to each word, and then add a\ncheckbox that specifies that you’re looking for all words. If it’s checked,\nyou’ll change the query yourself.\n\nAdd the wildcards first. Take the value you get from the search form, use the\nsplit() function to turn it into an array of words, use the map() function to\ntransform each word and append the asterisk to each word, and then use join()\nto convert the result back to a string:\n\n[search/portfolio/themes/basic/static/js/search.js](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/static/js/search.js)\n\n​ | ​**function** ​ search() {  \n---|---  \n​ |  ​**let** ​ searchText = SearchApp.searchField.value;  \n​ |   \n»|  searchText = searchText  \n»|  .split(​ _\" \"_ ​)  \n»|  .map( word => { ​**return** ​ word + ​ _\"*\"_ ​ })  \n»|  .join(​ _\" \"_ ​);  \n  \nSave the file. Then try out the search in your browser by searching for Fir.\nThe “First Post” entry displays.\n\nWhen you use asterisks, Lunr will no longer find some complete words. If you\nsearch for “Jabberwocky” now, it won’t return any results because using\nwildcards disables Lunr’s stemming support.\nStemming[[33]](f_0057.xhtml#FOOTNOTE-33) is the process of reducing a word to\nits stem. For example, if you have the words “building” or “builder”, the stem\nwould be “build”. Lunr uses stemming to reduce the size of the index it\nbuilds. You can disable stemming support by removing it from the pipeline when\nyou create the Lunr index:\n\n[search/portfolio/themes/basic/static/js/search.js](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/static/js/search.js)\n\n​ | SearchApp.searchIndex = lunr(​**function** ​ () {  \n---|---  \n»|  ​**this** ​.pipeline.remove(lunr.stemmer);  \n»|  ​**this** ​.searchPipeline.remove(lunr.stemmer);  \n​ |  ​**this** ​.ref(​ _'href'_ ​);  \n​ |  ​**this** ​.field(​ _'title'_ ​);  \n​ |  ​**this** ​.field(​ _'body'_ ​);  \n​ |  response.data.results.forEach(e => {  \n​ |  ​**this** ​.add(e);  \n​ |  });  \n​ | });  \n  \nLet’s add a checkbox to the form to allow users to require that all words are\nincluded in the search, instead of the default behavior. First, add a new\ncheckbox field and corresponding label to the form. Open\nthemes/basic/layouts/_default/search.html and add the new field:\n\n[search/portfolio/themes/basic/layouts/_default/search.html](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/layouts/_default/search.html)\n\n​ | <input type=​ _\"search\"_ ​ id=​ _\"searchField\"_ ​>  \n---|---  \n​ | <button id=​ _\"searchButton\"_ ​>Search</button>  \n»| <input id=​ _\"allwords\"_ ​ type=​ _\"checkbox\"_ ​>  \n»| <label for=​ _\"allwords\"_ ​>Require all words</label>  \n  \nSwitch back to themes/basic/static/js/search.js and add a new field to the\nsearchApp object that references the new checkbox:\n\n[search/portfolio/themes/basic/static/js/search.js](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/static/js/search.js)\n\n​ | window.SearchApp = {  \n---|---  \n​ |  searchField: document.getElementById(​ _\"searchField\"_ ​),  \n​ |  searchButton: document.getElementById(​ _\"searchButton\"_ ​),  \n»|  allwords: document.getElementById(​ _\"allwords\"_ ​),  \n​ |  output: document.getElementById(​ _\"output\"_ ​),  \n​ |  searchData: {},  \n​ |  searchIndex: {}  \n​ | };  \n  \nFinally, in the search() function, right before you perform the search, check\nthe checkbox. If it’s checked, prepend each word with a plus sign, using the\nsame technique you used to append asterisks for the wildcards:\n\n[search/portfolio/themes/basic/static/js/search.js](http://media.pragprog.com/titles/bhhugo/code/search/portfolio/themes/basic/static/js/search.js)\n\n»| ​**if** ​ (SearchApp.allwords.checked) {  \n---|---  \n»|  searchText = searchText  \n»|  .split(​ _\" \"_ ​)  \n»|  .map( word => { ​**return** ​ ​ _\"+\"_ ​ + word })  \n»|  .join(​ _\" \"_ ​);  \n»| }  \n​ |   \n​ | ​**let** ​ resultList = SearchApp.searchIndex.search(searchText);  \n  \nSave the file. Back in your browser, enter “first post” in the field, select\nthe checkbox, and search. “First Post” is now the only result. Uncheck the box\nand you’ll get different results:\n\n![images/search/allwords.png](Images/allwords.png)\n\nThe order in which Lunr displays results is based on how many times the word\nappears in the document. When you perform the search, Lunr returns each\nresult, along with a score. The more times a word appears, the higher the\nscore. You can use these scores to set thresholds and tune your search even\nfurther.\n\n\n## Your Turn\n\nHere are some additional things for you to explore to make your search more\nrobust:\n\n  1. If you enter nothing in the search field, all the pages come back in the results. Modify the code to handle blank searches.\n\n  2. Some of the content of your pages is hidden in front matter. For example, your project pages contain technology used, which you might want to see in your searches. Explore how you can include this data in addition to the title and body content.\n\n  3. Review the Lunr documentation to explore how to create a serialized search index instead of creating one on the client. This will require additional processing when you publish your site, but it will speed things up substantially if you have a lot of content.\n\n  4. Explore other search options like Algolia and see how they stack up compared to Lunr.\n\n\n## Wrapping Up\n\nYou added a basic search to your site, using Hugo to generate a catalog of\ncontent, and JavaScript to download and search it. You refined the search to\ntake advantage of some of Lunr’s features. In the next chapter, you’ll use\nHugo’s asset management features to process your CSS and JavaScript files,\ngetting things one step closer to production.\n\n#### Footnotes\n\n[[29]](f_0052.xhtml#FNPTR-29)\n\n    \n\n<https://www.algolia.com>\n\n[[30]](f_0052.xhtml#FNPTR-30)\n\n    \n\n<https://www.elastic.co>\n\n[[31]](f_0052.xhtml#FNPTR-31)\n\n    \n\n<https://lunrjs.com>\n\n[[32]](f_0054.xhtml#FNPTR-32)\n\n    \n\n<https://github.com/axios/axios>\n\n[[33]](f_0055.xhtml#FNPTR-33)\n\n    \n\n<https://lunrjs.com/guides/core_concepts.html#stemming>\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  Chapter 7  \nManaging Assets with Pipes\n\nA website is more than just its content. Stylesheets, images, and JavaScript\nbring a site to life, but managing these assets can be tricky.\n\nWhen you’re getting your site ready for production, you’re looking for ways to\nmake the experience better for your visitors. To improve speed, it’s common\npractice to process CSS and JavaScript files to minify them, which involves\nremoving whitespace, line breaks, and comments to reduce the file size so the\nfiles transfer faster. It’s also common to fingerprint the CSS and JavaScript\nfiles so that they’ll have slightly different filenames when you deploy\nmodified versions. This invalidates browser caches so visitors see your\nchanges.\n\nYou might even want to take advantage of Sass, a CSS preprocessor that lets\nyou break up your stylesheets, add logic, and create shared functionality. And\nnow that you have a JS-powered search, you might want to create a bundle for\nyour JavaScript files instead of relying on a version hosted by a CDN.\n\nHugo can handle all of this out of the box, thanks to its Pipes feature. Pipes\nlet you transform your CSS and other assets right from within Hugo. You won’t\nneed to install additional tooling to concatenate, minify, or fingerprint your\nfiles. As long as you’ve installed the extended version of Hugo, you’ve got\neverything you need.\n\nHugo also includes some powerful built-in features for managing images,\nincluding the ability to resize images automatically, or perform other forms\nof image processing, without the need for external tooling.\n\nIn this chapter, you’ll use Hugo’s built-in features to manage your CSS,\nimages, and JavaScript files. You’ll also integrate\nWebpack[[34]](f_0064.xhtml#FOOTNOTE-34) into your project so that you can take\nadvantage of advanced features Hugo doesn’t support, such as JavaScript\nmodules. And since you’re going to do that integration, you’ll create some\nscripts to make building your project easier.\n\n\n## Managing Stylesheets\n\nRight now you have a single CSS file for the site with a pretty minimalist\ndesign. As it grows, you may want to break it up into components, or evolve it\nfurther.\n\nTo use the pipelines feature of Hugo, you’ll need to move your CSS files out\nof the static directory and into a new assets directory.\n\nStop your Hugo server with Ctrl-c. Create a new directory in your theme named\nassets. You can do this with your editor, or with the following command:\n\n​ | ​$ ​​**mkdir** ​​**** ​​**themes/basic/assets** ​  \n---|---  \n  \nThen move the static/css directory there:\n\n​ | ​$ ​​**mv** ​​**** ​​**themes/basic/static/css** ​​**** ​​**themes/basic/assets** ​  \n---|---  \n  \nThen in themes/basic/layouts/partials/head.html, locate the line of code that\nloads the stylesheet. Add this line above the stylesheet link to load the\nassets/css/style.css file:\n\n»| {{ $css := resources.Get \"css/style.css\" }}  \n---|---  \n​ | <link rel=​ _\"stylesheet\"_ ​ href=​ _\"{{ \"_ ​css​**/** ​style​**.** ​css​**\"** ​ ​**|** ​ relURL ​**}}\"** ​>  \n  \nThe resources.Get function uses the assets directory as its base path. The\ncontents of the file are read in to the $css variable.\n\nTo use the CSS file, modify the stylesheet link to use the $css variable:\n\n​ | <link rel=​ _\"stylesheet\"_ ​ href=​ _\"{{ $css.RelPermalink }}\"_ ​>  \n---|---  \n  \nThe $css.RelPermalink piece writes the file to your site’s public/css/\ndirectory and places the proper relative URL into the HTML document.\n\nStart your server with hugo server and visit your home page again to ensure\nyour styles still work.\n\nNow that you’re pulling the CSS in with resources.Get, you can apply some\ntransformations to the file.\n\n### Minifying and Fingerprinting Your CSS\n\nIt’s common practice to minify front-end content. This removes non-printable\ncharacters and comments, resulting in smaller files that transfer faster.\n\nIn addition, you can fingerprint your assets. When you serve up your\nstylesheet, your browser will cache it. When you update the page, your browser\nmight not notice the changes unless you clear your local cache. One way to get\naround that is by using fingerprinting to create a unique filename for your\nCSS files that gets updated every time you make changes.\n\nHugo supports both minification and fingerprinting when you use the\nresources.Get function. You can pipe the resource to the minify and\nfingerprint functions. Modify the resources.Get line to do just that:\n\n»|  {{ $css := resources.Get \"css/style.css\" | minify | fingerprint }}  \n---|---  \n​ |  <link rel=​ _\"stylesheet\"_ ​ href=​ _\"{{ \"_ ​css​**/** ​style​**.** ​css​**\"** ​ ​**|** ​ relURL ​**}}\"** ​>  \n  \nThis results in a file with a name like\n/css/style.min.a939605b22...815d1.css\". Its contents are minified, and the\nfilename will change when you change the contents. Because Hugo is managing\nall of this, you don’t have to think about it.\n\n### Using Sass\n\nSass is a CSS preprocessor that offers advanced features. With Sass, you can\nbreak up your CSS into manageable chunks, define variables, and perform math.\nWhile some of these features are making their way into browsers, Sass is a\npopular choice for building front-end sites.\n\nFirst, rename themes/basic/assets/css/style.css to\nthemes/basic/assets/css.style.scss:\n\n​ | ​$ ​​**mv** ​​**** ​​**themes/basic/assets/css/style.css** ​​**** ​​**themes/basic/assets/css/style.scss** ​  \n---|---  \n  \nThe scss syntax of Sass is a superset of CSS, so a CSS file is already a valid\nSass file.\n\nTo use this file, update the filename and introduce the toCSS function into\nthe pipeline, in front of the minify function:\n\n[assets/portfolio/themes/basic/layouts/partials/head.html](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/themes/basic/layouts/partials/head.html)\n\n​ | {{ $css := resources.Get \"css/style.scss\" | toCSS | minify | fingerprint }}  \n---|---  \n  \nThis gets things working, and you can now integrate many of Sass’s features\ninto your styles.\n\nFor a quick example, let’s extract the styles for the navbar into its own file\nso it’ll be easier to manage.\n\nCreate the file themes/basic/assets/css/_navbar.scss. The underscore denotes\nthat this is a Sass partial which you can include into a main Sass stylesheet.\n\nSwitch to styles.scss and locate the styles related to the navigation bar:\n\n​ | nav {  \n---|---  \n​ |  display: flex;  \n​ |  flex-direction: column;  \n​ | }  \n​ | nav > a {  \n---|---  \n​ |  flex: 1;  \n​ |  text-align: center;  \n​ |  text-decoration: none;  \n​ |  color: #fff;  \n​ | }  \n  \nRemember that one of the styles for the navigation bar is within a media query\nwith some other styles:\n\n​ | ​**@media** ​ only screen and (min-width: 768px) {  \n---|---  \n»|  nav { flex-direction: row; }  \n​ |   \n​ |  .project-container { display: flex; }  \n​ |   \n​ |  .project-container .project-list { width: 20%; }  \n​ |   \n​ |  .project-container .project { flex: 1; }  \n​ | }  \n  \nCut these style rules from the file and paste them into the _navbar.scss file.\nCreate a new media query also. Your file will look like this when you’re done:\n\n[assets/portfolio/themes/basic/assets/css/_navbar.scss](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/themes/basic/assets/css/_navbar.scss)\n\n​ | nav {  \n---|---  \n​ |  display: flex;  \n​ |  flex-direction: column;  \n​ | }  \n​ |   \n​ | nav > a {  \n​ |  flex: 1;  \n​ |  text-align: center;  \n​ |  text-decoration: none;  \n​ |  color: #fff;  \n​ | }  \n​ |   \n​ | ​**@media** ​ only screen ​**and** ​ (min-width: 768px) {  \n​ |  nav { flex-direction: row; }  \n​ | }  \n  \nThen, back in the style.scss file, add an import statement, which will pull\nthe _navbar.scss file’s contents into the main stylesheet when Hugo builds\nyour site:\n\n[assets/portfolio/themes/basic/assets/css/style.scss](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/themes/basic/assets/css/style.scss)\n\n​ | nav, footer {  \n---|---  \n​ |  background-color: #333;  \n​ |  color: #fff;  \n​ |  text-align: center;  \n​ | }  \n​ |   \n»| ​**@import** ​ ​ _'navbar'_ ​;  \n  \nSave all of your changes. You now have a path forward to creating more complex\nand organized stylesheets for your site.\n\nYou haven’t done too much with images in this book yet, but that’s about to\nchange. Hugo has some fantastic features for working with images that you’ll\nexplore next.\n\n\n## Managing Images\n\nUp until now, you’ve used placeholder images in your pages, but you’re going\nto want to place images in your blog posts, or screenshots of your projects.\nAnd you might even want an image on your home page. Hugo offers a few options\nfor managing images: you can host images externally and link to them, you can\nplace them in the static folder like you did with CSS files, or you can create\na resource bundle and keep images with their associated content.\n\nYou already brought in images from an external site in Chapter 3, [​ _Adding\nContent Sections_ ​](f_0024.xhtml#chp.content.sections). If your images are\nhosted elsewhere, you can use that same approach.\n\nTo link to images in the static folder of your theme or your site, use a\nstandard <img> tag with a site-relative URL. This works in both your layouts\nand in your Markdown content.\n\nTest this out by adding a local image to your site’s footer. In the companion\nfiles for this book, you’ll find an images directory. Copy the hugo-logo-\nwide.svg file from that directory to your site’s static directory. You could\nalso place it in the static directory within your theme. Either way, you’ll\naccess the file the same way, as the static directories are merged together.\n\nWith the file in place, open your theme’s footer partial at\nthemes/basic/layouts/partials/footer.html and add the following code to\ninclude the image with a link to the official Hugo website:\n\n[assets/portfolio/themes/basic/layouts/partials/footer.html](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/themes/basic/layouts/partials/footer.html)\n\n​ | <footer>  \n---|---  \n​ |  <small>Copyright {{now.Format \"2006\"}} Me.</small>  \n»|  <p>Powered by<br>  \n»|  <a href=​ _\"https://gohugo.io\"_ ​>  \n»|  <img src=​ _\"{{ \"_ ​hugo-logo-wide​**.** ​svg​**\"** ​ ​**|** ​ relURL\n​**}}\"** ​ width=​ _\"128\"_ ​ height=​ _\"38\"_ ​>  \n»|  </a>  \n»|  </p>  \n​ | </footer>  \n  \nEven though the image is located at /static/hugo-logo-wide.svg, you don’t\nspecify the static part of the path to the file, as the contents of the static\nfolder are copied to the root of the site. Using the relURL function ensures\nthat the paths are generated relative to the page.\n\nSave the file. When you load the page in your browser, the Hugo logo appears\nin the footer:\n\n![images/assets/hugologo.png](Images/hugologo.png)\n\nIf you’re going to store more images in the static folder, you’ll probably\nwant better organization. Create an images folder to store your images, and\nthen include images in your image paths.\n\nImages in the static folder are available in your content pages as well. When\nyou’re working in Markdown documents, you include an image using Markdown’s\nimage syntax like this:\n\n​ | ![Text description of image](​ _/path/to/image.png_ ​)  \n---|---  \n  \nHowever, if you’re going to include images in your Markdown content, Hugo has\na better way, which will give you access to powerful functions to transform\nimages: page bundles.\n\n### Using Page Bundles to Organize Content\n\nUp until now, each piece of content you’ve created is a Markdown file with a\nname that somewhat resembles its title. But you can also create a page bundle,\nwhich is a collection of content files, including images, PDF files, or any\nother type of asset you want to keep close to your content. A page bundle is a\nfolder inside of your content section, rather than an individual file.\n\nTo test this out, add a fourth blog post to your site. This post will contain\na few images in addition to the text, and by using a page bundle, you’ll be\nable to keep those images in the same location as the text, making the content\neasier to organize.\n\nUse the hugo new command to create the page bundle:\n\n​ | ​$ ​​**hugo** ​​**** ​​**new** ​​**** ​​**posts/my-vacation/index.md** ​  \n---|---  \n​ | /Users/brianhogan/portfolio/content/posts/my-vacation/index.md created  \n  \nNotice that instead of calling the post my-vacation.md, you’re specifying my-\nvacation as part of the path, and specifying a file named index.md. Hugo\ncreates the following structure:\n\n​ | content/posts/  \n---|---  \n​ | ├── first-post.md  \n»| ├── my-vacation  \n»| │ └── index.md  \n​ | ├── second-post.md  \n​ | └── third-post.md  \n  \nThis new my-vacation folder is where all of the assets associated with your\npost will go. Create a new images folder inside of this folder using your IDE\nor the following Terminal command:\n\n​ | ​$ ​​**mkdir** ​​**** ​​**content/posts/my-vacation/images** ​  \n---|---  \n  \nIn the companion files you downloaded for this book, you’ll find three photos\nin the images folder: badlands.jpg, rushmore.jpg, and bison.jpg. Copy all\nthree of these photos to the content/posts/my-vacation/images folder.\n\nOpen portfolio/content/posts/my-vacation/index.md and add the following\ncontent:\n\n[assets/portfolio/content/posts/my-\nvacation/index.md](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/content/posts/my-\nvacation/index.md)\n\n​ | ​**\\---** ​  \n---|---  \n​ | title: ​ _\"_ ​​ _My_ ​ ​ _Vacation\"_ ​  \n​ | date: ​ _2020-01-02T12:45:51-06:00_ ​  \n​ | draft: false  \n​ | author: ​ _Brian Hogan_ ​  \n​ | categories:  \n​ | \\- ​ _Personal_ ​  \n​ | tags:  \n​ | \\- ​ _family_ ​  \n​ | year: ​ _\"_ ​​ _2020\"_ ​  \n​ | month: ​ _\"_ ​​ _2020/01\"_ ​  \n​ |   \n​ | ​**\\---** ​  \n​ | Here are pictures from my recent trip to South Dakota.  \n  \nNow, include one of the images in your document. But instead of using a\nregular <img> tag, you’ll use a <figure> tag, which lets you associate an\nimage with a caption. Here’s what that might look like, but don’t add this\ncode to your page, as Hugo doesn’t support raw HTML code in Markdown\ndocuments:\n\n​ | <figure>  \n---|---  \n​ |  <img src=​ _\"images/rushmore.jpg\"_ ​ width=​ _\"600\"_ ​> <figcaption>  \n​ |  <h4>Mount Rushmore</h4>  \n​ |  </figcaption>  \n​ | </figure>  \n  \nInstead of typing that code, you’ll use a shortcode, which is a way for you to\nextend Hugo’s Markdown capabilities. Shortcodes are functions powered by Go’s\ntemplating mechanism that you can use in your Markdown. You call them and pass\nthem options, and they generate output. Hugo has built-in shortcodes for\nadding code snippets, YouTube videos, and of course, figures. Add this code to\nyour file:\n\n​ | {{< figure src=​ _\"images/rushmore.jpg\"_ ​ width=​ _\"600\"_ ​  \n---|---  \n​ |  alt=​ _\"Mount Rushmore\"_ ​ title=​ _\"Mount Rushmore\"_ ​ >}}  \n  \nThis generates the <figure> element, the caption, and the alternative text\njust as if you’d entered them manually.\n\nThe image you’ve added is quite large, though. You’ll tackle that properly in\nthe next section. For now, add a CSS rule for images inside of figures that\nresizes the images appropriately for different devices:\n\n[assets/portfolio/themes/basic/assets/css/style.scss](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/themes/basic/assets/css/style.scss)\n\n​ | figure img {  \n---|---  \n​ |  max-width: 100%;  \n​ |  height: auto;  \n​ | }  \n  \nWith this style rule in place, the image will stay within the container:\n\n![images/assets/rushmore_figure.png](Images/rushmore_figure.png)\n\nIt will also scale down on smaller screens:\n\n![images/assets/rushmore_figure_small.png](Images/rushmore_figure_small.png)\n\nHugo’s built-in shortcodes are great for incorporating assets into your posts,\nbut you can write your own shortcodes to have even more control over your\nassets.\n\n### Using a Shortcode to Process Images\n\nWhen you’re working with images for the web, you often need to resize them so\nthey’re smaller, or perform other processing tasks. Hugo has built-in methods\nfor altering images, provided they’re defined as page resources. Anything in\nyour page bundle is automatically a page resource, so that means Hugo can\nmanipulate the images you’ve copied into the my-vacation folder.\n\nIn a nutshell, Hugo makes it possible to do something like this with an image:\n\n​ | {{ $image := $.Page.Resources.Get(\"path/to/image.jpg\"}}  \n---|---  \n​ | {{ $smallImage := $image.Resize \"1024x\" }}  \n​ | <img src=\"{{ $smallImage }}\" width=\"{{ $smallImage.Width }}\"  \n​ |  height=\"{{ $smallImage.Height }}\">  \n  \nWhen Hugo builds your site, it creates a new resized image, rather than the\noriginal high-resolution one you supplied. There are many other image\nprocessing functions[[35]](f_0064.xhtml#FOOTNOTE-35) for resampling, cropping,\nand fitting images into your pages. In addition, there are other image\nfunctions[[36]](f_0064.xhtml#FOOTNOTE-36) that let you control brightness,\ngamma, contrast, and color.\n\nUnfortunately, you can’t take advantage of these features directly in your\ncontent pages, as their functionality is only available within Hugo’s layouts.\n\nTo get around that, you can create your own shortcodes. Shortcodes let you do\nthings in your Markdown content that you’d normally only be able to do in your\nlayouts. With a shortcode, you can use conditional logic, page variables, and\nof course, process images. To create your own shortcode, create a shortcodes\ndirectory in the layouts directory of your theme or site, create an HTML file\nwith the name of the shortcode, and write the code that you want to execute\nwhen you invoke the shortcode in your Markdown.\n\nLet’s create a shortcode called postimage that will accept an image and some\nalternative text. It’ll generate a <figure> element with a caption. It’ll\nautomatically resize the image, but also create a link to the original image,\nso your readers can access the larger image by clicking the smaller version.\n\nFirst, create a shortcodes directory in the layouts dfirectory of your theme.\nThe following terminal command can do that for you:\n\n​ | ​$ ​​**mkdir** ​​**** ​​**themes/basic/layouts/shortcodes** ​  \n---|---  \n  \nThen, create the file themes/basic/layouts/shortcodes/postimage.html and add\nthe following code to get a reference to an image and create a smaller version\nof the image:\n\n[assets/portfolio/themes/basic/layouts/shortcodes/postimage.html](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/themes/basic/layouts/shortcodes/postimage.html)\n\n​ | {{ $image := $.Page.Resources.GetMatch (.Get 0)}}  \n---|---  \n​ | {{ $smallImage := $image.Resize \"1024x\" }}  \n  \nThe (.Get 0) piece gives you access to the first argument, which will be the\nimage’s filename. Once you have the image reference, you create the smaller\nversion using the .Resize function. Passing the width only will tell Hugo to\nkeep the aspect ratio of the image so that you won’t end up with a distorted\nimage or have to determine the aspect ratio yourself.\n\nNow, add this code to create the figure element with the hyperlink, image tag,\nand caption:\n\n[assets/portfolio/themes/basic/layouts/shortcodes/postimage.html](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/themes/basic/layouts/shortcodes/postimage.html)\n\n​ | <figure class=​ _\"post-figure\"_ ​>  \n---|---  \n​ |  <a href=​ _\"{{ $image.RelPermalink }}\"_ ​>  \n​ |  {{ with $smallImage }}  \n​ |  <img src=​ _\"{{ .RelPermalink }}\"_ ​  \n​ |  width=​ _\"{{ .Width }}\"_ ​ height=​ _\"{{ .Height }}\"_ ​  \n​ |  alt=​ _\"{{ $.Get 1 }}\"_ ​ />  \n​ |  {{ end }}  \n​ |  </a>  \n​ |  <figcaption>{{ .Get 1 }}</figcaption>  \n​ | </figure>  \n  \nThe .Get 1 piece fetches the second argument passed to the shortcode, which is\nthe text for the caption and the image’s alternative text. The {{ with\n$smallImage }} block switches the context so that you can call the Width and\nHeight functions without having to prefix them each with $smallImage. It’s not\nnecessary, but it saves keystrokes. Since the context has changed, you must\nprefix .Get 1 with a dollar sign ($), so you can reach outside of the current\nscope.\n\nSave the file and open the blog post again (content/my-vacation/index.md).\nReplace the existing figure with the shortcode you just created:\n\n[assets/portfolio/content/posts/my-\nvacation/index.md](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/content/posts/my-\nvacation/index.md)\n\n​ | {{< postimage ​**\"** ​images​**/** ​rushmore​**.** ​jpg​**\"** ​ ​**\"** ​Mount Rushmore​**\"** ​ >}}  \n---|---  \n  \nWhen you reload the page, you won’t see any differences at first, but you can\nnow click each image to see the full-sized version. Hugo performed the smaller\nversion of the image when it generated the page. If you view the page’s\nsource, you’ll see that it’s now referencing both the small and large images:\n\n​ | <figure class=​ _\"post-figure\"_ ​>  \n---|---  \n​ |  <a href=​ _\"/posts/2020/01/my-vacation/images/rushmore.jpg\"_ ​>  \n​ |   \n​ |  <img src=​ _\"/posts/2020/01/my-vacation/images/rushmore_...resize_q75_box.jpg\"_ ​  \n​ |  width=​ _\"1024\"_ ​ height=​ _\"686\"_ ​  \n​ |  alt=​ _\"Mount Rushmore\"_ ​ />  \n​ |  </a>  \n​ |  <figcaption>Mount Rushmore</figcaption>  \n​ | </figure>  \n  \nAdd the badlands.jpg and bison.jpg images the same way:\n\n[assets/portfolio/content/posts/my-\nvacation/index.md](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/content/posts/my-\nvacation/index.md)\n\n​ | {{< postimage ​**\"** ​images​**/** ​badlands​**.** ​jpg​**\"** ​ ​**\"** ​The Badlands​**\"** ​ >}}  \n---|---  \n​ | {{< postimage ​**\"** ​images​**/** ​bison​**.** ​jpg​**\"** ​ ​**\"** ​Bison at Custer National Park​**\"** ​ >}}  \n  \nProcessing images with Hugo can make the build process take considerably\nlonger. To keep things running quickly, Hugo caches the converted images,\nsaving them to the resources folder in the root of your site so that it\ndoesn’t have to build them all of the time. However, if you change your\nsettings or sizes, you’ll end up with extra files in the resources directory\nthat you no longer need. Use the hugo -gc command to build the site and clean\nup cached files.\n\nHugo does a great job of helping you manage your styles and images. Now let’s\nexplore how to manage JavaScript files.\n\n\n## Bundling JavaScript Files\n\nWhen you built the search for your site, you used JavaScript libraries hosted\non a CDN. This requires your browser to make additional requests to fetch\nthose libraries. Hugo can combine all of your scripts into a single minified\nfile, and you can fingerprint the file just like you did with your\nstylesheets. Sometimes this is preferable, as you’ll have all your project’s\ndependencies under your control.\n\nTo make this work, first move the js folder from the static directory of your\nsite to the assets directory, just like you’ve done with stylesheets. You can\ndo this in your editor, or from the command-line interface like this:\n\n​ | ​$ ​​**mv** ​​**** ​​**themes/basic/static/js** ​​**** ​​**themes/basic/assets/js** ​  \n---|---  \n  \nThen, download Lunr and Axios and place them in the assets/js directory, but\nbe sure to grab the full unminified versions. You can use the curl command-\nline tool to download these files or visit the URLs in your browser and save\nthe files that way:\n\n​ | ​$ ​​**cd** ​​**** ​​**themes/basic/assets/js** ​  \n---|---  \n​ | ​$ ​​**curl** ​​**** ​​**https://unpkg.com/lunr@2.3.6/lunr.js** ​​**** ​​**>** ​​**** ​​**lunr.js** ​  \n​ | ​$ ​​**curl** ​​**** ​​**https://unpkg.com/axios@0.19.0/dist/axios.js** ​​**** ​​**>** ​​**** ​​**axios.js** ​  \n​ | ​$ ​​**cd** ​​**** ​​**-** ​  \n  \nYou’ll also find these files in the assets/portfolio/themes/basic/assets\ndirectory of the book’s companion files.\n\nOpen themes/basic/layouts/_default/search.html and remove the existing script\ntags. Replace them with these lines that load Lunr, Axios, and your search.js\nfile:\n\n​ | {{ $lunr := resources.Get \"js/lunr.js\" }}  \n---|---  \n​ | {{ $axios := resources.Get \"js/axios.js\" }}  \n​ | {{ $search := resources.Get \"js/search.js\" }}  \n  \nThe resources.Concat function takes a list of resources (known as a Slice in\nGo) and combines them into the file you specify. Add these lines to\nconcatenate, minify, and fingerprint the output file:\n\n​ | {{ $libs := slice $lunr $axios $search }}  \n---|---  \n​ | {{ $js := $libs | resources.Concat \"js/app.js\" | minify | fingerprint }}  \n​ | <script src=​ _\"{{ $js.RelPermalink }}\"_ ​></script>  \n  \nSave the file and restart your Hugo server. Revisit your search page at\nhttp://localhost:1313/search and ensure it still works.\n\nHugo’s asset pipeline is a fantastic feature, and you can get pretty far with\nit, but front-end development can get a lot more complex than concatenation\nand minification. You’ll likely want to use more complex JavaScript build\nprocesses for those casses.\n\n\n## Using Webpack and npm with Hugo\n\nHugo tries hard to draw boundaries between what it does and what other\nprograms should do. While Hugo can minify, concatenate, and fingerprint\nJavaScript files, it doesn’t have support for more advanced JavaScript\ndevelopment, like import statements and transpilation.\n\nWebpack is one of the most popular tools for managing and building front-end\napplications. It’s powered by Node.js, and as a result, you’ll be able to use\nnpm, the package manager for Node.js, to manage all of the dependencies for\nyour project, including Lunr, Axios, and Webpack. You’ll also be able to use\nnpm to create a more automated way of building your site.\n\nTo get started, create a package.json file. This file lets you track\nJavaScript dependencies and define tasks to build your site. You can create\nthis file with the npm init command and fill in the details, but it’s quicker\nto create the file manually. First, stop your Hugo server with Ctrl-c.\n\nCreate the package.json file in the root of your Hugo project and add the\nfollowing JSON content to the file:\n\n​ | {  \n---|---  \n​ |  ​ _\"name\"_ ​: ​ _\"portfolio\"_ ​,  \n​ |  ​ _\"version\"_ ​: ​ _\"1.0.0\"_ ​,  \n​ |  ​ _\"description\"_ ​: ​ _\"My portfolio\"_ ​,  \n​ |  ​ _\"private\"_ ​: ​**true** ​,  \n​ |  ​ _\"scripts\"_ ​: {  \n​ |  ​ _\"build\"_ ​: ​ _\"hugo --cleanDestinationDir\"_ ​  \n​ |  }  \n​ | }  \n  \nThis specifies the name of the project, the version, and a brief description.\nThe \"private\": true line ensures you can’t accidentally publish your code to a\npackage repository. The \"scripts” section lets you specify scripts you’d like\nto run. This defines a build command that runs Hugo with the\n\\--cleanDestinationDir argument, so the public directory is always cleared\nout.\n\nSave the file, exit your editor, and use npm to build the site. Prefix the\nname of the script with run, like this:\n\n​ | ​$ ​​**npm** ​​**** ​​**run** ​​**** ​​**build** ​  \n---|---  \n  \nThe site builds just like it did before, but now you don’t have to remember to\nadd the \\--cleanDestinationDir option—and you can add additional configuration\noptions here as well.\n\nAdd another script that runs the development server with the\n\\--disableFastRender option so that nothing gets cached. Be sure to add a\ncomma to the end of the line with the build task or your JSON file won’t be\nvalid:\n\n​ | ​ _\"build\"_ ​: ​ _\"hugo --cleanDestinationDir\"_ ​,  \n---|---  \n​ | ​ _\"hugo-server\"_ ​: ​ _\"hugo server --disableFastRender\"_ ​  \n  \nSave the file and run the development server:\n\n​ | ​$ ​​**npm** ​​**** ​​**run** ​​**** ​​**hugo-server** ​  \n---|---  \n  \nThe server starts up. Press Ctrl-c to stop the server.\n\nNow, let’s get Webpack working. Add Webpack and its CLI as development\ndependencies:\n\n​ | ​$ ​​**npm** ​​**** ​​**install** ​​**** ​​**\\--save-dev** ​​**** ​​**webpack** ​​**** ​​**webpack-cli** ​  \n---|---  \n  \nWhile you’re installing dependencies, install Lunr and Axios as project\ndependencies as well. Use the \\--save flag instead of \\--save-dev as these are\ndependencies you’ll need for production, not just for development purposes:\n\n​ | ​$ ​​**npm** ​​**** ​​**install** ​​**** ​​**\\--save** ​​**** ​​**axios** ​​**** ​​**lunr** ​  \n---|---  \n  \nYou can now remove the themes/basic/assets/js/lunr.js and\nthemes/basic/assets/js/axios.js files from your project:\n\n​ | ​$ ​​**rm** ​​**** ​​**themes/basic/assets/js/lunr.js** ​  \n---|---  \n​ | ​$ ​​**rm** ​​**** ​​**themes/basic/assets/js/axios.js** ​  \n  \nWebpack can use a configuration file that lets you define how it should build\nyour project. Create a webpack.config.js file in the root of your Hugo site.\nAdd this code which looks for an index.js file in themes/basic/assets/js and\ngenerates the output in themes/basic/assets/js/app.js:\n\n[assets/portfolio/webpack.config.js](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/webpack.config.js)\n\n​ | ​**const** ​ path = require(​ _'path'_ ​);  \n---|---  \n​ |   \n​ | module.exports = {  \n​ |  entry: ​ _'./themes/basic/assets/js/index.js'_ ​,  \n​ |  output: {  \n​ |  filename: ​ _'app.js'_ ​,  \n​ |  path: path.resolve(__dirname, ​ _'themes'_ ​,​ _'basic'_ ​,​ _'assets'_ ​, ​ _'js'_ ​)  \n​ |  }  \n​ | };  \n  \nBy putting the resulting file in the assets folder, you can still use Hugo’s\nminifier and fingerprinter. If, however, you plan to use other Webpack plugins\nto do this work, place the output in static/js instead. Hugo will still see it\nand use it. Just be sure to modify the path where Hugo looks for the file in\nyour search.html template.\n\nNext, move themes/basic/assets/search.js to themes/basic/assets/js/index.js.\nThis file will now become the entrypoint for Webpack:\n\n​ | ​$ ​​**mv** ​​**** ​​**themes/basic/assets/js/search.js** ​​**** ​​**themes/basic/assets/js/index.js** ​  \n---|---  \n  \nOpen the file and import Axios and Lunr at the top of the file:\n\n[assets/portfolio/themes/basic/assets/js/index.js](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/themes/basic/assets/js/index.js)\n\n​ | ​ _'use strict'_ ​  \n---|---  \n​ |   \n»| ​**import** ​ axios ​**from** ​ ​ _'axios'_ ​;  \n»| ​**import** ​ lunr ​**from** ​ ​ _'lunr'_ ​;  \n  \nNow integrate the file that Webpack will generate into your layout. Open\nthemes/basic/layouts/_default/search.html and remove these lines, since\nWebpack is now loading and assembling the files:\n\n​ | {{ $lunr := resources.Get \"js/lunr.js\" }}  \n---|---  \n​ | {{ $axios := resources.Get \"js/axios.js\" }}  \n​ | {{ $search := resources.Get \"js/search.js\" }}  \n​ | {{ $libs := slice $lunr $axios $search }}  \n  \nThen modify the $js line so it only pulls in the app.js file that Webpack will\ngenerate:\n\n[assets/portfolio/themes/basic/layouts/_default/search.html](http://media.pragprog.com/titles/bhhugo/code/assets/portfolio/themes/basic/layouts/_default/search.html)\n\n​ | {{ $js := resources.Get \"js/app.js\" | minify | fingerprint }}  \n---|---  \n​ | <script src=​ _\"{{ $js.RelPermalink }}\"_ ​></script>  \n  \nSave the file.\n\nYou’ll need to run Webpack to build the app.js file before you run the Hugo\nserver. If you don’t do this, Hugo will fail to build the site because it\nwon’t be able to find the app.js file in the assets folder.\n\nWebpack is installed as a dependency of this project, rather than installed\nglobally. To run it, you’d have to run the command node\nnode_modules/webpack/bin/webpack.js. But since that’s a lot to type, you can\nuse the scripts section of package.json to create a shorter commmand.\n\nOpen the package.json file and locate the scripts section. As you learned\nearlier, this section lets you define scripts you want to run. You already\nhave a build command which builds the site with Hugo. Add a new webpack\ncommand which runs webpack:\n\n​ | ​ _\"scripts\"_ ​: {  \n---|---  \n​ |  ​ _\"build\"_ ​: ​ _\"hugo --cleanDestinationDir\"_ ​,  \n​ |  ​ _\"hugo-server\"_ ​: ​ _\"hugo server --disableFastRender\"_ ​,  \n​ |  ​ _\"webpack\"_ ​: ​ _\"webpack\"_ ​  \n​ |  }  \n  \nBe sure to add a comma to the end of the hugo-server line so that your JSON is\nvalid.\n\nSince you’ve added Webpack as a dependency of your project, you can use it in\nthe scripts section without needing to specify its path.\n\nYou can now run npm run webpack to build the app.js file:\n\n​ | ​$ ​​**npm** ​​**** ​​**run** ​​**** ​​**webpack** ​  \n---|---  \n​ | ​>​​**** ​​**portfolio@1.0.0** ​​**** ​​**webpack** ​​**** ​​**/Users/brianhogan/portfolio** ​  \n​ | ​>​​**** ​​**webpack** ​  \n​ |   \n​ | Hash: dbc9c6b673dd8cde7dd0  \n​ | Version: webpack 4.41.2  \n​ | Time: 315ms  \n​ | Built at: 01/02/2020 8:45:15 PM  \n​ |  Asset Size Chunks Chunk Names  \n​ | app.js 45.6 KiB 0 [emitted] main  \n​ | Entrypoint main = app.js  \n​ | [11] ./themes/basic/assets/js/index.js 1.42 KiB {0} [built]  \n​ |  \\+ 28 hidden modules  \n  \nOnce Webpack completes, you can build the site or start the development\nserver.\n\nHugo’s development server watches files for changes, but it can’t trigger\nexternal build tools like Webpack. You have two options at your disposal. The\nfirst option is to use two terminal windows. Have Hugo’s server running in one\nwindow and run Webpack in the other window using its watch option. Add a new\nscript to your package.json file named webpack-watch:\n\n​ | ​ _\"scripts\"_ ​: {  \n---|---  \n​ |  ​ _\"build\"_ ​: ​ _\"hugo --cleanDestinationDir\"_ ​,  \n​ |  ​ _\"hugo-server\"_ ​: ​ _\"hugo server --disableFastRender\"_ ​,  \n​ |  ​ _\"webpack\"_ ​: ​ _\"webpack\"_ ​,  \n​ |  ​ _\"webpack-watch\"_ ​: ​ _\"webpack --watch\"_ ​,  \n​ | },  \n  \nOpen a new terminal window and navigate to your project directory. Run npm run\nwebpack-watch and it’ll run, waiting for any changes to your files. When it\nsees changes, it will generate the new file. The Hugo dev server will then see\nthe app.js file change, which will trigger a rebuild of the Hugo site.\n\nJuggling two terminal windows isn’t ideal, so you can create task that runs\nboth servers in parallel using a single command. To do that, install the npm-\nrun-all module, which lets you run multiple tasks in serial or parallel on all\noperating systems.\n\nInstall the module as a development dependency:\n\n​ | ​$ ​​**npm** ​​**** ​​**install** ​​**** ​​**\\--save-dev** ​​**** ​​**npm-run-all** ​  \n---|---  \n  \nThen create a new task called dev which runs Webpack and Hugo’s servers:\n\n​ | ​ _\"scripts\"_ ​: {  \n---|---  \n​ |  ​ _\"build\"_ ​: ​ _\"hugo --cleanDestinationDir\"_ ​,  \n​ |  ​ _\"hugo-server\"_ ​: ​ _\"hugo server --disableFastRender\"_ ​,  \n​ |  ​ _\"webpack\"_ ​: ​ _\"webpack\"_ ​,  \n​ |  ​ _\"webpack-watch\"_ ​: ​ _\"webpack --watch\"_ ​,  \n​ |  ​ _\"dev\"_ ​: ​ _\"npm-run-all webpack --parallel webpack-watch hugo-server\"_ ​  \n​ | },  \n  \nThis new dev task runs Webpack by itself first to ensure that the app.js file\nis created. It then runs the webpack-watch and hugo-server tasks you defined.\n\nFinally, the build task currently just builds the site with Hugo. Rename that\ntask to hugo-build and add a new build task that runs Webpack and Hugo\nsequentially:\n\n​ | ​ _\"build\"_ ​: ​ _\"npm-run-all webpack hugo-build\"_ ​,  \n---|---  \n​ | ​ _\"hugo-build\"_ ​: ​ _\"hugo --cleanDestinationDir\"_ ​,  \n  \nYou now have an integrated solution for using Webpack and Hugo together, as\nwell as a build system.\n\n\n## Your Turn\n\nYou’ve explored several ways Hugo helps you manage your sites’ assets. Try\nthese additional exercises to practice these concepts:\n\n  1. Break your styles apart more by making the styles associated with project pages their own partial.\n\n  2. Use Sass variables to store your color values instead of hard-coding them throughout your stylesheets.\n\n  3. Read the Responsive Images[[37]](f_0064.xhtml#FOOTNOTE-37) article on the Mozilla Developer Network site. Modify the postimage shortcode to implement the concepts in that article.\n\n  4. Now that you have Webpack working, explore using Vue or React for your search instead of vanilla JavaScript.\n\n\n## Wrapping Up\n\nHugo gives you everything you need to concatenate, minify, and fingerprint\nyour styles and scripts. Now that you have incorporated these features into\nthe site, your visitors will see faster download times, and you will ensure\nthey will not be stuck with out-of-date versions of your styles and scripts\nwhen you make future updates. Hugo’s image manipulation functions, along with\nshortcodes, make managing assets much less complex, which means much less\neffort is required for you to create content with images. And when Hugo isn’t\nenough, you now know how to integrate a Webpack-based workflow into your Hugo\nsite.\n\nThere’s a lot more you can do to your site, but you’ve tinkered enough for\nnow; it’s time to share it with the world. In the next chapter you’ll look at\na few options to deploy your site.\n\n#### Footnotes\n\n[[34]](f_0058.xhtml#FNPTR-34)\n\n    \n\n<https://webpack.js.org/>\n\n[[35]](f_0060.xhtml#FNPTR-35)\n\n    \n\n<https://gohugo.io/content-management/image-processing/>\n\n[[36]](f_0060.xhtml#FNPTR-36)\n\n    \n\n<https://gohugo.io/functions/images/>\n\n[[37]](f_0063.xhtml#FNPTR-37)\n\n    \n\n<https://developer.mozilla.org/en-\nUS/docs/Learn/HTML/Multimedia_and_embedding/Responsive_images>\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  Chapter 8  \nDeploying the Site\n\nYour site is ready for the world to see, and since everything Hugo produces is\ncompletely static content, the only requirement you have is an existing web\nserver. At the most basic level, you can take the contents of the public\ndirectory and place them in your existing web server’s web root directory.\n\nHowever, copying the data directly to your web server isn’t the only way to\nbring your site online quickly; there are other, more automated options. For\nexample, you can use a script that automates pushing your code to a production\nserver, you can use a hosting service with built-in continuous integration,\nyou can transfer your site to cloud storage, or you can use containers to\npackage your site into something you can deploy to a Docker host.\n\nAll of these options have their pros and cons. Ultimately, how you deploy your\nsite depends entirely on what you have available—and because this book can’t\ncover everything—this chapter will cover two specific scenarios and a more\ngeneral approach.\n\nYou’ll start by deploying your site to\nNetlify,[[38]](f_0070.xhtml#FOOTNOTE-38) a service that hosts static websites.\nNetlify is a great option for people who don’t have a background in deployment\nand want to get things running quickly and securely.\n\nFrom there, you’ll move on to deploying your site to Amazon’s S3 cloud storage\nusing Hugo’s built-in deploy command. If you’re already familiar with hosting\nstatic sites on S3, this is a fantastic option.\n\nFinally, you’ll look at deploying your site to more traditional web hosts like\nshared hosting providers, cloud servers, or your own internal servers.\n\n\n## Deploying to Netlify\n\nNetlify is a commercial platform for hosting static websites and single page\napplications. To deploy to Netlify, you need to push your code to a remote Git\nrepository. But first, you need to set up a local Git repository and get\nversion control in place. Once that’s done, you’ll push your local repository\nto a remote repository so you can integrate it with other services.\n\nIf you don’t have Git installed locally, follow the installation instructions\non the official Git website.[[39]](f_0070.xhtml#FOOTNOTE-39) Then, follow the\ninstructions they provide to configure your\nclient.[[40]](f_0070.xhtml#FOOTNOTE-40)\n\nOnce Git is installed, navigate to your project directory and run the git init\ncommand to convert your directory into a new Git repository:\n\n​ | ​$ ​​**git** ​​**** ​​**init** ​  \n---|---  \n  \nYour Git repository should only contain the code and files for your site,\nwhich means you won’t include the node_modules and public directories in your\nrepository. You can specify files to ignore in a file named .gitignore.\n\nCreate a .gitignore file in the root of your project that excludes the\nfollowing folders:\n\n[deploy/portfolio/.gitignore](http://media.pragprog.com/titles/bhhugo/code/deploy/portfolio/.gitignore)\n\n​ | # exclude JS dependencies  \n---|---  \n​ | node_modules  \n​ |   \n​ | # exclude Hugo's output  \n​ | public  \n  \nSave the .gitignore file, and then add the rest of the files to your\nrepository:\n\n​ | ​$ ​​**git** ​​**** ​​**add** ​​**** ​​**.** ​  \n---|---  \n  \nThis adds all of the files in the current directory and all child directories,\nexcept for those you’ve ignored.\n\nKeep Hugo With Your Site  \n---  \n![images/aside-icons/tip.png](Images/tip.png) |  Since Hugo is a single binary, you could copy the Hugo executable to the root folder of your project and run it from there with ./hugo, ensuring you’ll always have the version of Hugo you used to build your site. You could even check it in to version control so you can pull down everything you need later.  \n  \nAt this point, you’re ready to make your first commit:\n\n​ | ​$ ​​**git** ​​**** ​​**commit** ​​**** ​​**-m** ​​**** ​​ _\"initial import\"_ ​  \n---|---  \n  \nAlthough your files are committed locally, they won’t be available on GitHub\nuntil you create a remote repository and push your code there. Visit GitHub,\nlog in, and create a new repository named hugosite; however, don’t create a\n.gitignore or README file in this repository. If you choose to create a public\nrepository, remember that a public repository means everyone will be able to\nsee all of the code you’ve built and how you built it. Sometimes you might\nwant to keep that a secret, so you should use a private repository instead.\n\nAfter you create the remote repository, add it to your local repository as a\nremote source so you can push your code:\n\n​ | ​$ ​​**git** ​​**** ​​**remote** ​​**** ​​**add** ​​**** ​​**origin** ​​**** ​​**git@github.com:your_username/hugosite.git** ​  \n---|---  \n  \nWith the remote repository added, push your code to GitHub:\n\n​ | ​$ ​​**git** ​​**** ​​**push** ​​**** ​​**-u** ​​**** ​​**origin** ​​**** ​​**master** ​  \n---|---  \n  \nNow that your site is available, visit Netlify and log in with your GitHub\naccount. Once logged in, choose New Site from Git. Under the Continuous\nDeployment section, select GitHub. Authorize Netlify to access your account.\n\nNetlify will then inform you that it doesn’t have access to any of your\nrepositories. Click the Configure Netlify for GitHub button and give Netlify\naccess to your hugosite repository.\n\nOnce you’ve configured the GitHub side of things, you’ll return to Netlify’s\ninterface, and the hugosite repository displays in your list of repositories.\n\nSelect the hugosite repository to create your site and configure the\ndeployment settings. Under the Basic Settings section, you’ll configure the\ncommand to build your site:\n\n![images/deploy/netlify-basic.png](Images/netlify-basic.png)\n\nFor the build command, enter npm run build, the command you created in [​\n_Using Webpack and npm with Hugo_ ​](f_0062.xhtml#sec.webpack.node).\n\nSelect Advanced Settings and add an environment variable named HUGO_VERSION.\nEnter the version of Hugo you have installed on your local machine. If you are\nnot sure what version you have, you can use the hugo version command to find\nout:\n\n![images/deploy/netlify-advanced.png](Images/netlify-advanced.png)\n\nPress the Deploy Site button and wait while your site deploys. Netlify\ndownloads the appropriate version of Hugo, installs the Node modules you\nspecified in the package.json file, and runs your build command:\n\n![images/deploy/netlify-deploying.png](Images/netlify-deploying.png)\n\nAfter a few minutes, you’ll see the link to your site appear. To preview your\nsite, follow the link.\n\nYou can point your own domain name to your site by following the instructions\nprovided. Netlify will walk you through the process of purchasing a new domain\nor verifying an existing domain name. It will also walk you through securing\nyour site with a TLS certificate from Let’s\nEncrypt.[[41]](f_0070.xhtml#FOOTNOTE-41)\n\nAfter you select your domain and configure it to point to your Netlify site,\nyou need to modify the baseURL setting for your site to match the domain name\nyou’ve chosen. If you don’t, the URLs for your RSS feeds and JSON feeds you\nincluded in your site’s header won’t work properly.\n\nThere are two ways in which you can modify the baseURL setting:\n\n  * Edit the baseURL field in the config.toml file.\n  * Alter the hugo build command to specify the base URL for the site.\n\nTo change the baseURL field in config.toml, open the file in your editor, and\nreplace baseURL with your domain. Be sure to include the https:// and also\nleave a trailing slash at the end:\n\n»| baseURL = ​ _\"https://yourdomain.com/\"_ ​  \n---|---  \n​ | languageCode = ​ _\"en-us\"_ ​  \n​ | title = ​ _\"Brian's Portfolio\"_ ​  \n  \nAfter you make these changes, save the file and get ready to commit them and\npush them to GitHub.\n\nFirst, add the config.toml file using the git add command. Next, use the git\ncommit command with a commit message explaining the change you made. Finally,\nuse the git push command to push the changes to your remote repository:\n\n​ | ​**$** ​ ​**git** ​ ​**add** ​ ​**config.toml** ​  \n---|---  \n​ | ​**$** ​ ​**git** ​ ​**commit** ​ ​**-m** ​ ​**\"Set** ​ ​**the** ​ ​**base** ​ ​**URL** ​ ​**for** ​ ​**the** ​ ​**site\"** ​  \n​ | ​**$** ​ ​**git** ​ ​**push** ​ ​**origin** ​ ​**master** ​  \n  \nThe other way to change the site’s base URL is to modify the command that\nbuilds your site.\n\nOpen the package.json file in your editor and change the hugo-build script so\nthat it uses the -b switch to specify the base URL:\n\n​ |  ​ _\"scripts\"_ ​: {  \n---|---  \n​ |  ​ _\"build\"_ ​: ​ _\"npm-run-all webpack hugo-build\"_ ​,  \n»|  ​ _\"hugo-build\"_ ​: ​ _\"hugo --cleanDestinationDir -b\nhttps://yourdomain.com/\"_ ​,  \n  \nSave this file, and then add the package.json file using the git add command,\nfollowed by the commit command to commit the changes, and the push command to\npush the changes to your remote repository:\n\n​ | ​**$** ​ ​**git** ​ ​**add** ​ ​**config.toml** ​  \n---|---  \n​ | ​**$** ​ ​**git** ​ ​**commit** ​ ​**-m** ​ ​**\"Set** ​ ​**the** ​ ​**base** ​ ​**URL** ​ ​**for** ​ ​**the** ​ ​**site\"** ​  \n​ | ​**$** ​ ​**git** ​ ​**push** ​ ​**origin** ​ ​**master** ​  \n  \nBecause Netlify is watching your repository, it will notice this commit and\ntrigger a new deploy. And since you’ve committed your code to GitHub, you can\nuse all of the collaborative tools it offers. You can even create new posts\nusing GitHub’s interface, and Netlify will deploy those new pages for you.\n\nNetlify gives you a fast and configurable way to deploy your static site. The\nfree plan is good for small personal sites. However, as your site grows, so do\nyour hosting costs.\n\nLet’s explore another way to deploy your site.\n\n\n## Deploying to Cloud Storage with Hugo\n\nHugo has built-in support for deploying your site to cloud storage provided by\nAmazon S3, Google Compute Storage, and Microsoft Azure. To use these services,\nyou need to configure Hugo with the information it needs about where to place\nthe files.\n\nLet’s configure Hugo to deploy to Amazon S3.\n\nBefore you start, you should be aware that this method will result in a site\nthat doesn’t have a custom domain and won’t be secured with a TLS certificate.\nHowever, you can combine this approach with Amazon’s\nCloudfront[[42]](f_0070.xhtml#FOOTNOTE-42) and Route\n53[[43]](f_0070.xhtml#FOOTNOTE-43) services to configure TLS certificates and\na domain name for your site. As such, this approach is targeted toward people\nwho have some experience hosting static content on S3.\n\nTo use Hugo to deploy to S3, you need an AWS account. If you don’t have an\naccount, visit the AWS site [[44]](f_0070.xhtml#FOOTNOTE-44) to set one up.\n\nYou also need an AWS access key. To set this up, follow Amazon’s\ndocumentation.[[45]](f_0070.xhtml#FOOTNOTE-45) Make sure to record your access\nkey and the accompanying secret. You won’t be able to retrieve the secret once\nyou create it, so if you lose it, you’ll have to generate a new access key and\nsecret.\n\nKeep Your AWS Credentials Safe!  \n---  \n![images/aside-icons/warning.png](Images/warning.png) |  If you’re not careful and someone else gets a hold of your AWS access key, they can use it to access your account, spin up resources, and spend a lot of your money. Keep your access keys safe, and do not store them in version control systems.   \n  \nNext, you need to download and install the AWS command-line\nutility.[[46]](f_0070.xhtml#FOOTNOTE-46) You’ll use this utility to create a\nlocal configuration file that stores your AWS credentials.\n\nOnce you’ve installed the CLI, configure your credentials with the AWS CLI\nusing the following command:\n\n​ | $ aws configure  \n---|---  \n  \nThe tool prompts you for your AWS acces key and secret for your account. Enter\nboth, then accept the default values for the rest of the prompts. This process\ncreates a file in your home directory that contains your AWS credentials. The\naws CLI app uses this file to find credentials when you run commands, and Hugo\nuses this file to make its connection to your S3 bucket when you tell it to\ndeploy your site.\n\nTo host a website on S3, you need to create a bucket for your site, configure\nthe bucket to serve web content, and apply a policy that lets people view all\nof the bucket’s contents. Although you can do this through the AWS console,\nit’s much quicker to use the AWS CLI tool.\n\nCreate the S3 bucket using the following command, but use your own name for\nyour bucket, as bucket names must be unique:\n\n​ | ​$ ​​**aws** ​​**** ​​**s3api** ​​**** ​​**create-bucket** ​​**** ​​**\\--bucket** ​​**** ​​**bph-pp-hugoprod** ​​**** ​​**\\** ​  \n---|---  \n​ | ​**** ​​**\\--acl** ​​**** ​​**public-read** ​​**** ​​**\\--region** ​​**** ​​**us-east-1** ​  \n  \nThis command creates the bucket bph-pp-hugo-prod in the US East 1 AWS region.\n\nTo use an S3 bucket as a website, you have to enable it to serve web pages and\ndefine the index document. You can also define the name of the error document\nyou want to use, but this is optional:\n\n​ | ​$ ​​**aws** ​​**** ​​**s3** ​​**** ​​**website** ​​**** ​​**s3://bph-pp-hugoprod/** ​​**** ​​**\\** ​  \n---|---  \n​ | ​**** ​​**\\--index-document** ​​**** ​​**index.html** ​​**** ​​**\\** ​  \n​ | ​**** ​​**\\--error-document** ​​**** ​​**error.html** ​  \n  \nYou’re ready to create a bucket policy that allows access to your bucket.\nWithout this policy, people won’t be able to view your content.\n\nFirst, create the policy as a JSON file named bucketpolicy.json with the\nfollowing contents:\n\n[deploy/portfolio/bucketpolicy.json](http://media.pragprog.com/titles/bhhugo/code/deploy/portfolio/bucketpolicy.json)\n\n​ | {  \n---|---  \n​ |  ​ _\"Version\"_ ​:​ _\"2012-10-17\"_ ​,  \n​ |  ​ _\"Statement\"_ ​:[  \n​ |  {  \n​ |  ​ _\"Sid\"_ ​:​ _\"PublicReadGetObject\"_ ​,  \n​ |  ​ _\"Effect\"_ ​:​ _\"Allow\"_ ​,  \n​ |  ​ _\"Principal\"_ ​: ​ _\"*\"_ ​,  \n​ |  ​ _\"Action\"_ ​: [​ _\"s3:GetObject\"_ ​],  \n​ |  ​ _\"Resource\"_ ​: [​ _\"arn:aws:s3:::bph-pp-hugoprod/*\"_ ​]  \n​ |  }  \n​ |  ]  \n​ | }  \n  \nThen, use the aws s3api command to apply the policy to the bucket:\n\n​ | aws s3api put-bucket-policy --bucket bph-pp-hugoprod \\  \n---|---  \n​ |  \\--policy file://bucketpolicy.json  \n  \nYour bucket is now configured to serve a static website. Not only can you use\nthe aws command to sync the files to the bucket, you can also use the hugo\ndeploy command to transfer the files, giving you some additional options.\n\nOpen Hugo’s config.toml file and add a new deployments section that specifies\nthe bucket and region like this:\n\n[deploy/portfolio/config.toml](http://media.pragprog.com/titles/bhhugo/code/deploy/portfolio/config.toml)\n\n​ | ​**[deployment]** ​  \n---|---  \n​ |   \n​ |  ​**[[deployment.targets]]** ​  \n​ |  name = ​ _\"prod\"_ ​  \n​ |  URL = ​ _\"s3://bph-pp-hugoprod?region=us-east-1\"_ ​  \n  \nYou can create multiple deployment targets for your site. For example, you can\nhave a staging target which publishes to one bucket and a production target\nthat publishes to another.\n\nTo increase your site’s performance, you can compress your scripts, pages, and\nstyles so they’ll download faster. Add this section to the file:\n\n[deploy/portfolio/config.toml](http://media.pragprog.com/titles/bhhugo/code/deploy/portfolio/config.toml)\n\n​ | ​**[[deployment.matchers]]** ​  \n---|---  \n​ | pattern = ​ _\"^.+_ ​​ _\\\\\\_ ​​ _.(html|xml|js|css)$\"_ ​  \n​ | gzip = ​**true** ​  \n  \nSave the file, and build your Hugo site again using the hugo\n--cleanDestinationDir command to ensure that the public folder is completely\ncleaned out and no artifacts from previous builds remain:\n\n​ | ​$ ​​**hugo** ​​**** ​​**\\--cleanDestinationDir** ​  \n---|---  \n  \nNow, use the hugo deploy command to upload the files to your bucket.\n\n​ | ​$ ​​**hugo** ​​**** ​​**deploy** ​  \n---|---  \n  \nYour site is now live. To access it, visit the URL associated with your\nbucket. In this example, the URL is http://bph-pp-hugoprod.s3-website.us-\neast-1.amazonaws.com.\n\nIn [​ _Using Webpack and npm with Hugo_ ​](f_0062.xhtml#sec.webpack.node), you\ncreated a package.json file that had some build tasks defined. Modify that\npackage.json file and add a hugo-deploy command for deploying the site, as\nwell as a deploy command which does the entire build and deploy process:\n\n​ |  ​ _\"scripts\"_ ​: {  \n---|---  \n​ |  ​ _\"build\"_ ​: ​ _\"npm-run-all webpack hugo-build\"_ ​,  \n​ |  ​ _\"hugo-build\"_ ​: ​ _\"hugo --cleanDestinationDir\"_ ​,  \n​ |  ​ _\"webpack\"_ ​: ​ _\"webpack\"_ ​,  \n​ |  ​ _\"webpack-watch\"_ ​: ​ _\"webpack --watch\"_ ​,  \n»|  ​ _\"hugo-deploy\"_ ​: ​ _\"hugo deploy\"_ ​,  \n»|  ​ _\"deploy\"_ ​: ​ _\"npm-run-all build hugo-deploy\"_ ​  \n​ |  ​ _\"dev\"_ ​: ​ _\"npm-run-all webpack --parallel webpack-watch hugo-server\"_ ​  \n​ |  },  \n  \nThe next time you’re ready to deploy your site, run the command npm run\ndeploy. Your site builds and deploys to S3 with a single command.\n\nAt this point, you’re ready to explore using Cloudfront and Route 53 to point\nyour own domain at the site. Once you’ve done that, you need to modify the\nbase URL for your Hugo site to reflect the domain. The easiest way to do that\nis to change the hugo-build task in your package.json file to specify the base\nURL:\n\n​ |  ​ _\"scripts\"_ ​: {  \n---|---  \n​ |  ​ _\"build\"_ ​: ​ _\"npm-run-all webpack hugo-build\"_ ​,  \n»|  ​ _\"hugo-build\"_ ​: ​ _\"hugo --cleanDestinationDir -b\nhttps://yourdomain.com/\"_ ​,  \n​ |  ​ _\"webpack\"_ ​: ​ _\"webpack\"_ ​,  \n  \nSave the file and run the npm run deploy to rebuild and redeploy the site.\n\nThe steps in this section are similar for other cloud providers. The only\nmajor difference is the value you use for the URL field in config.toml. If\nyou’re using Google, specify your bucket name like this:\n\n​ | URL = \"gs://your_bucket_name\"  \n---|---  \n  \nIf you’re using Azure, specify the blob:\n\n​ | URL = \"azblob://$your_blob_name\"  \n---|---  \n  \nConsult the instructions for your cloud provider on how to configure the\nresources and access permissions, and how to connect your domain name to those\nresources.\n\nIf you’re not interested in using cloud storage, you can deploy Hugo to a\nstandard web server.\n\n\n## Deploying to a Traditional Web Server\n\nDeploying your Hugo site to a traditional web server is no different than\ntransferring web pages you’ve made by hand. You use Hugo to generate your site\nand copy the contents of the public directory to your server’s default web\nroot.\n\nBefore you get started, you need the following information:\n\n  * The host name or IP address of your server\n\n  * The user account to use\n\n  * The password for the user (unless you’ve set up public key authentication)\n\n  * The path to the directory on the remote server where you want to store your files\n\n  * The fully qualified domain name for your site\n\nYour site should also have SFTP or shell access enabled. SFTP is a secure\nmethod of transferring files to remote servers. Shell access means you can log\nin to the remote server using the ssh command. If you have shell access, you\ncan use the scp command, short for secure copy, to transfer your files, or the\nrsync program to synchronize the contents of your public directory to your web\nserver.\n\nIf you’re working with a cloud server, VPS, or a local Linux or BSD-based\nserver running Ubuntu, Debian, Red Hat Enterprise Linux, FreeBSD, or other\nLinux distributions, you most likely have shell access enabled. Some shared\nhosts provide shell access as well, although you may have to configure this or\nask their support teams to enable it for you.\n\nOnce you have all of the information you need, you can do your first\ndeployment. First, modify config.toml to specify the base URL for your site,\nchanging it from example.org to your domain:\n\n»| baseURL = ​ _\"https://yourdomain.com/\"_ ​  \n---|---  \n​ | languageCode = ​ _\"en-us\"_ ​  \n​ | title = ​ _\"Brian's Portfolio\"_ ​  \n  \nSave the file, and prepare for its transfer. To transfer the files to your\nserver, you can either use a graphical SFTP program like\nFileZilla[[47]](f_0070.xhtml#FOOTNOTE-47) or some command-line tools.\n\nWith something like FileZilla, you’d plug your credentials into the app and\nthen transfer the contents of your Hugo site’s public directory to the\ndirectory on your shared host.\n\nUsing the command-line interface on macOS or Linux machines, if the sftp\ncommand is available, and you wanted to transfer the public directory from\nyour Hugo site to your web host’s public_html directory, you’d do it like\nthis:\n\n​ | ​$ ​​**sftp** ​​**** ​​**-r** ​​**** ​​**username@hostname:public_html** ​​**** ​​**< <<**​​**** ​​ _'put public/*'_ ​  \n---|---  \n  \nIf you have shell access to your server, you can use the scp command to\ntransfer your files securely. The following command transfers the contents of\nthe public directory to the public_html directory on the remote server:\n\n​ | ​$ ​​**scp** ​​**** ​​**-r** ​​**** ​​**public/*** ​​**** ​​**username@hostname:public_html** ​  \n---|---  \n  \nWith scp, you first specify the source files, then the destination. The -r\nswitch recursively copies files and directories.\n\nYou can also use the rsync command to transfer files to your server. With\nrsync, you can synchronize the contents of your local directory with another\ndirectory, and even compress the files so they’ll transfer faster. The\nfollowing command uses rsync to connect to your remote server, copy the\ncontents of the public directory to your server’s public_html directory, and\nremove any files on the server that aren’t in your local directory:\n\n​ | ​$ ​​**rsync** ​​**** ​​**-avz** ​​**** ​​**\\--delete** ​​**** ​​**public/** ​​**** ​​**username@hostname.com:public_html** ​  \n---|---  \n  \nThe -a switch tells rsync to use “archive mode”, which recursively selects all\nfiles and makes a complete backup, preserving permissions and times. The -v\nswitch shows verbose output, and the -z switch compresses the files.\n\nIf you’ve manually placed files on your server, the rsync command will delete\nthose files if it doesn’t find them in your local public directory, so you\nshould ensure that this command is the only way files get on your server.\n\nIn [​ _Using Webpack and npm with Hugo_ ​](f_0062.xhtml#sec.webpack.node), you\ndefined some tasks that made building your site easier. Modify your\npackage.json file to include the rsync command to deploy your site, and then\nmake a master deploy command that builds and uploads your files:\n\n​ |  ​ _\"scripts\"_ ​: {  \n---|---  \n​ |  ​ _\"build\"_ ​: ​ _\"npm-run-all webpack hugo-build\"_ ​,  \n​ |  ​ _\"hugo-build\"_ ​: ​ _\"hugo --cleanDestinationDir\"_ ​,  \n​ |  ​ _\"webpack\"_ ​: ​ _\"node_modules/webpack/bin/webpack.js\"_ ​,  \n​ |  ​ _\"webpack-watch\"_ ​: ​ _\"node_modules/webpack/bin/webpack.js --watch\"_ ​,  \n»|  ​ _\"upload\"_ ​: ​ _\"rsync -avz --delete public/\nusername@hostname.com:public_html\"_ ​,  \n»|  ​ _\"deploy\"_ ​: ​ _\"npm-run-all webpack hugo-build upload\"_ ​,  \n​ |  ​ _\"dev\"_ ​: ​ _\"npm-run-all webpack --parallel webpack-watch hugo-server\"_ ​  \n​ |  },  \n  \nBe sure to change the username, hostname, and remote path to match the values\nfor your own site.\n\nWith these changes in place, you can run npm run deploy to build and upload\nyour site to your server.\n\n![Joe asks:](Images/joe.jpg)\n\nJoe asks:\n\nWhat If I Don’t Have a Server?\n\nIf you don’t have an existing web server, you can set one up yourself or use a\nshared hosting provider.\n\nShared hosting providers are low-cost platforms that give you some space on a\nserver to host your web pages. You point your domain name to one of their\nservers and they serve up the pages. Shared hosting is one of the most common\nways people host personal and small business sites.\nDreamhost[[48]](f_0070.xhtml#FOOTNOTE-48) is a well-known shared hosting\nprovider that’s inexpensive and offers SFTP and shell access so you can\nautomate your deployments.\n\nOn a shared host, you share resources with hundreds, or thousands, of other\naccounts, and you have very little control over how the web servers are\nconfigured. If you want more control, you can set up your own dedicated\nserver, or use a cloud server provided by\nDigitalOcean,[[49]](f_0070.xhtml#FOOTNOTE-49)\nLinode,[[50]](f_0070.xhtml#FOOTNOTE-50) Amazon\nAWS,[[51]](f_0070.xhtml#FOOTNOTE-51) Microsoft\nAzure,[[52]](f_0070.xhtml#FOOTNOTE-52), or Google\nCloud.[[53]](f_0070.xhtml#FOOTNOTE-53) Unlike a shared host, you’re\nresponsible for managing the operating system and the web server software.\nEach provider has documentation on how to set up and secure your web server.\n\nThe deployment process itself is identical whether you’re using a shared host\nor your own server.\n\n\n## Your Turn\n\nThere are a few other methods you can explore when it comes to deploying your\nsite:\n\n  1. Explore how to deploy your site to GitHub Pages.[[54]](f_0070.xhtml#FOOTNOTE-54)\n\n  2. Explore GitHub Actions[[55]](f_0070.xhtml#FOOTNOTE-55) and use it to run your deployment commands when files in your repository change.\n\n  3. Explore NetlifyCMS,[[56]](f_0070.xhtml#FOOTNOTE-56) an open source frontend for managing your content and deploying changes.\n\n\n## Wrapping Up\n\nAs you’ve seen in this chapter, there are many ways to deploy your Hugo site\nto production, and the method you choose depends on your specific situation.\nDeploying to Netlify is a great way to get a personal site online quickly,\nwhile deploying to your own web server might be the only option you have for\nyour company docs site.\n\nYou’ve used Hugo to build a small, but feature-packed personal site. You’ve\ncreated your own theme from scratch; added content sections; served your\ncontent as JSON and RSS; consumed data from other sources; built a blog with\ncomments; managed images, CSS, and scripts; added a search feature; and\nexplored several ways to deploy your Hugo site to production and share it with\nthe world. With this foundation, you’re ready to explore the various other\nfeatures Hugo provides.\n\nHugo is an open source project under active development. As you learn more,\nconsider joining the community. Ask and answer questions in the Hugo\nCommunity,[57] build a theme and share it on the Hugo Themes site,[58] or\ncontribute directly to the project itself with bug reports, documentation\nupdates, or pull requests that fix outstanding issues.\n\n#### Footnotes\n\n[[38]](f_0065.xhtml#FNPTR-38)\n\n    \n\n<https://netlify.com>\n\n[[39]](f_0066.xhtml#FNPTR-39)\n\n    \n\n<https://git-scm.com/book/en/v2/Getting-Started-Installing-Git>\n\n[[40]](f_0066.xhtml#FNPTR-40)\n\n    \n\n<https://git-scm.com/book/en/v2/Getting-Started-First-Time-Git-Setup>\n\n[[41]](f_0066.xhtml#FNPTR-41)\n\n    \n\n<https://letsencrypt.org>\n\n[[42]](f_0067.xhtml#FNPTR-42)\n\n    \n\n<https://aws.amazon.com/cloudfront/>\n\n[[43]](f_0067.xhtml#FNPTR-43)\n\n    \n\n<https://aws.amazon.com/route53/>\n\n[[44]](f_0067.xhtml#FNPTR-44)\n\n    \n\n<https://aws.amazon.com/>\n\n[[45]](f_0067.xhtml#FNPTR-45)\n\n    \n\n<https://aws.amazon.com/premiumsupport/knowledge-center/create-access-key/>\n\n[[46]](f_0067.xhtml#FNPTR-46)\n\n    \n\n<https://docs.aws.amazon.com/cli/latest/userguide/install-bundle.html>\n\n[[47]](f_0068.xhtml#FNPTR-47)\n\n    \n\n<https://filezilla-project.org/>\n\n[[48]](f_0068.xhtml#FNPTR-48)\n\n    \n\n<https://dreamhost.com>\n\n[[49]](f_0068.xhtml#FNPTR-49)\n\n    \n\n<https://digitalocean.com>\n\n[[50]](f_0068.xhtml#FNPTR-50)\n\n    \n\n<https://linode.com>\n\n[[51]](f_0068.xhtml#FNPTR-51)\n\n    \n\n<https://aws.amazon.com>\n\n[[52]](f_0068.xhtml#FNPTR-52)\n\n    \n\n<https://azure.microsoft.com>\n\n[[53]](f_0068.xhtml#FNPTR-53)\n\n    \n\n<https://cloud.google.com>\n\n[[54]](f_0069.xhtml#FNPTR-54)\n\n    \n\n<https://pages.github.com/>\n\n[[55]](f_0069.xhtml#FNPTR-55)\n\n    \n\n<https://github.com/features/actions>\n\n[[56]](f_0069.xhtml#FNPTR-56)\n\n    \n\n<https://www.netlifycms.org/>\n\n[57]\n\n    \n\n<https://discourse.gohugo.io/>\n\n[58]\n\n    \n\n<https://themes.gohugo.io/>\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  Appendix 1  \nMigrating to Hugo\n\nNow that you know how Hugo works, you’re probably thinking, “OK, how can I\nmove my existing content to Hugo?” In a perfect world, you’d simply put your\ncontent in Hugo’s content directory as Markdown files and everything would\njust work. However, we don’t live in a perfect world, and it often ends up\nbeing a little more nuanced than that.\n\nDepending on how your content is organized and what additions or plugins\nyou’ve added to your existing system, the migration could take anywhere from a\nfew hours to a few months to complete.\n\nIn this chapter, you’ll review the migration process at a high level, which\nwill help you plan and map out what you need for your own migration plan.\n\n\n## Understanding What You Have\n\nBefore you start any migration, it’s best to fully understand what you’re\nmigrating. How much content do you have? What type of content is it, and is it\nproperly tagged? Are there any broken links? What features of the existing\nsite do you plan to keep?\n\nWhen doing any migration, it’s best to clean up the source material before\nstarting. This is especially true with older WordPress sites that have\nundergone multiple database migrations. Regardless of your current website\ndelivery system, here’s a short-list of things to investigate and address\nbefore attempting your migration:\n\n  1. Verify that all of your content is tagged and categorized.\n\n  2. Ensure the author information is consistent across all pages.\n\n  3. Check for content consistency. Look for mixes of UTF-8, Latin, and ASCII characters like curly quotes and straight quotes. Be aware that older posts might not use the correct encoding; if you fix these now, it’ll save you time later.\n\n  4. Clean out any drafts or previous versions that you don’t need.\n\n  5. Fix broken links. Most blog platforms and content management systems have this capability built in or offer a plugin to help.\n\n  6. Take inventory of any server-side scripts your site uses, like widgets, image galleries, and other plugins.\n\nDo a thorough audit of your site. It’s almost like moving to a new house or\napartment; pack everything up nicely before you begin the move.\n\nOnce you have an idea of what you have, and you know everything is in good\nshape, you’re ready to start moving your content.\n\n\n## Transferring the Content\n\nThe most challenging part of any migration is extracting the content from the\nexisting site and getting it presentable in a format the new site can use.\nThankfully, with Hugo’s rising popularity, there are a few tools and scripts\navailable that handle a lot of the heavy lifting for you. But how you do it\ndepends on which platform you’re migrating from.\n\nIf you’re migrating from a WordPress blog, you can use the WordPress-to-Hugo\nExport plugin.[[59]](f_0076.xhtml#FOOTNOTE-59) This plugin exports all of your\ncontent, placing each post in its own Markdown file. The plugin preserves the\noriginal post’s permalink, and places it in the front matter section of the\ncorresponding Markdown file. It also stores the draft status.\n\nIf you have a self-hosted WordPress installation, you can install the\nWordPress-to-Hugo Export plugin and use it from within the WordPress user\ninterface. Download the plugin, extract it, and upload it to your server via\nSFTP or SCP into your site’s /wp-content/plugins/ directory. Then, visit your\nsite, log in as an admin, and select Export to Hugo from the Tools menu.\n\nIf your WordPress site is hosted on WordPress.com, or you don’t have direct\naccess to the server, things will be more difficult. You’ll need to set up a\nlocal WordPress instance, export the data from your existing site as an XML\nfile, import your data into your local WordPress instance, and then install\nand use the plugin.\n\nIf you’re using Jekyll as your current platform, Hugo has a built-in command\nto migrate your content. Ensure you have all of the source files for your\nJekyll site and use the following command to convert your content:\n\n​ | ​$ ​​**hugo** ​​**** ​​**import** ​​**** ​​**jekyll** ​​**** ​​**jekyll_root_path** ​​**** ​​**target_path** ​  \n---|---  \n  \nIf you’re using Ghost, Tumblr, or other platforms, Hugo has a list of tools\nand scripts[[60]](f_0076.xhtml#FOOTNOTE-60) you can use to help you get your\ncontent out.\n\nWhichever method you use to migrate your content, remember that search engines\nand other sites may be pointing to your content, so you want to make sure that\nthose links still work after your migration. Use the url field in front matter\nto specify the URL you want to use, or configure your web server to redirect\nvisitors to the new URLs. If you’re using Netlify, you can use their support\nfor redirects.[[61]](f_0076.xhtml#FOOTNOTE-61)\n\nAutomated scripts will get you about 80% of the way there. Depending on how\nyour original system stored your content, the translation to Markdown might\nnot be as smooth as you’d hoped. Many of the conversion utilities attempt to\nconvert HTML content to Markdown. If your content has HTML that can’t be\nconverted, the conversion process might leave the HTML alone, leaving you with\na mix of HTML and Markdown. Hugo’s Markdown renderer will ignore HTML and\nJavaScript in Markdown documents. You may have to manually clean up the\ncontent yourself file by file. It can be a chore, but if you take the time to\ndo that cleanup, all of your content will be clean, in plain-text Markdown\ndocuments, and will be much easier to manage going forward.\n\nIf you have some complex HTML in your content, and you can’t figure out how to\nconvert it, or don’t like the results, you can configure Hugo’s Markdown\nrenderer to operate in “unsafe” mode, which will allow Hugo to render the HTML\nfragments. Add the following code to your config.toml file:\n\n​ | ​**[markup]** ​  \n---|---  \n​ |  ​**[markup.goldmark]** ​  \n​ |  ​**[markup.goldmark.renderer]** ​  \n​ |  unsafe = ​**true** ​  \n  \nThis will let you get more of your content migrated, but it does open a\npotential security hole that would allow unsafe code to run. For example, if\nyou’d migrated some code from a WordPress site, and one of your pages had some\nmalicious JavaScript code on it that you didn’t notice, Hugo’s defaults would\nprevent that malicious code from rendering. So, before turning this on,\ntriple-check your content.\n\nIf you’re not willing to do all of that cleanup work, you have two options:\nyou can leave your content as-is and fix it over time, or you can unpublish\nthe content.\n\nTo unpublish content, do a global search and replace and set the draft status\nof everything before a certain date to true, so it will no longer be\npublished. When you put things in a draft status, you can update them over\ntime, and reactivate them when you’re ready. This will likely break external\nlinks to your content, so be mindful of that. As an alternative, you can add a\nnew field to your front matter and modify your template to show a deprecation\nnotice or other disclaimer for pages with that field.\n\nAutomation Only Gets You So Far\n\nA WordPress site I recently imported had over 17 years of posts, and the first\nthree years of posts were originally on a different blogging platform\nentirely. These posts were done in HTML tables and didn’t have titles. I was\nable to import all of the content, but when I reviewed some of the pages in\nthe browser, elements were missing. Some of the HTML couldn’t be converted to\nMarkdown.\n\nI had to review each Markdown file, add an appropriate title for the pages,\nand clean up the code. It was a tedious process, and I did decide that some\ncontent couldn’t be moved right away. For those pieces, I added a notice to\nthose pages letting the reader know that there’s still some work in progress,\nas I didn’t want to break any incoming links from Google by unpublishing the\ncontent.\n\nYour pages and posts aren’t the only bits of content you’ll need to think\nabout.\n\n### Handling Comments\n\nIf you have a vibrant community of people sharing their thoughts and opinions\non your content, you will likely want to keep that content on your new site as\nwell.\n\nThe best approach to keep your comments is to migrate them to Disqus directly\nwhen possible. Disqus has guides for importing\ncomments[[62]](f_0076.xhtml#FOOTNOTE-62) that you can refer to for help with\nthis process.\n\nSome of the export scripts can preserve comments as well. You can then freeze\nthose old comments on those posts to prevent future commenting.\n\nYou might consider a combination of these approaches too. For example, you\nmight migrate your most recent posts’ comments to Disqus, while treating\nanything over a year old as an archive.\n\n### Handling Images and Other Assets\n\nImages need to be migrated from your old site to your new site, just like\ncontent, and how you migrate them depends entirely on how your images were\nlinked to your content. If you hosted your images on an asset server with\nabsolute links, then there’s nothing you’ll need to do, as the links will\nstill work. If your site images were uploaded through your CMS, the links in\nthe content pages may need some updates depending on where those images are\nlocated now.\n\nWatch Out for Inconsistent URLs\n\nOne site I migrated had inconsistent references to images in the content.\nAbout half of the references in the site used images/ instead of /images/ as\nthe base URL. It’s such a subtle difference that it took me a lot longer than\nI care to admit to notice the actual problem. A quick find-and-replace later\nand it was all sorted out. But you’re going to want to audit your images, and\nyou should see if you can fix them before you migrate.\n\nThe WordPress export plugin for Hugo places all of the images in the static\nfolder. If you have a lot of images, this can get messy. You may want to spend\nsome time organizing the content and updating any image references.\n\nIf you were using an image gallery plugin that relies on server-side\nprocessing, like one written in PHP, it won’t work with a Hugo site. You could\nuse a JavaScript-based library, but you can also create your own image gallery\nusing a Hugo shortcode that reads files from your static folder and constructs\na link and image for each one.\n\nCreate a file in your theme named shortcodes/gallery.html with the following\ncontents:\n\n​ | {{ $path := .Get 0 }}  \n---|---  \n​ | {{ $files := readDir (print \"/static/\" $path) }}  \n​ |   \n​ | <div class=​ _\"gallery\"_ ​>  \n​ |  {{ range $files }}  \n​ |  <a href=​ _\"{{ $path }}/{{ .Name }}\"_ ​>  \n​ |  <img src=​ _\"{{ $path }}/{{ .Name }}\"_ ​>  \n​ |  </a>  \n​ |  {{ end }}  \n​ | </div>  \n  \nThis fetches all files from a given directory, iterates over each one, and\ndisplays them on the page.\n\nYou can then add some CSS to style each image in the gallery:\n\n​ | .gallery img {  \n---|---  \n​ |  margin: 1em;  \n​ |  height: 240px;  \n​ |  width: 320px;  \n​ | }  \n  \nInvoke the gallery by adding the shortcode to a content page:\n\n​ | {{< gallery ​**\"/** ​images​**/** ​vacation-photos​**\"** ​ >}}  \n---|---  \n  \nIn this example, the gallery displays all the images located in\nstatic/images/vacation-photos.\n\nThis approach uses CSS to resize the images, which isn’t ideal. You could use\nwhat you learned in [​ _Using a Shortcode to Process Images_\n​](f_0060.xhtml#sec.shortcode.image) to build a more robust version of this\nthat reads images from a page bundle and resizes them, creating smaller\nthumbnails.\n\nYou can use custom shortcodes to migrate many features from your current site,\nfrom video and code embeds to social sharing widgets.\n\nYour existing site may have other files, like PDF documents, downloadable\nfiles, or other assets. Moving those to their own asset server will make your\nsite easier to manage, but you can also create folders in the static/ folder\njust like you would with images. If you re-create the same directory structure\nas the original site, your files will be accesible using the same URLs.\n\n### Checking Links\n\nImages, hyperlinks, and other references might not entirely survive a\nmigration, and spot-checking everything is time-consuming. The Broken Link\nChecker[[63]](f_0076.xhtml#FOOTNOTE-63) command-line tool can help identify\nthese issues quickly. It requires Node.js, but if you’re doing web work, you\nprobably already have that.\n\nInstall the tool globally:\n\n​ | ​$ ​​**npm** ​​**** ​​**install** ​​**** ​​**broken-link-checker** ​​**** ​​**-g** ​  \n---|---  \n  \nThen, run the hugo server command to launch your site.\n\nAfter the site launches, run the blc command to recursively scan your Hugo\nsite and let it show you what’s wrong:\n\n​ | ​$ ​​**blc** ​​**** ​​**http://localhost:1313** ​​**** ​​**-r** ​​**** ​​**-o** ​  \n---|---  \n  \nThe -o switch tells blc to order the results so it’s easier to fix any issues.\nThe -r switch tells the system to do a recursive scan.\n\nFix any broken links, and rescan your system until you don’t find new ones, as\nthe previously broken links might lead to pages that have broken links of\ntheir own.\n\nOnce you have the content in a good state, you’ll want to replicate your\ntheme.\n\n\n## Replicating the Theme\n\nYou learned how to build a theme in this book, so you should have all of the\ntools you need to duplicate your existing theme, which is mostly a manual\ntask. You’ll use hugo new theme to create a new theme, copy over your\nstylesheets and place them in the assets folder of your theme, create new\npartials, and create the appropriate templates for your content sections. Move\nover any tracking or analytics code you’ve integrated into your theme as well.\n\nThe basic theme you created in this book is a good starting point. Use that as\nthe base and apply your changes over the top.\n\nYou might not be able to bring everything over from your old theme. Some\nplatforms have additional features in their themes beyond colors and content\nplacement. For example, WordPress sites often have an “archives” section where\nyou can create pages that list posts by year and month. You might consider\nwriting some code to generate those layout pages, or use the tagging approach\nused in [​ _Organizing Content with Taxonomies_\n​](f_0044.xhtml#sec.taxonomies) to build those pages.\n\nIn addition, your theme may have extra widgets you’re relying on, many written\nin a back-end programming language like PHP. If you’re moving your site,\nyou’ll have to take inventory of those widgets, determine which ones you want\nto carry forward, and then decide on replacements. For instance, if you’re\nusing a Twitter plugin to display your most recent tweets, you might consider\nusing Twitter’s official JavaScript widget on your\nsite.[[64]](f_0076.xhtml#FOOTNOTE-64)\n\nYour site is migrated, you’ve re-created your theme and tested everything;\nit’s time to cut over to the new site.\n\n\n## Making the Switch\n\nThe safest method for deploying your new site to production is to deploy it to\na different server and change your domain name’s DNS settings to point to the\nnew server instead of the old one. That way you still have access to the old\nsite in production in case you need something.\n\nDeploy your site using one of the methods in Chapter 8, [​ _Deploying the\nSite_ ​](f_0065.xhtml#chp.deploy). Then, once you’ve tested the site, update\nyour DNS settings for your domain to point to the new site. It will take\nanywhere from a few hours to a couple of days for the DNS changes to propagate\naround the world. You can use WhatsMyDNS[[65]](f_0076.xhtml#FOOTNOTE-65) to\ntrack your DNS changes.\n\nOnce your site’s up, ensure existing links to your site work too. Search for\nyour content on Google and follow the inbound links to ensure people can find\nyour documents. If the links are broken, address those quickly with redirects\nor by altering the url field in the appropriate page’s front matter. Redeploy\nthe site and check the links again.\n\nWhen you’re confident things are completely migrated, you can back up your old\nsite and decommission it.\n\n\n## Wrapping Up\n\nWhen you’re moving a site from one platform to another, there are many things\nto consider, from how to transfer your content to how to replace the existing\nsite with the migrated one. This appendix provided a high-level overview, but\nit may not have covered all of the areas your site will need to consider. Your\nmigration will take time and you may encounter some places where you’ll have\nto get creative. However, when you’re done, you’ll have your content in plain-\ntext Markdown, nicely organized, making it ready for whatever the future\nholds.\n\n#### Footnotes\n\n[[59]](f_0073.xhtml#FNPTR-59)\n\n    \n\n<https://github.com/SchumacherFM/wordpress-to-hugo-exporter>\n\n[[60]](f_0073.xhtml#FNPTR-60)\n\n    \n\n<https://gohugo.io/tools/migrations/>\n\n[[61]](f_0073.xhtml#FNPTR-61)\n\n    \n\n<https://docs.netlify.com/routing/redirects/>\n\n[[62]](f_0073.xhtml#FNPTR-62)\n\n    \n\n<https://help.disqus.com/en/collections/191709-import-export-and-syncing>\n\n[[63]](f_0073.xhtml#FNPTR-63)\n\n    \n\n<https://github.com/stevenvachon/broken-link-checker>\n\n[[64]](f_0074.xhtml#FNPTR-64)\n\n    \n\n<https://publish.twitter.com/>\n\n[[65]](f_0075.xhtml#FNPTR-65)\n\n    \n\n<https://www.whatsmydns.net/>\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\n\n#  \nBibliography\n\n[Hog19]\n\n    Brian P. Hogan. _Small, Sharp Software Tools_. The Pragmatic Bookshelf, Raleigh, NC, 2019.\n\nCopyright © 2020, The Pragmatic Bookshelf.\n\nThank you!\n\nHow did you enjoy this book? Please let us know. Take a moment and email us at\nsupport@pragprog.com with your feedback. Tell us your story and you could win\nfree ebooks. Please use the subject line “Book Feedback.”\n\nReady for your next great Pragmatic Bookshelf book? Come on over to\n<https://pragprog.com> and use the coupon code BUYANOTHER2020 to save 30% on\nyour next ebook.\n\nVoid where prohibited, restricted, or otherwise unwelcome. Do not use ebooks\nnear water. If rash persists, see a doctor. Doesn’t apply to The Pragmatic\nProgrammer ebook because it’s older than the Pragmatic Bookshelf itself. Side\neffects may include increased knowledge and skill, increased marketability,\nand deep satisfaction. Increase dosage regularly.\n\nAnd thank you for your continued support,\n\nAndy Hunt, Publisher\n\n![images/Coupon.png](Images/Coupon.png)\n\n\n## You May Be Interested In…\n\n _Select a cover for more information_\n\n### Small, Sharp Software Tools\n\n[![](Images/bhcldev.jpg)](http://pragmaticprogrammer.com/titles/bhcldev)\n\nThe command-line interface is making a comeback. That’s because developers\nknow that all the best features of your operating system are hidden behind a\nuser interface designed to help average people use the computer. But you’re\nnot the average user, and the CLI is the most efficient way to get work done\nfast. Turn tedious chores into quick tasks: read and write files, manage\ncomplex directory hierarchies, perform network diagnostics, download files,\nwork with APIs, and combine individual programs to create your own workflows.\nPut down that mouse, open the CLI, and take control of your software\ndevelopment environment.\n\nBrian P. Hogan\n\n(326 pages) ISBN: 9781680502961 $38.95\n\n### tmux 2\n\n[![](Images/bhtmux2.jpg)](http://pragmaticprogrammer.com/titles/bhtmux2)\n\nYour mouse is slowing you down. The time you spend context switching between\nyour editor and your consoles eats away at your productivity. Take control of\nyour environment with tmux, a terminal multiplexer that you can tailor to your\nworkflow. With this updated second edition for tmux 2.3, you’ll customize,\nscript, and leverage tmux’s unique abilities to craft a productive terminal\nenvironment that lets you keep your fingers on your keyboard’s home row.\n\nBrian P. Hogan\n\n(102 pages) ISBN: 9781680502213 $21.95\n\n### React for Real\n\n[![](Images/lfreact.jpg)](http://pragmaticprogrammer.com/titles/lfreact)\n\nWhen traditional web development techniques don’t cut it, try React. Use React\nto create highly interactive web pages faster and with fewer errors. With a\nlittle JavaScript experience under your belt, you’ll be up and running in no\ntime creating dynamic web applications. Craft isolated components that make\nyour apps easier to develop and maintain, with plenty of guidance on best\npractices. Set up automated tests, and make pages render fast for your users.\nSee how to use your React skills to integrate with other front-end\ntechnologies when needed.\n\nLudovico Fischer\n\n(118 pages) ISBN: 9781680502633 $26.95\n\n### Practical Microservices\n\n[![](Images/egmicro.jpg)](http://pragmaticprogrammer.com/titles/egmicro)\n\nMVC and CRUD make software easier to write, but harder to change.\nMicroservice-based architectures can help even the smallest of projects remain\nagile in the long term, but most tutorials meander in theory or completely\nmiss the point of what it means to be microservice based. Roll up your sleeves\nwith real projects and learn the most important concepts of evented\narchitectures. You’ll have your own deployable, testable project and a\ndirection for where to go next.\n\nEthan Garofolo\n\n(290 pages) ISBN: 9781680506457 $45.95\n\n### Real-Time Phoenix\n\n[![](Images/sbsockets.jpg)](http://pragmaticprogrammer.com/titles/sbsockets)\n\nGive users the real-time experience they expect, by using Elixir and Phoenix\nChannels to build applications that instantly react to changes and reflect the\napplication’s true state. Learn how Elixir and Phoenix make it easy and\nenjoyable to create real-time applications that scale to a large number of\nusers. Apply system design and development best practices to create\napplications that are easy to maintain. Gain confidence by learning how to\nbreak your applications before your users do. Deploy applications with\nminimized resource use and maximized performance.\n\nStephen Bussey\n\n(326 pages) ISBN: 9781680507195 $45.95\n\n### Programming Machine Learning\n\n[![](Images/pplearn.jpg)](http://pragmaticprogrammer.com/titles/pplearn)\n\nYou’ve decided to tackle machine learning — because you’re job hunting,\nembarking on a new project, or just think self-driving cars are cool. But\nwhere to start? It’s easy to be intimidated, even as a software developer. The\ngood news is that it doesn’t have to be that hard. Master machine learning by\nwriting code one line at a time, from simple learning programs all the way to\na true deep learning system. Tackle the hard topics by breaking them down so\nthey’re easier to understand, and build your confidence by getting your hands\ndirty.\n\nPaolo Perrotta\n\n(340 pages) ISBN: 9781680506600 $47.95\n\n### Competing with Unicorns\n\n[![](Images/jragile.jpg)](http://pragmaticprogrammer.com/titles/jragile)\n\nToday’s tech unicorns develop software differently. They’ve developed a way of\nworking that lets them scale like an enterprise while working like a startup.\nThese techniques can be learned. This book takes you behind the scenes and\nshows you how companies like Google, Facebook, and Spotify do it. Leverage\ntheir insights, so your teams can work better together, ship higher-quality\nproduct faster, innovate more quickly, and compete with the unicorns.\n\nJonathan Rasmusson\n\n(138 pages) ISBN: 9781680507232 $26.95\n\n### Programming Flutter\n\n[![](Images/czflutr.jpg)](http://pragmaticprogrammer.com/titles/czflutr)\n\nDevelop your next app with Flutter and deliver native look, feel, and\nperformance on both iOS and Android from a single code base. Bring along your\nfavorite libraries and existing code from Java, Kotlin, Objective-C, and\nSwift, so you don’t have to start over from scratch. Write your next app in\none language, and build it for both Android and iOS. Deliver the native look,\nfeel, and performance you and your users expect from an app written with each\nplatform’s own tools and languages. Deliver apps fast, doing half the work you\nwere doing before and exploiting powerful new features to speed up\ndevelopment. Write once, run anywhere.\n\nCarmine Zaccagnino\n\n(368 pages) ISBN: 9781680506952 $47.95\n\n* * *\n\n",
    "book_id": "build_websites_with_hugo",
    "book_title": "Build Websites with Hugo",
    "book_author": "Brian P. Hogan",
    "topic_id": "technology_hugo",
    "topic_label": "hugo",
    "chunk_index": 0
  }
]