[
  {
    "chunk_full": "  1. [TWENTY BITS I LEArned about making fonts](page-1.xhtml)\n  2. [There ARE no font police](page-6.xhtml)\n  3. [Fonts are never finished—and that’s great](page-11.xhtml)\n  4. [Everyone draws letters](page-15.xhtml)\n  5. [Get inspiration from old signs](page-19.xhtml)\n  6. [Find the right tool](page-26.xhtml)\n  7. [Start with ALL CAPS](page-30.xhtml)\n  8. [DESIGN H AND O first](page-34.xhtml)\n  9. [Reuse shapes for laziness consistency](page-39.xhtml)\n  10. [When in doubt, line up those handles](page-45.xhtml)\n  11. [Type designers are optical illusionists](page-49.xhtml)\n  12. [A–Z is easy; the rest is hard](page-56.xhtml)\n  13. [Spacing ≠ kerning](page-62.xhtml)\n  14. [Finish all spacing before kerning](page-68.xhtml)\n  15. [Kerning groups will save your sanity](page-70.xhtml)\n  16. [Monoline is fun](page-77.xhtml)\n  17. [Add personality with alternates](page-83.xhtml)\n  18. [Surprise & delight with ligatures](page-88.xhtml)\n  19. [Old English letters are fascinating](page-93.xhtml)\n  20. [Ask friends for help](page-98.xhtml)\n  21. [Sell your fonts](page-103.xhtml)\n\n  1. [Page 1](page-1.xhtml)\n\n\n\n\n\nTWENTY BITS  \n\nI LEArned about  \n\nmaking fonts\n\nQuick lessons from a designer-turned-\n\nnewbie-type-designer\n\n￼\n\nDan Cederholm\n\n![Image](images/image.png)\n\n\nCopyright © 2021 Dan Cederholm\n\nAll rights reserved. This book or any portion thereof  \n\nmay not be reproduced or used in any manner whatsoever  \n\nwithout the express written permission of the publisher  \n\nexcept for the use of brief quotations in a book review.\n\nCopyedited by Sally Kerrigan\n\nFirst Release, 2021\n\nISBN 978-0-578-89534-5\n\nSimpleBits LLC  \n\n203 Washington St. #302  \n\nSalem, MA 01970  \n\nsimplebits.com\n\n\nINTRODUCTION\n\nI’m not an expert in type design or fonts. What a way to\n\nsell this book, eh? But that’s exactly why I wanted to\n\nwrite it. As a designer, I’d always been interested in\n\ncreating type, but turning those designs into a working\n\nfont seemed impossible.\n\nThen a pandemic swept the globe and, like nearly\n\neveryone else, I found myself with a lot more time to fill\n\nfrom the confines of my home. For reasons unknown I\n\ndecided to spend a good portion of this quarantine\n\ntime finally learning how to make a font properly. I’ve\n\nenjoyed that journey so much I decided to write about\n\nit and share with other potential font-makers.\n\nIt’s not an exhaustive tome on the inner workings of\n\nletterforms and typographic theory, but rather a casual\n\ncapture of some important lessons I learned along the\n\nway.\n\n\nPlease keep in mind that  none of this is prescriptive .\n\nThese are simply my own experiences from the per-\n\nspective of a designer that wanted to learn a new skill—\n\nso take with a grain of coarse kosher salt (the only salt\n\nworth its salt, let’s be real).\n\nMy hope is this little book will be useful to designers\n\nand creative folks who’ve been curious about turning\n\ntheir type designs into fonts that anyone can use and\n\nenjoy. It seems intimidating at first, but I promise it\n\ndoesn’t have to be.\n\nThanks for reading!￼\n\nDan Cederholm  \n\nSalem, Massachusetts\n\n![Image](images/image-1.png)\n\n\n￼\n\n![Image](images/image-2.png)\n\n\n1.\n\nThere ARE no  \n\nfont police\n\nI remember thi nking, “ I can’t make a font! I’ll get called\n\nout for doing it wrong! ” As if some governing body of\n\ntype designers would out me for being careless, or\n\nworse—a fraud. Now I realize this is some serious im-\n\nposter-syndrome-fueled feeling of inadequacy at play\n\nhere, but it speaks to the intimidating nature of the\n\ntype design world. I long assumed making fonts was\n\nonly for folks who spent years in school studying  the\n\n\ncraft, and that “the font police” would come knocking if\n\nthey knew I hadn’t done the same. Of course, my as-\n\nsump tions were absurd. Fonts are made by all types\n\n(pun intended, always). And when you start looking\n\nclosely at letterforms, really digging into the shapes,\n\nyou’ll notice many fonts are, well,  weird . Let’s look at a\n\ncouple of quick examples.￼\n\nPlatform is a wonderful font with a ton of personality\n\nfrom a very well-known foundry. But it has some real\n\nquirkiness. Some letters are wide and geometric (e.g.\n\nthe  O ) while others are particularly narrow (e.g. the  r ).\n\nBut it works!\n\nI’d long assumed strict adherence to grids would be the\n\nbe-all and end-all of designing letters, but it turns out\n\nthat variation and fluidity with styles is what makes so\n\nmany fonts both beautiful and organic.\n\n![Image](images/image-3.png)\n\n\nNow let’s take a peek at Gill Sans, a typeface designed\n\nby Eric Gill back in the 1920s.\n\n￼Putting aside Eric’s controversial personal life (you’ll\n\nhave to look him up), Gill Sans was based on ‘Under-\n\nground Alphabet’ by Edward Johnston, which became\n\nthe official font of the London Underground. It would\n\nlater be adopted by British Railways and on the iconic\n\ncovers of Penguin Books [ 1 ](page-107.xhtml#footnote1) . It’s a font that’s\nbeen widely\n\nused for decades.\n\nBut take a look at it closely. Especially the UltraBold\n\nstyle above. The  g is especially quirky, and the dots on\n\nthe  i and j ! Downright bizarre. But again,  it works .\n\n![Image](images/image-4.png)\n\n\nI use those examples to make this point:  There are no\n\nfont police and nothing stopping you from diving\n\ninto the world of type design . Break the rules and\n\nstart creating. It’s how everyone starts!  \n\nTHERE ARE NO CREATIVE POLICE\n\nAdditionally, I could apply my previously-confessed\n\nself-doubt to any discipline. Not just making fonts, but\n\nanything creative. It’s natural to be intimidated by a\n\nfield you’re not experienced in—but take the leap and\n\nremember that everything is a work in progress, every-\n\none starts somewhere, and there are no lives at stake\n\nhere. Which leads us to Bit #2.\n\n\n￼\n\n![Image](images/image-5.png)\n\n\n2.\n\nFonts are never\n\nfinished—and\n\nthat’s great\n\nAnother intimidating factor when considering making\n\nyour first font is the sheer scale of work involved. If you\n\nlook at a large family, like say, Avenir Next, with its\n\nmultiple weights and styles for thousands of charac-\n\nters, you might think, “How on Earth could I create a\n\nfont like this? It’ll take me decades.”\n\n\nAnd it probably would take decades if your first font\n\nwas to be a  super family with thousands of characters.￼￼\n\nBut just as Avenir Next is a font, so too is Good Book by\n\nBretheren Design Co, for example. One weight. One\n\nstyle. Caps only. Basic punctuation. And that’s it. Good\n\nBook is priced appropriately for its limited set, but it’s\n\nstill  a font ! And one with a ton of character and a myri-\n\nad of uses. It’s a  display font , which means it’s meant\n\nprimarily for decorative titles, logos, etc. rather than\n\nlong passages and general text.\n\nDisplay fonts are what I’ve mainly focused on as a be-\n\nginning type designer, and it can be quite freeing. They\n\ntypically consist of a basic set of characters that folks\n\ncan use for specific situations. They’re still very impor-\n\n![Image](images/image-6.png)\n\n![Image](images/image-7.png)\n\n\n![border-image.png](images/border-image.png) ![border-\nimage-1.png](images/border-image-1.png)\n\ntant and useful, and a heckuva lot easier to complete\n\nwhen you’re first starting to create your own fonts.\n\nIn other words, don’t set out to design a replacement\n\nfor Helvetica or Times New Roman. Start small with an\n\nattainable goal.￼￼\n\nAnother way to look at the daunting task of completing\n\na font is that they’re never finished. And that’s a good\n\nthing! You can always start with a small character set\n\nand grow it over time with additional characters and\n\nstyles. I’ll often update my fonts with new characters\n\nand those updates become free updates to the folks\n\nthat purchased the initial release. They’re always\n\nthrilled.\n\n![DISPLAY FONTS… DISPLAY FONTS\n\nDecorative, creates mood, best at large sizes, announces important\ninformation.](images/image-8.png)\n\nDISPLAY FONTS\n\nDecorative, creates mood,\n\nbest at large sizes,\n\nannounces important\n\ninformation.\n\n![TEXT FONTS… TEXT FONTS\n\nEasy to read, ideal for long blocks of copy, best at smaller\nsizes.](images/image-9.png)\n\nTEXT FONTS\n\nEasy to read, ideal for long\n\nblocks of copy, best at\n\nsmaller sizes.\n\n\n￼\n\n![Image](images/image-10.png)\n\n\n3.\n\nEveryone  \n\ndraws letters\n\nI have vivid memories of learning cursive in Mrs. Hor-\n\nton’s 2nd grade class at Hartford Elementary in White\n\nRiver Junction, Vermont. I remember it being fun to\n\nlearn a “fancier” way of drawing letters. I loved the\n\nwriting paper whose thin, gray, dashed lines indicated\n\nan ideal x-height and the steampunk-esque chalk staff\n\nliner that we used to draw guidelines across the chalk-\n\nboard with one swipe.\n\n\nI wasn’t exceptionally gifted as a cursive letterer. My\n\nhandwriting is generally pretty mediocre. Heck, I write\n\nin all caps these days.\n\nBut thinking back to Mrs. Horton’s class, I’m struck by\n\ntwo things:  1. Do they even teach cursive anymore? My\n\nown two kids only had a brief stint of lessons and the\n\nschool seemed to only skim over it, rather than making\n\nit a core competency. And  2. Everyone draws letters.\n\nWe all do. On checks. Adding a tip on a receipt. Okay,\n\nwe also draw numbers! But that means we all have a\n\nbase knowledge about letter shapes—we have a lifetime\n\nof experience drawing letters! Making fonts is a natural\n\nextension of that.\n\nIn other words, another encouraging realization for me\n\nwhen venturing into the seemingly-forbidden world of\n\ntype design is that letters and writing are part of  every-\n\none . We can all bring our own unique perspective on\n\nwhat letters can look like. And that’s really freeing and\n\nexciting.\n\nEveryone draws letters. Not everyone makes fonts. But\n\nmore of us  can .\n\n\nThere are thousands of handwriting fonts out there,\n\neach one unique. After a recent workshop about my\n\njourney into making fonts, one of the students mes-\n\nsaged me to say that she’d been wanting to create a font\n\nof her handwriting for years and this was just the moti-\n\nvation she needed to make it a reality. She had most of\n\nthe letters in place by the end of the three-hour session.￼\n\nEveryone draws letters. So for some, creating a font\n\nfrom their own handwriting could be just the right mo-\n\ntivation for their first font project. I just hope it’s more\n\nlegible than mine.\n\n![Image](images/image-11.png)\n\n\n￼\n\n![Image](images/image-12.png)\n\n\n4.\n\nGet inspiration\n\nfrom old signs\n\nInspiration, for me, has come from old signage. Living\n\nhere in New England, I’m surrounded by vintage signs.\n\nThere is one particular sign I’d walk past every day for\n\nyears on the way to my office in downtown Salem. It’s\n\non the side of bank. It’s been a bank for more than a\n\ncentury, and on one of the building’s brick walls is a\n\nlittle cast iron, house-shaped box with thick, white,\n\nsans-serif lettering in all caps: VAULT ALARM.\n\n\nYear after year, I’d pass this sign and admire the bold,\n\nblocky type. “Someday, I’d love to make a font out of\n\nthis,” I’d say. I even posted a photo on Instagram with￼\n\nthat exact caption over eight\n\nyears ago.\n\nIn 2020, I finally took the\n\nplunge and turned this hand-\n\nful of letters into a full alpha-\n\nbet that felt like a family. Then\n\nlater into a functional display\n\nfont. The motivation to make it came from wanting to\n\nsee these letters take on a new life in other projects.\n\nAnd thus began a new obsession of drawing letters\n\nbased on a small set (in red) of vintage type.\n\nA BCDEFGHIJK LM\n\nNOPQ R S TUV WXYZ\n\n0123456789  \n\n&$@!?\n\n![Image](images/image-13.png)\n\n\nSHIPS WHISTLE\n\nAnother font inspiration came from a rectangular, red\n\nsign on the bow of the ferry that brings folks from\n\nWoods Hole to Martha’s Vineyard off Cape Cod, Mass-\n\nachusetts.￼\n\nThe warning sign was posted outside on the deck of the\n\nship to warn passengers of the very loud whistle (which\n\nI can confirm is indeed very loud). I was immediately\n\nstruck by the  ST connection in the word WHISTLE. It\n\nvery well might’ve been a printing error, but it ap-\n\npeared to be funky ligature that brought so much char-\n\nacter to the monoline font.\n\nAgain, I found myself muttering, “It’d be fun to make a\n\nfont based on this sign.” And so I began drawing the\n\nletters that would fill out an alphabet based this very\n\nlimited set from the sign (in red below). I’d call it Ships\n\n![Image](images/image-14.png)\n\n\nWhistle, and the maritime feeling from the ferry would\n\nguide the creation and theme of the typeface.\n\nAaBbCc D d E eFfGg\n\nH h I iJjKk L lMmNn\n\nO o P pQq R r S s T t\n\nU u V v W wXx Y yZz\n\n012345678&$!?\n\nPARKLY\n\nA third font I created was inspired by vintage National\n\nPark posters. Not a specific one, but more of a  feeling of\n\nthe old WPA style from the early 20th century. The\n\nslightly Art-Deco-inspired “thick and thin” typefaces\n\nwere used in iconic marketing posters for national\n\nparks like Yellowstone, Acadia, Arches, Big Bend, etc.\n\nYou’ll see this type of font on wayfinding signage in\n\nmany of the parks as well.\n\n\nABCDEFGHIJK\n\nLMNOPQRSTUV\n\nWXYZ0123456\n\n789&$@!?\n\nParkly condensed\n\nParkly regular\n\nParkly wide\n\nHUNT FOR TYPE\n\nSo, while I was inspired by old signs that I was seeing in\n\nthe real world, and you too may notice signs as well—\n\ndon’t stop there. Letters are all around us (not to sound\n\nlike a new age font mystic). Keep your eyes on:\n\n• Packaging (old and new!)\n\n• Film credits\n\n\n• Record covers\n\n• Matchbooks & cocktail napkins\n\n• Menus\n\n• Twigs in the backyard arranged to form letters\n\nInspiration can arrive at any moment. And speaking of\n\nold packaging, I can’t recommend the website Type\n\nHunting [ 2 ](page-107.xhtml#footnote2) enough. It’s ‘an on-going archive of\nfound\n\ntypography’ by graphic designer Jonathan Lawrence.\n\nHundreds of beautiful photos of type and lettering on\n\npackaging from years past. It’s incredibly inspiring,\n\nand I dare you not to come away from the site with a\n\nfont idea or three.\n\nSimilarly, Letterform Archive [ 3 ](page-107.xhtml#footnote3) has an\nextensive,\n\nsearchable collection of type found in periodicals,\n\nposters, books, etc. It’s easy to get lost in here, and the\n\nletterform inspiration is rather endless.\n\n\n￼\n\n![Image](images/image-15.png)\n\n\n5.\n\nFind the  \n\nright tool\n\nAs a designer, I’ve had a lifelong appreciation for type,\n\nbut creating my own fonts has always seemed like an\n\nimpossible endeavor. For me, that was largely because\n\nof the software required to create them.\n\nBack in the 2000s, I took a stab at creating a pixel icon\n\nfont. (Trust me, they were all the rage before high-reso-\n\nlution screens.)\n\n\nI bought a copy of a then-popular font creation app and\n\ndid eventually release something semi-usable. I felt\n\noverwhelmed by the cryptic menu icons and only un-\n\nderstood about 10% of what was happening on the\n\nscreen. To trained type designers who’ve spent years\n\nworking with this software, I’m sure it becomes second\n\nnature. But for me, a designer who just wanted to make\n\na simple bitmap font, it was torture.￼\n\nI never tried making a font again. The application was\n\njust too cumbersome for my simple project.  \n\nENTER GLYPHS\n\nThat all changed when I tried an app called Glyphs,\n\nwhich Amy and Jennifer Hood of Hoodzpah [ 4 ](page-107.xhtml#footnote4) recom-\n\nmenced to me. They’d been making their own beautiful\n\n![Image](images/image-16.png)\n\n\nfonts, and while interviewing them for my podcast,\n\nthey mentioned Glyphs and how designer-friendly it is.\n\nAnd boy were they right.\n\nGlyphs made it a joy to jump in and start making fonts.\n\nThis was life-changing for me. With the right tool at\n\nhand, I was hooked. Sculpting letters into functional\n\nfonts became downright addictive.\n\nI’ll be referencing Glyphs quite a bit in subsequent bits\n\nof the book, with some specific tips and tricks. I can’t\n\nrecommend this tool enough, and if you’ve been dis-\n\ncouraged with other font software in the past, you’ll\n\nlikely be pleasantly surprised. That said, regardless of\n\nwhich tool you choose, most of the lessons I pass along\n\nhere will still apply.\n\n\n￼\n\n![Image](images/image-17.png)\n\n\n6.\n\nStart with  \n\nALL CAPS\n\nAs I mentioned earlier, to drastically reduce the over-\n\nwhelming fear of creating my first font, I focused on a\n\nsingle-weight  display typeface. That is, I wasn’t trying\n\nto recreate  Helvetica or  Times New Roman or even  Comic\n\nSans . I started with something that’s a little rough\n\naround the edges, unique, quirky, etc. Dare I say…\n\nwonky . It helped to start small and focused.\n\n\nIt was also helpful to start with capital letters. Not only\n\ndid that cut the character set I needed to create in half,\n\nbut it also cut down the spacing and kerning work I\n\nwould need to do later by an order of magnitude.\n\nAll-caps fonts are especially useful for logos, signage,\n\nand brand work—all things designers often need good\n\ncustom type for.\n\nSo start with an all-caps display font and you’ll likely be\n\nless discouraged as you’re first getting started.  \n\nGLYPHS TUTORIALS & FORUM\n\nI highly recommend the  Creating an All-Caps Font tu-\n\ntorial on the Glyphs site [ 5 ](page-107.xhtml#footnote5) . It goes over how\nto ensure\n\nyour all-caps font displays only capital letters, regard-\n\nless of whether the key for lower or uppercase is typed\n\n(as any all-caps font should). Glyphs takes care of the\n\nheavy lifting in terms of assigning the correct Unicode\n\nvalues to make things work.\n\n\nIn general, the ‘Learn’ section of the Glyphs website is\n\nchock-full of really useful, easy-to-follow tutorials.\n\nThey also maintain a treasure trove of info in their fo-\n\nrum, detailing all sorts of challenges you’ll likely en-\n\ncounter. These beginner-friendly community and edu-\n\ncation components are two more reasons I’ve been suc-\n\ncessful in learning how to make fonts—specifically\n\nwith Glyphs.\n\n\n￼\n\n![Image](images/image-18.png)\n\n\n7.\n\nDESIGN  H  \n\nAND  O first\n\nPeople who actually know what they’re doing will tell\n\nyou (and I can attest) that it’s helpful to tackle the  H\n\nand  O first when designing an all-caps font. They’re\n\ncalled “control characters,” which can inform the style\n\nand foundation for the rest of the characters. Nailing\n\ndown these two letters first can set you on the right\n\npath toward a consistent typeface.\n\n\nFor  H , you’re determining:￼\n\n• Width, height, and weight\n\n• Position and thickness of the crossbar\n\n• Whether it has serifs or not\n\n• What kind of personality it has\n\nThese handful of decisions really set the trajectory for\n\nthe overall design of the font. Even something as sim-\n\nple as setting the crossbar of the  H high, low, or just-off-\n\ncenter can have a drastic effect on a typeface’s person-\n\nality or even the era in history it may be emulating.￼\n\nSimilarly, for  O you’re determining:\n\n• Are round shapes circular or more elliptical?\n\n• Does the font have contrast (thick & thin dynamics)\n\nor is it more uniform?\n\n![Image](images/image-19.png)\n\n![Image](images/image-20.png)\n\n\n• Other characteristics that give personality (e.g. boxy\n\nvs. oval, off-center counters, etc.)\n\nThe idea with  H and  O is that once these are decided\n\nupon, you now have a basis for letters that are round or\n\nhave straight sides. Moving onto  N ,  Q ,  P , etc. are then\n\nnatural next steps.\n\n  \n\nLOWERCASE CONTROL CHARACTERS\n\nWhen you’re ready for lowercase,  n and  o are recom-\n\nmended. From  n you can move easily to  h ,  u ,  m and\n\nfrom  o you can start building letters like  p ,  b , and  d .￼\n\nI’ll leave this topic with a caveat. For a few of my fonts,\n\nparticularly those that I was basing off a handful of let-\n\nters found in the wild, I didn’t start with  H or  O , but\n\nrather  A ,  L , or even the terrifyingly-curvy  S . Every well-\n\neducated type designer would tell you that’s not opti-\n\nmal, but sometimes creativity has a way of skirting the\n\n![Image](images/image-21.png)\n\n\nrules—especially when you’re not particularly educat-\n\ned on the subject.\n\nThe bottom line, I believe, is that starting with control\n\ncharacters is an ideal and helps make the process of\n\ndesigning a typeface smoother, and that’s helpful to\n\nkeep in mind. But by all means, if you want to draw an\n\nA or even  & first, go for it!\n\n\n￼\n\n![Image](images/image-22.png)\n\n\n8.\n\nReuse shapes  \n\nfor  laziness\n\nconsistency\n\nThe good news about creating a set of letters, is that\n\nthey often share shapes. Create an  n and then turn it\n\nupside down for the  u . Design a  B and perhaps those\n\ncurves turn into a  3  and then later inform the  & . Make\n\nan  F and you’re 90% toward an  E , and so on and so\n\nforth.\n\n\nYou’ll likely need to finesse each letter to get them look-\n\ning optimal—but I found this shape-sharing essential\n\nto  a) making an entire character set feel less like an\n\ninsane, never-ending journey and  b) helping to make\n\nthe font feel more consistent and cohesive. Which, real-\n\nly, is what a typeface is at its core: a family of separate\n\nglyphs.￼\n\nFor example, when I was designing Parkly, its rounded\n\nbox base shape made quick work of creating many let-\n\nters. Once I had the  O or the  C , I could easily move on\n\nto other letters like  G ,  Q ,  U , etc.\n\nPart of what makes up the DNA of your typeface are\n\nthese little decisions you’re constantly making, like\n\nwhere crossbars line up. While the shapes of B ,  3 , and  8\n\nare very similar, they differ in regards to where the\n\nmidpoint of the character is.\n\n![Image](images/image-23.png)\n\n\nAnd there’s something I learned when designing fonts:￼\n\nSymmetry is a useful starting point when making letter\n\nshapes that feel uniform and related to one another,\n\nbut you’ll find plenty of room to diverge and play up\n\nthe unique characteristics of certain letters.\n\nDo all crossbars line up in the middle? If not, which\n\nones should be above/below center? Should it be con-\n\nsistent for a set of letters and different for numbers?\n\nThese are questions I’m constantly asking myself dur-\n\ning the process. It helps to reference other fonts here, of\n\ncourse. And you’ll quickly see patterns emerge that\n\nmake sense—as well as being reminded that there are\n\nno  rules necessarily that every type designer follows.\n\nGo with your gut. Create your own systems that help\n\ndrive consistency.\n\nWhen designing Vault Alarm, I initially wanted the\n\nterminals of letters like  C and  S to line up with the ter-\n\n![Image](images/image-24.png)\n\n\nminals of numbers like  2 and  3 . But it just didn’t feel\n\nright. Lower terminals on the letters worked well, and\n\nmatched what I was seeing on the sign I was using for\n\ninspiration. But on numbers, there just wasn’t enough\n\nroom and it felt cramped. So, I set a guide to line up\n\nterminals at a certain height, and a second guide to line\n\nup the terminals of numbers a bit higher. There is con-\n\nsistency in the inconsistency!￼\n\nTHE FLIP TRICK￼\n\nAlso,  S is a  tough letter. The\n\ncurves! It frightens me every\n\ntime. A neat trick is to reuse that\n\nperfect  S you’ve spent hours on by flipping it horizon-\n\ntally, then adding a diagonal through it. This gives you\n\na great head start toward the equally-difficult and\n\n![Image](images/image-25.png)\n\n![Image](images/image-26.png)\n\n\nvaunted ampersand. Curves are generally more labor-\n\nintensive to get just right. So, once you nail it, be sure to\n\nget as much milage out of that hard work as possible.\n\nThat reuse will also be part of the glue that holds your\n\ntypeface together overall.￼\n\nBefore starting on a new charac-\n\nter, I’ll always look back at what\n\nI’ve already done and find a\n\ncurve, terminal, crossbar, etc. that will help build the\n\nnext one. It’s not always a perfect match, but regardless\n\nit helps move the design process along. “What if I flip\n\nthat 2 upside down? It’s kind of like a 5!” And then a few\n\nadjustments later, I have two numbers that feel right\n\ntogether.  \n\nFOLLOW THE MASTERS\n\nFor more guidance on the design of each letter, I highly\n\nrecommend following @grillitype and @ohnotypeco on\n\nInstagram. They both have their own invaluable series\n\nof posts on letterform design. Search for #GTAcademy\n\nand #ohnotypeschool, respectively.\n\n![Image](images/image-27.png)\n\n\n￼\n\n![Image](images/image-28.png)\n\n\n9.\n\nWhen in doubt,\n\nline up those\n\nhandles\n\nWhen drawing letters, trying to get a curve to “feel”\n\nright can be a maddening, never-ending twiddle fest.\n\nI’ll often find myself moving an anchor or handle\n\naround continuously, while changing my mind back\n\nand forth as to which position is better. This battle is\n\npart of the creation process, and I’ve come to accept\n\n\nthat. While working in Glyphs, I’ve found a few things\n\nthat help that process.\n\nOne thing to always try when in doubt of curve, is mak-\n\ning sure handles and/or anchors are lined up. Glyphs is\n\ngreat at showing feedback in the interface when an-\n\nchors and curve handles are perfectly aligned, showing\n\na red line that connects the two nodes. This is align-\n\nment confirmation is critical for ensuring letter shapes\n\nare uniform.￼\n\nLining up curve handle guides and ensuring they’re\n\nmatched and straight can go a long way in fixing trou-\n\nblesome shapes. Many times I’m asking myself, “Why\n\ndoesn’t this look natural?” The first thing I’ll check and\n\nadjust are anchor handle alignments and that’ll get me\n\non the right track.  \n\n![Image](images/image-29.png)\n\n\nOPTION + DRAG ANCHORS\n\nOne feature I absolutely love in Glyphs is the ability to\n\ndrag the anchor of a curve and independently  slide it\n\nbetween the handles.￼\n\nThe anchor will move, but the handles will remain\n\nlocked in place. This is especially handy for smoothing\n\nout any “bumps” you notice in the curves of your let-\n\nters. It’s amazing what a slight adjustment to the\n\nplacement of the anchor between the handles will do.\n\nI’m constantly sliding nodes to make sure I’m getting\n\nthe absolute maximum smoothness in the curve.\n\n![Image](images/image-30.png)\n\n\n￼\n\n![Image](images/image-31.png)\n\n\n9.\n\nType designers\n\nare optical\n\nillusionists\n\nI learned there are certain situations in type where op-\n\ntical illusions occur and and you have to adjust your\n\ncharacters in ways that seem counterintuitive. Round\n\nshapes, for instance, look smaller than flat shapes of\n\nthe same exact size when viewed side by side. It defies\n\nlogic, but let’s take a look.\n\n\nThis circle and square are exactly the same height, yet￼\n\nthe circle looks ever-so-slightly smaller. Crazy, right?!\n\nTo compensate, we make the circle just a tad larger to\n\nmake them appear in balance.￼\n\n![Image](images/image-32.png)\n\n![Image](images/image-33.png)\n\n\nThat extra bit is called “overshoot” [ 6 ](page-107.xhtml#footnote6) and it\ncomes into\n\nplay with any round shape like  S ,  O ,  Q ,  3 , etc. The\n\namount of overshoot can depend on how round the\n\ncurve is. Often it’s very subtle—just enough to achieve\n\nthat optical balance. But if you draw a straight line, it’ll\n\nbecome apparent.￼\n\n  \n\nPOINTY SHAPES NEED OVERSHOOT\n\nOvershoot is also needed with pointed shapes. For ex-\n\nample, say your typeface has sharp points on the  A ,  V ,\n\nW , etc. You’ll need to extend those points just a bit past\n\nthe baseline and/or cap height in order to get that per-\n\nfect balance. Let’s take a look at my Captain Edward\n\nfont, where the points aren’t extreme—but enough to\n\nwarrant just a touch of overshoot.\n\n![Image](images/image-34.png)\n\n\nCompare that with something sharper (like Futura￼\n\nshown below) and it becomes a bit more noticeable and\n\nyou’ll see the characters extending further out.￼\n\nThe illusions don’t stop there, folks. There are many\n\nmore and I’ll share one more that was really surprising\n\nto me.\n\n![Image](images/image-35.png)\n\n![Image](images/image-36.png)\n\n\nHORIZONTAL BARS\n\nAnother odd illusion happens with horizontal strokes.\n\nLet’s say we’re designing the plus sign. If we use the\n\nsame dimensions for both the vertical and horizontal\n\nstrokes, it looks off balance. In the figure below on the\n\nleft, the horizontal stroke looks too thick.￼\n\nIn the figure above on the right, the horizontal stroke is\n\nthinned out a little and things are looking more bal-\n\nanced [ 7 ](page-107.xhtml#footnote7) . Again, bizarre wizardry and science!\n\nYou’ll also find this illusion on characters like  T ,  L ,  E ,  F ,\n\netc. where the crossbars should be slightly thinner than\n\nthe vertical stems of the letters.  \n\n![Image](images/image-37.png)\n\n\n![border-image-2.png](images/border-image-2.png) ![border-\nimage-3.png](images/border-image-3.png)\n\nTHE EYE ALWAYS WINS\n\nDiscovering these optical anomalies helped me further\n\nrealize that while grids and precise measurements are\n\nimportant in designing type, calculation alone won’t\n\ndetermine how things look and feel. That could also be\n\nwhy I’ve taken to it so quickly. It’s that sweet spot of art\n\n\\+ math that’s so satisfying.\n\n“...we read with our eyes, not  \n\nwith rulers, so the eye should  \n\nwin every time.”\n\n— TOBIAS FRERE-JONES 6\n\n  \n\nI recommend reading Frere-Jones Type and Font-\n\nsmith’s articles (see the Endnotes of this book) for a\n\ndeeper dive into how optical illusions affect type de-\n\nsign. It’s all fascinating and must-have knowledge for\n\ncreating successful fonts.\n\n\n￼\n\n![Image](images/image-38.png)\n\n\n10.\n\nA–Z is easy; the\n\nrest is hard\n\nActually no, creating letters A–Z isn’t  easy , but after\n\ncompleting that part of the project, you’ll feel like\n\nyou’re almost done—only to find out there’s so much\n\nmore to do in order to make a font functional. Num-\n\nbers! Punctuation! Currency! Diacritics! And then\n\nthere’s spacing and kerning and testing and more kern-\n\ning. We’ll get to that later.\n\n\nI talked a little about reusing shapes back in bit #8, and\n\nthat’s essential for staying sane through the font-mak-\n\ning process. The other good news is that the non alpha-\n\nbetic characters that make up a well-stocked typeface\n\nsometimes go quicker than you’d think.\n\nFor example, once you have the period and comma de-\n\nsigned, you can quickly and easily knock out the colon,\n\nsemi-colon, all quotation marks, etc.￼\n\nThat’s like eight characters for the price of two.  \n\nACCENTED CHARACTERS\n\nDiacritics (the accents and marks found in letters like  å ,\n\né ,  ö ,  ñ , etc.) add a whole slew of additional characters\n\nto your font. Adding support for languages other than\n\nEnglish is an obvious win, making the font usable to\n\nmore folks across the globe.\n\n![Image](images/image-39.png)\n\n\nI owe superstar designer Jessica Hische [ 8 ](page-107.xhtml#footnote8) a debt\nof grati-\n\ntude for showing me how adding diacritics in Glyphs\n\napp works while I was working on my Ships Whistle\n\nfont. It turned out to be a rather efficient process,\n\nwhere we simply combine the base letter with any dia-\n\ncritic mark to create the additional characters.￼\n\nI designed the  A and then designed each diacritic mark\n\nseparately. Glyphs uses the concept of “anchors” that\n\nare placed on regular, unadorned letters. These anchors\n\nare locations where the diacritic marks will be auto-\n\nplaced. The idea being that￼ instead of creating six sepa-\n\nrate glyphs for each accented\n\ncharacter, you’ll create the set\n\nof marks only, and Glyphs app\n\nwill construct them all using\n\nthe base letter + each diacritic.\n\nThat way, any edits to that\n\noriginal  A will also update\n\neach accented character that\n\n![Image](images/image-40.png)\n\n![Image](images/image-41.png)\n\n\nuses  A as its base. You can move the top and bottom\n\nanchors to wherever you’d like those diacritic marks to\n\nshow up above and below the base letter.  \n\nRECOMMENDED CHARACTER SET\n\nThis revelation made adding accented characters to my\n\nfont feel a lot less daunting. It also expanded the lan-\n\nguage support for my font, extending its usefulness.\n\nFor Ships Whistle, I chose to add the characters specifi-\n\ncally required by MyFonts in their  Recommended Char-\n\nacter Set article [ 9 ](page-107.xhtml#footnote9) . They recommend a base\ncharacter set\n\nthat supports a few Western languages, and you’ll need\n\nthis set if you’d like to list your font on MyFonts. That’s\n\nnot an endorsement (I’ve had mixed luck listing my\n\nfont there) but it  is a nice compact set to aim for if\n\nyou’re looking to add diacritics to your fonts.\n\nYou can, of course, go much further than that set,\n\nadding support for even more languages.\n\n\nDON’T GET DISCOURAGED\n\nRemember, getting A–Z complete  is a major milestone\n\ntoward completing a font. There’s much to do beyond\n\nthat, so keep these points in mind:\n\n• Focus on display fonts first\n\n• CAPS FIRST\n\n• Many characters contain reused shapes\n\n• Diacritics use existing base letters + small set of\n\nmarks\n\n• Fonts are never finished and that’s okay :-)\n\nThat sums up where we’re at so far. And now, let’s move\n\non to what I found to be the most tedious (but critical)\n\nparts of creating fonts: Spacing and kerning. Grab a\n\nbeverage.\n\n\n￼\n\n![Image](images/image-42.png)\n\n\n11.\n\nSpacing ≠ kerning\n\nThe most laborious process when making a font is the\n\nspacing and kerning of each character. I was familiar\n\nwith kerning before my font-making journey, but  spac-\n\ning was something I hadn’t considered. That is, that\n\ncharacters in a font have “side bearings” or spacing\n\nbuilt into either side of the glyph. This is the default\n\nspace between characters, with zero kerning applied.\n\nThe key is to dial that default spacing into your font\n\nbefore adjusting any kerning for specific pairs of char-\n\n\n![border-image-4.png](images/border-image-4.png) ![border-\nimage-5.png](images/border-image-5.png)\n\nacters. The reason being, if you adjusted your entire\n\nfont with kerning, then had to go back and alter the\n\ndefault spacing, you’d have to start your kerning tweaks\n\nall over again. I’ve learned this the hard way, and trust\n\nme, it’s miserable.￼￼\n\nFor example, let’s say  V has equal left and right side\n\nbearings of 40 units, which feels appropriate when next\n\nto letters with flat sides (e.g. this boxy  O ).￼\n\n![KERNING… KERNING\n\nAdjusted space between specific pairings of characters.](images/image-43.png)\n\nKERNING\n\nAdjusted space between\n\nspecific pairings of\n\ncharacters.\n\n![SPACING… SPACING\n\nThe default space on either side of each character in a\nfont.](images/image-44.png)\n\nSPACING\n\nThe default space on\n\neither side of each\n\ncharacter in a font.\n\n![Image](images/image-45.png)\n\n\nBut when  L and  V are next to each other, that default\n\nside bearing of the  V needs to be far less—or in this\n\ncase a negative amount to tuck into the  L .￼\n\n  \n\nSTART WITH A SPACING BASE\n\nSo, when I’m first designing an alphabet, I’ll start with a\n\ndefault spacing of, say, 40-100 units on the left and\n\nright of each letter as a base. As I start testing various\n\ncharacters next to each other, I’ll adjust those side bear-\n\nings a bit until things are looking as good as possible\n\nwith only that default spacing. For instance, straight-\n\nsided letters like  H might have 100 units of spacing on\n\neither side, but slanted letters like  A ,  V ,  W , etc. will\n\nlikely have less. How much less will depend on the de-\n\nsign.\n\n![Image](images/image-46.png)\n\n\nOnly after I’ve adjusted spacing on all the letters will I\n\nstart adding kerning for specific pairs of letters. It’s the\n\nmost time-efficient way to work.  \n\nNUDGE BY 10\n\nAlso, in Glyphs I almost exclusively nudge spacing (and\n\nkerning) by multiples of 10. That gives me a fine\n\nenough control over things while still showing a visible\n\nenough change on the screen so that I can undo and\n\nredo to compare without having an absurd amount of\n\nbarely noticeable 1px shifts in between. Rarely do I\n\nneed to get finer than 10 units when spacing and/or\n\nkerning.\n\nJust hold down  Shift to nudge by 10.  Control + Shift +\n\nLeft/Right arrows to adjust spacing. And  Control + Op-\n\ntion + Shift + Left/Right arrows to adjust kerning.\n\nAnd finally, remember to…\n\n• Do all your spacing first\n\n• Finish spacing before doing kerning\n\n\n• If you adjust spacing after kerning,  \n\nyou’ll need to redo all kerning :(\n\n• Check spacing at a reasonable preview  \n\nsize (too small and spacing can be too  \n\ntight, too big too wide)\n\n• Don’t give up at this point  \n\n\n￼\n\n![Image](images/image-47.png)\n\n\n12.\n\nFinish all spacing\n\nbefore kerning\n\nThat’s it. I just wanted to remind you about that.\n\n\n￼\n\n![Image](images/image-48.png)\n\n\n14.\n\nKerning groups\n\nwill save your\n\nsanity\n\nKerning is an endless slog. A constant nudging left and\n\nright, second-guessing your adjustments every step of\n\nthe way. Kerning is never finished, it seems. It’s also a\n\nsickness. Once you start kerning your own fonts, you’ll\n\nnotice poor kerning everywhere, and it’ll slowly eat at\n\nyour soul.\n\n\nAhem. Okay, it’s not  that bad. And there are a few tech-\n\nniques to help make the process as smooth and effi-\n\ncient as possible.\n\nOne of those techniques is to use “kerning groups”—\n\nthat is, assigning a group name to left and/or right sides\n\nof a character that can be reused by other characters\n\nthat share a similar shape.￼\n\nLooking at my Rotundo font, letters like  H ,  N ,  M , and  E\n\nall have flat sides on both the left and right.￼\n\nOther letters have a flat side only on the left. The  J in\n\nRotondo has a flat side on the right, but this won’t be\n\ntrue for every typeface.\n\n![Image](images/image-49.png)\n\n![Image](images/image-50.png)\n\n\nOther glyphs may have round sides like  O and  Q , or\n\nonly round on one side like  D .￼\n\nIf we use kerning groups to gather up these similarly-\n\nshaped glyphs, we drastically reduce the number of\n\ntimes we need to kern certain pairings. This is helpful\n\nfor all-caps fonts, but a necessity for fonts that include\n\nupper and lowercase, large sets of accented characters,\n\netc. The amount of kerning grows exponentially along\n\nwith the size of the character set, and kerning groups\n\nhelp keep that work under control.  \n\nNAMING KERNING GROUPS IN GLYPHS\n\nIn Glyphs app, you have the ability to assign a group on\n\nboth the left and right side of each character by enter-\n\ning in a name in the info box underneath when editing.\n\nUse the same name on multiple characters and any\n\n![Image](images/image-51.png)\n\n\nkerning adjustments made to one character will also\n\nautomatically apply to others that share that group\n\nname.￼\n\nI’ve been keeping it fairly simple by creating the follow-\n\ning groups:\n\n• flatL – Characters with flat left sides\n\n• flatR – Characters with flat right sides\n\n• roundL – Characters with round left sides\n\n• roundR – Characters with round right sides\n\nFor other characters with unique shapes on one or both\n\nsides like  A ,  V ,  Y , and  Z , I’ll usually add the letter as the\n\ngroup name. This comes in handy if you have letters\n\nwith diacritic marks, or if you’ve drawn alternate styles\n\nfor the same letter (more on that later).\n\n![Image](images/image-52.png)\n\n\nESSENTIAL FOR DIACRITICS\n\nFor example, I have accented characters with diacritic\n\nmarks in Ships Whistle. Let’s look specifically at the\n\nones with A as a base.￼\n\nWhen I start kerning the letter  A against other charac-\n\nters—like, say,  AV —I’ll want that kerning to apply to\n\nthe accented characters as well. So I’ll create a kerning\n\ngroup called “A” and use it for all the A-style characters,\n\nwhich saves me the effort of kerning each of them indi-\n\nvidually.￼\n\n![Image](images/image-53.png)\n\n![Image](images/image-54.png)\n\n\nLater, if I end up adjusting the kerning between  A and\n\nV , I can do so knowing it’ll also adjust on the other six\n\naccented  A  characters as well.\n\nGroups are a real sanity-saver when it comes to kern-\n\ning, and the sooner you add them to your characters\n\nduring the font-making process, the better.\n\n\n￼\n\n![Image](images/image-55.png)\n\n\n15.\n\nMonoline is fun\n\nMonoline fonts are those whose strokes are equal\n\nthroughout each glyph, a steady line width that might\n\nhave been drawn with a giant felt-tip pen. Monolines\n\nare simpler to draw than fonts whose glyphs show con-\n\ntrast (often varying in thickness to mimic pressure ad-\n\njustments in a pen’s stroke).\n\nWhen designing them, monolines require just a single\n\nvector path that a stroke can be applied (rather than a\n\ncomplete shape that defines all of its points, inside and\n\n\n![border-image-6.png](images/border-image-6.png) ![border-\nimage-7.png](images/border-image-7.png)\n\nout). That stroke fills things out and can vary in thick-\n\nness. The endpoints can also be squared-off or round-\n\ned, creating some friendly vibes. ￼￼\n\nOne of the nice things about making a monoline font is\n\nthat you’re just concerned with the lines and curves\n\nonly. The weight of the glyphs can be changed at any\n\ntime, experimented with, and adjusted along the way\n\nwithout disturbing the core shapes. In a way, it’s a sim-\n\npler way of creating a font.￼\n\nBut monolines can become complex and nuanced, es-\n\npecially those that are cursive or script, with swashes\n\nand curvy decorations imitating handwriting. There’s\n\n![Image](images/image-56.png)\n\n![PATH PATH\n\n Image Rectangle](images/image-57.png)\n\nPATH\n\n![Image](images/image-58.png)\n\n![SHAPE SHAPE\n\n Image Rectangle](images/image-59.png)\n\nSHAPE\n\n![Image](images/image-60.png)\n\n\nan incredible amount of artistic skill involved with\n\nthese monolines.\n\nTHE GOOD & BAD OF MONOLINES\n\nI learned a few things about making monoline fonts\n\nwhile creating Ships Whistle.￼\n\nFiguring out the best way to apply a stroke to the bare\n\npaths in Glyphs was the first thing. At the time, my best\n\noption was a plugin for Glyphs called Noodler [ 10\n](page-107.xhtml#footnote10) . This\n\nrather simple plugin allowed me to specify the width of\n\nthe stroke, whether it had rounded ends, etc. I could\n\napply this plugin to the entire font easily, while still\n\nleaving the option open for adjusting as I went along\n\nwithout doing any harm to the base paths I was draw-\n\ning in the app.\n\n![Image](images/image-61.png)\n\n\nIn the latest version of Glyphs at the time of this writ-\n\ning (Glyphs 3) there is now a “Stroke” option built right\n\ninto the app with similar settings found in Noodler. I\n\nrecommend checking both out and seeing which works\n\nbest with the style of font you’re aiming for.  \n\nEASY AUTOMAGIC WEIGHTS?\n\nAt first I remember thinking, “Monolines make it super\n\neasy to create additional weights by just adjusting the\n\nstroke width!” Then I quickly realized that’s not neces-\n\nsarily true. While outputting multiple instances of the\n\nfont with different stroke settings, sure you’ll have dif-\n\nferent weights—but as the stroke gets heavier, the entire\n\ncharacter gets  larger , exceeding the baseline and cap\n\nheight compared to the original stroke. Which is not\n\nwhat you want in a font family with multiple weights.￼\n\n![Image](images/image-62.png)\n\n\nSo, while just changing the stroke weight didn’t magi-\n\ncally give me the ability to create an endless amount of\n\nfont weights, it did give me nice guidance for creating a\n\nRegular and Bold based off the same curves. I ended up\n\nsquishing the paths vertically a tad for the Bold weight\n\nto accommodate the extra height brought by the heav-\n\nier stroke. It was a lesson in how software can certainly\n\nmake the font making process easier, but sometimes\n\ndoing it right just takes extra time and labor.\n\nI’m refraining from getting into how interpolation and\n\nmultiple sets of master glyphs can be used to automati-\n\ncally calculate multiple weights in Glyphs [ 11 ](page-107.xhtml#footnote11)\n(and pre-\n\nsumably other apps). This book would need to expand\n\nto  200 Bits I Learned  if so .\n\nThe takeaway here is that monoline paths can be a fun\n\nand interesting way to construct typefaces, and you\n\nshould absolutely experiment with it.\n\n\n￼\n\n![Image](images/image-63.png)\n\n\n16.\n\nAdd personality\n\nwith alternates\n\nCan’t decide which  G or  Q is the right one for your font?\n\nWhy not include them both? Alternate characters offer\n\na nice way of expanding your font, giving it extra per-\n\nsonality and making it more enticing to use and pur-\n\nchase. Many applications (like Photoshop and Illustra-\n\ntor) have a Glyphs panel that will display all the avail-\n\nable characters in a font that can be used. In some apps\n\nthe alternate choices pop up when you select the char-\n\n\nacter. Either way, however many stylistic alternates you\n\nadd (and there is really no limit), the people using your\n\nfont in design software should be able to access them as\n\nadditional options.￼\n\n  \n\nCREATING ALTERNATES IN GLYPHS\n\nIn Glyphs app, they make this rather simple. Let’s say\n\nwe wanted to create an alternate for the letter  G . We’d\n\ncreate a new glyph and simply name it  G.ss01 .\n\nThe .ss01 refers to “Stylistic Set 01”. If you’d like a third\n\nG you could create a new glyph and name it  G.ss02 .￼\n\n![Image](images/image-64.png)\n\n![Image](images/image-65.png)\n\n\nWhen you export your font from Glyphs as an Open-\n\nType font, those extra  G s will be accessible as alternate\n\ncharacters in the software you’re rendering the font in\n\n(Word, Photoshop, etc.).\n\nIn addition to alternate takes on a letter, I like to add\n\nalternate characters in some other fun ways, adding\n\nicons that further support the theme of the typeface,\n\nfor example.￼\n\nOr creating little lockups for individual characters like\n\n# ,  @ ,  & , etc.￼\n\nOr little swashes and easter eggs that go along with the\n\ntheme of the font.￼\n\n![Image](images/image-66.png)\n\n![Image](images/image-67.png)\n\n![Image](images/image-68.png)\n\n\nYou can get wild with alternates, adding ornate and\n\ndecorative glyphs that make it easy for designers to\n\nconstruct their own art simply from the building blocks\n\nof your typeface. And as I mentioned before, they add\n\nnothing but value, extendibility, and personality to\n\nyour fonts.\n\n\n￼\n\n![Image](images/image-69.png)\n\n\n17.\n\nSurprise &\n\ndelight with\n\nligatures\n\nLike alternate characters, ligatures add more value and\n\nflexibility to your fonts. They can add another layer of\n\ncomplexity to the font-making process, but it may be\n\nworth it to make your font stand out and be that much\n\nmore useful.\n\n\n![border-image-8.png](images/border-image-8.png) ![border-\nimage-9.png](images/border-image-9.png)\n\nLigatures normally enhance the readability of your font\n\nby making the connections between two or more letters\n\nmore fluid and efficient. Discretionary ligatures are\n\nusually reserved for purely decorative purposes and\n\ncan be yet another chance to add personality to your\n\nfont.\n\nHere’s a comparison using Mark Simonson’s Bookma-\n\nnia font to illustrate the differences.￼￼\n\nLike alternate characters, designers can enable liga-\n\ntures and discretionary ligatures in OpenType fonts.\n\n![DISCRETIONARY LIGATURE… DISCRETIONARY LIGATURE\n\n Image\n\nDecorative flourishes that enhance the style of the\nfont.](images/image-70.png)\n\nDISCRETIONARY\n\nLIGATURE\n\nDecorative flourishes that\n\nenhance the style of the font.\n\n![Image](images/image-71.png)\n\n![LIGATURE… LIGATURE \n\n Image\n\nHelps readability between certain character pairs.](images/image-72.png)\n\nLIGATURE  \n\nHelps readability between\n\ncertain character pairs.\n\n![Image](images/image-73.png)\n\n\nADDING LIGATURES IN GLYPHS\n\nSpecifying ligatures in Glyphs is pretty simple. Just\n\nhead to the menu  Glyph > New Glyph and enter the\n\nname of the character pair you’d like to create, separat-\n\ned by underscores.￼\n\nFor example, I made a ligature for  ST in Ships Whistle,\n\nso I used the name  S_T for the ligature. Glyphs will au-\n\ntomatically pull the glyphs from both the  S and  T char-\n\nacters that you’ve already designed and place them into\n\nthis new ligature character. You can then modify things\n\nhowever you’d like. Once exported, anyone with Open-\n\n![Image](images/image-74.png)\n\n\nType ligatures enabled will get your  S_T ligature when\n\nthey type  ST with your font.\n\nThis naming convention works for building three or\n\nmore character strings as well. For instance, if you\n\nwanted to substitute  THE with a tasty, single discre-\n\ntionary ligature, you’d create a new glyph and name it￼\n\nT_H_E .\n\nIf it helps the readability of your font, and you have the\n\ntime to create some additional decorative features that\n\nwill enhance the typeface overall, definitely look into\n\nligatures.\n\n![Image](images/image-75.png)\n\n\n￼\n\n![Image](images/image-76.png)\n\n\n18.\n\nOld English\n\nletters are\n\nfascinating\n\nIn my efforts to add support for more languages in my\n\nfonts, I found that a few characters currently used in\n\nlanguages like Icelandic were also once used in the\n\nEnglish alphabet. And the history of these ancient let-\n\nters is pretty darn interesting.\n\n\nTHORN￼\n\nStill used in modern Icelandic, the letter\n\nthorn (shown here in upper and lower-\n\ncase) was used in Old English for the “th”\n\nsound that occurs in words like “this”\n\nand “the.” This is referred to as a “voiced” sound for\n\n“th.”\n\nWe’ve all seen signs that say something like, “Ye Olde\n\nTavern”—but it was meant to be pronounced “ The Old\n\nTavern,” using thorn for the “th” sound and written “Þe\n\nOlde Tavern.” Most printing press shops didn’t have the\n\nletter thorn and would substitute thorn with a  Y , hence\n\nseeing “Ye” instead. We’ve been reading these wrong\n\nthe whole time!  [ 12 ](page-107.xhtml#footnote12)  \n\nETH￼\n\nThe letter eth originated in the Irish lan-\n\nguage to represent a  voiceless “th” sound\n\nthat occurs in words like “think” and\n\n![Image](images/image-77.png)\n\n![Image](images/image-78.png)\n\n\n“thought.” It eventually became interchangeable with\n\nthorn and was discontinued in Irish, but still used in\n\nIcelandic, Faroese, and some other obscure Scandina-\n\nvian languages.\n\nASH￼\n\nAsh is another Old English letter\n\nthat left the English alphabet, but is\n\ncurrently used in Danish, Norwe-\n\ngian, Icelandic, and Faroese. Initially a ligature of  AE , it\n\nrepresented the “a” sound in “cat”. It’s still used occa-\n\nsionally in English when  ae occurs in words (like\n\narchæology), purely for stylistic reasons.  \n\nETHEL￼\n\nEthel is essentially a ligature of  OE\n\nand, in Old English, represented\n\nthe long “e” sound that occurs in\n\nwords like subpœna. It was later replaced by simply\n\nusing  e . These days, it’s used in French as well as in the\n\n![Image](images/image-79.png)\n\n![Image](images/image-80.png)\n\n\nphonetic alphabet to note that long “e” sound in Eng-\n\nlish.\n\nCreating these old letters that used to be part of the\n\nEnglish alphabet was a fun history ride when I started\n\ndigging into usage—but more importantly, they’re still\n\nused in other languages today. Adding these letters\n\n(and others!) can expand the language support for ye\n\nolde fonts—I mean your own fonts.\n\n\n￼\n\n![Image](images/image-81.png)\n\n\n19.\n\nAsk friends  \n\nfor help\n\nWhen it comes down to testing your fonts, the wonder-\n\nful thing is… everyone uses fonts . So you have an infinite\n\npool of potential helpers. Even technically inept folks\n\ncan provide basic-but-helpful critique.\n\nExporting a working font from Glyphs (or whatever app\n\nyou’re using) is something you can do at any point of\n\nthe font’s progress to check how it feels under real\n\n\nworld use. Like I mentioned earlier in the book, fonts\n\nare never finished and that’s a good thing. They lend\n\nthemselves well to iterative improvements. So it’s best\n\nto test early and often.\n\nYou can—and should—send these works-in-progress to\n\nfriends and colleagues for feedback. Even folks who\n\naren’t designers. Have them take it for a spin, find out\n\nwhat it’s missing, what kerning/spacing issues it may\n\nhave, etc. It’s amazing what another set of eyes will\n\nfind, quickly.  \n\nSOME TIPS ON TESTING FONTS\n\nIn addition to having others test your pre-release fonts,\n\nthere are also a few tricks I’ve found useful for testing\n\nthings within Glyphs itself before exporting.\n\nOne is using  Text for Proofing Fonts [ 13 ](page-107.xhtml#footnote13) , a\ngreat resource\n\nfrom Hoefler & Co. The article includes a large string of\n\ntext that (when pasted into your app of choice) will test\n\na multitude of various letter combinations to check\n\nyour kerning against (in upper and lowercase). Real\n\n\nwords with non-combo’d words strewn around to really\n\nget a  feel for how the kerning is working as you step\n\nthrough each pair of letters. Very helpful to start here.\n\nI also have a big text file of various letter, number, and\n\npunctuation patterns that I can paste into Glyphs’ pre-\n\nview to check kerning against. Some of the strings show\n\nhow every letter plays against every other letter of the\n\nalphabet:\n\nAABACADAEAFAGAHAIAJAKALAMANAOAPAQARAS\n\nATAUAVAWAXAYAZA\n\nOther strings show how certain punctuation aligns\n\nwith each letter and/or number:\n\n—A—B—C—D—E—F—G—H—I—J—K—L—M—N—O\n\n—P—Q—R—S—T—U—V—W—X—Y—Z—  \n\n.1.2.3.4.5.6.7.8.9.0.  \n\n,1,2,3,4,5,6,7,8,9,0,\n\n…and so on. There are dozens of strings to paste in and\n\ntest, and while tedious to run through them all, it\n\nensures you have as many bases covered as possible.\n\n\nThis  check-kerning.txt is something I found Googling a\n\nwhile back and I’ve forgotten exactly where. So I’ll\n\nshare it with you all as well—I’ve found it invaluable to\n\nquickly test as many kerning issues as possible before\n\nreleasing a font into the wild.\n\nDownload it here:  bit.ly/3mn605V\n\n\n￼\n\n![Image](images/image-82.png)\n\n\n20.\n\nSell your fonts\n\nYou did it. You made a font or two or three. Now don’t\n\nbe afraid to sell the little labors of love! I’ve chosen to\n\nsell my own fonts inside a Shopify-powered storefront I\n\nhad already set up to sell physical goods. It’s a nice op-\n\ntion for several reasons which I’ll get into in a bit.\n\nBut there are other avenues for selling fonts—some\n\neasy, some difficult. Font distribution is like most\n\ncommodities. There are large companies like MyFonts\n\nand Adobe who distribute a large pool of fonts, and\n\n\nsmaller companies or individuals (like Hoefler & Co., or\n\nLaura Worthington) who sell their fonts independently.\n\nThere are also collectives where other indie type de-\n\nsigners band together (e.g. Lost Type Co-op, Future\n\nFonts), and a few platforms that cater to selling fonts\n\nand other digital goods (e.g. Creative Market). I think\n\nthe key is getting your fonts out there to as many po-\n\ntential folks as possible. Your font needs to be seen in\n\norder to be wanted. Which probably sounds obvious.  \n\nSELLING FONT DOWNLOADS\n\nA few notes about how I have things set up in my\n\nShopify shop. I’m using a Shopify plugin called Send-\n\nOwl which has proved to be very useful. SendOwl hosts\n\nthe downloadable font files and handles the process of\n\nsending them to the customer. It easily connects to\n\nyour products in Shopify, which is very handy if you’re\n\nselling both digital and physical goods. Another great\n\nfeature in SendOwl is the ability to automatically send\n\nupdates to anyone who has previously purchased your\n\nfonts.\n\n\nWe talked earlier about how fonts are living things and\n\nnever finished, so this feature gives peace of mind for\n\npainlessly sending updates when needed—be it a mi-\n\nnor kerning issue or an entirely new width or weight.\n\nWhile Shopify wasn’t designed specifically for selling\n\nfonts, there are enough third-party apps and resources\n\n(like SendOwl and others) that can make this fairly\n\nsimple.\n\nAnother option is using Gumroad or Big Cartel’s service\n\nfor your storefront (coupled with their own Pulley app\n\nto manage the font downloads). Whichever route you\n\ngo, there will be some monthly fees involved.\n\nBut maybe you just want to make fonts for yourself, or\n\nfor a client project, or just to learn more about type.\n\nAnd that’s wonderful as well. Just remember that you\n\ndon’t need to be hired by a well-known foundry to start\n\ngetting your fonts out to the world—anyone can start\n\ntheir own.  \n\n\nCHEERS!\n\nI hope sharing some of the little bits I’ve learned during\n\nmy own font-making journey has been helpful in de-\n\nmystifying the process a little. Thanks for reading, and\n\nI wish you smooth curves, perfect kerning, and endless\n\ninspiration throughout your creative endeavors ahead.\n\nYou got this.\n\n\nENDNOTES\n\n[ 1 ](page-8.xhtml#footnote-ref1) https://en.wikipedia.org/wiki/Gill_Sans\n\n[ 2 ](page-24.xhtml#footnote-ref2) [ https://typehunting.com\n](https://typehunting.com)\n\n[ 3 ](page-24.xhtml#footnote-ref3) http://oa.letterformarchive.org\n\n[ 4 ](page-27.xhtml#footnote-ref4) https://hoodzpahdesign.com\n\n[ 5 ](page-31.xhtml#footnote-ref5) https://glyphsapp.com/learn/creating-an-\nall-caps-font\n\n[ 6 ](page-51.xhtml#footnote-ref6) https://frerejones.com/blog/typeface-\nmechanics-001\n\n[ 7 ](page-53.xhtml#footnote-ref7)\nhttps://www.fontsmith.com/blog/2016/06/27/optical-illusions-and-\n\neye-trickery-in-geometric-font-design\n\n[ 8 ](page-58.xhtml#footnote-ref8) https://jessicahische.is\n\n[ 9 ](page-59.xhtml#footnote-ref9) https://foundrysupport.monotype.com/hc/en-\nus/articles/\n\n360029280752\n\n[ 10 ](page-79.xhtml#footnote-ref10) https://github.com/mekkablue/Noodler\n\n[ 11 ](page-81.xhtml#footnote-ref11) https://glyphsapp.com/learn/multiple-\nmasters-part-1-setting-up-\n\nmasters\n\n[ 12 ](page-94.xhtml#footnote-ref12) https://readable.com/blog/the-five-lost-\nletters-of-the-english-lan-\n\nguage/\n\n[ 13 ](page-99.xhtml#footnote-ref13) https://www.typography.com/blog/text-for-\nproofing-fonts\n\n![Rectangle Rectangle](images/image-83.png)\n\n\nCOLOPHON\n\nArguably artistic doodles by Dan Cederholm using Adobe Draw for\n\niPad. The main text is set in Tiempos Text by Klim Type Foundry for\n\nbody copy, Captain Edward by SimpleBits for titles, and Brandon Text\n\nby Hannes von Döhren of HVD Fonts for numerals and sub-headings.  \n\nABOUT THE AUTHOR￼\n\nDan Cederholm is a designer, author, and type-\n\ntinkerer living in Salem, Massachusetts. He is the\n\nowner of SimpleBits, a tiny design studio and cre-\n\native goods shop. Previously, he co-founded Dribb-\n\nble, a community for designers, and Cork’d, which\n\nwas the web’s first social network for wine afi-\n\ncionados. Dan has written several other books on design and likes\n\noutside stuff, banjos, puppets, and ampersands.\n\n![Image](images/image-84.png)\n\n![Rectangle Rectangle](images/image-85.png)\n\n",
    "book_id": "twenty_bits_i_learned_about_making_fonts",
    "book_title": "Twenty Bits I Learned About Making Fonts",
    "book_author": "Dan Cederholm",
    "topic_id": "design_typography",
    "topic_label": "typography",
    "chunk_index": 0
  }
]